
export const RAW_COURT_CONST = `
พระธรรมนูญศาลยุติธรรม
หมวด ๑
บททั่วไป
มาตรา ๑ ศาลยุติธรรมตามพระธรรมนูญนี้มีสามชั้น คือ ศาลชั้นต้น ศาลชั้นอุทธรณ์ และศาลฎีกา เว้นแต่จะมีกฎหมายบัญญัติไว้เป็นอย่างอื่น
มาตรา ๒ ศาลชั้นต้น ได้แก่ ศาลแพ่ง ศาลแพ่งกรุงเทพใต้ ศาลแพ่งตลิ่งชัน ศาลแพ่งธนบุรี ศาลแพ่งพระโขนง ศาลแพ่งมีนบุรี ศาลอาญา ศาลอาญากรุงเทพใต้ ศาลอาญาตลิ่งชัน ศาลอาญาธนบุรี ศาลอาญาพระโขนง ศาลอาญามีนบุรี ศาลจังหวัด ศาลแขวง และศาลยุติธรรมอื่นที่พระราชบัญญัติจัดตั้งศาลนั้นกำหนดให้เป็นศาลชั้นต้น
มาตรา ๓ ศาลชั้นอุทธรณ์ ได้แก่ ศาลอุทธรณ์ ศาลอุทธรณ์ภาค และศาลยุติธรรมอื่นที่พระราชบัญญัติจัดตั้งศาลนั้นกำหนดให้เป็นศาลชั้นอุทธรณ์
มาตรา ๔ ศาลฎีกา ศาลชั้นอุทธรณ์ และศาลชั้นต้น อาจแบ่งส่วนราชการเป็นแผนกหรือหน่วยงานที่เรียกชื่ออย่างอื่น และจะให้มีอำนาจในคดีประเภทใดหรือคดีในท้องที่ใด ซึ่งอยู่ในเขตอำนาจของแต่ละศาลนั้นแยกต่างหากโดยเฉพาะก็ได้ โดยให้ออกเป็นประกาศคณะกรรมการบริหารศาลยุติธรรม
ศาลชั้นต้นอาจเปิดทำการสาขาในท้องที่อื่นใด และจะให้มีอำนาจในคดีประเภทใดหรือคดีในท้องที่ใด ซึ่งอยู่ในเขตอำนาจของศาลนั้นแยกต่างหากโดยเฉพาะก็ได้ โดยให้ออกเป็นประกาศคณะกรรมการบริหารศาลยุติธรรม
การกำหนดและการเปลี่ยนแปลงสถานที่ตั้งของศาล ให้ออกเป็นประกาศคณะกรรมการบริหารศาลยุติธรรม
ประกาศคณะกรรมการบริหารศาลยุติธรรมที่ออกตามความในมาตรานี้เมื่อประกาศในราชกิจจานุเบกษาแล้ว ให้ใช้บังคับได้
มาตรา ๕ ให้ประธานศาลฎีกามีหน้าที่วางระเบียบราชการฝ่ายตุลาการของศาลยุติธรรมเพื่อให้กิจการของศาลยุติธรรมดำเนินไปโดยเรียบร้อยและเป็นระเบียบเดียวกัน และให้ประธานศาลฎีกามีอำนาจให้คำแนะนำแก่ผู้พิพากษาในการปฏิบัติตามระเบียบวิธีการต่าง ๆ ที่กำหนดขึ้นโดยกฎหมายหรือโดยประการอื่นให้เป็นไปโดยถูกต้อง
มาตรา ๖ ให้เลขาธิการสำนักงานศาลยุติธรรมโดยความเห็นชอบของคณะกรรมการบริหารศาลยุติธรรมมีอำนาจเสนอความเห็นเกี่ยวกับการจัดตั้ง การยุบเลิก หรือการเปลี่ยนแปลงเขตอำนาจศาลของศาลยุติธรรมต่อคณะรัฐมนตรีเพื่อพิจารณาดำเนินการ ทั้งนี้ โดยคำนึงถึงจำนวน สภาพ สถานที่ตั้ง และเขตอำนาจศาลตามที่จำเป็นเพื่อให้การอำนวยความยุติธรรมแก่ประชาชนเป็นไปโดยเรียบร้อยตลอดราชอาณาจักร
มาตรา ๗ ให้คณะกรรมการบริหารศาลยุติธรรมกำหนดจำนวนผู้พิพากษาในศาลยุติธรรมให้เหมาะสมตามความจำเป็นแห่งราชการ
มาตรา ๘ ให้มีประธานศาลฎีกาประจำศาลฎีกาหนึ่งคน ประธานศาลอุทธรณ์ประจำศาลอุทธรณ์หนึ่งคน ประธานศาลอุทธรณ์ภาคประจำศาลอุทธรณ์ภาค ศาลละหนึ่งคน และให้มีอธิบดีผู้พิพากษาศาลชั้นต้นประจำศาลแพ่ง ศาลแพ่งกรุงเทพใต้ ศาลแพ่งตลิ่งชัน ศาลแพ่งธนบุรี ศาลแพ่งพระโขนง ศาลแพ่งมีนบุรี ศาลอาญา ศาลอาญากรุงเทพใต้ ศาลอาญาตลิ่งชัน ศาลอาญาธนบุรี ศาลอาญาพระโขนง ศาลอาญามีนบุรี และศาลยุติธรรมอื่นที่พระราชบัญญัติจัดตั้งศาลนั้นกำหนดให้เป็นศาลชั้นต้น ศาลละหนึ่งคน กับให้มีรองประธานศาลฎีกาประจำศาลฎีกา รองประธานศาลอุทธรณ์ประจำศาลอุทธรณ์ รองประธานศาลอุทธรณ์ภาคประจำศาลอุทธรณ์ภาค และรองอธิบดีผู้พิพากษาศาลชั้นต้นประจำศาลแพ่ง ศาลแพ่งกรุงเทพใต้ ศาลแพ่งตลิ่งชัน ศาลแพ่งธนบุรี ศาลแพ่งพระโขนง ศาลแพ่งมีนบุรี ศาลอาญา ศาลอาญากรุงเทพใต้ ศาลอาญาตลิ่งชัน ศาลอาญาธนบุรี ศาลอาญาพระโขนง ศาลอาญามีนบุรี และศาลยุติธรรมอื่นที่พระราชบัญญัติจัดตั้งศาลนั้นกำหนดให้เป็นศาลชั้นต้น ศาลละหนึ่งคน และในกรณีที่มีความจำเป็นเพื่อประโยชน์ในทางราชการ คณะกรรมการบริหารศาลยุติธรรมโดยความเห็นชอบของประธานศาลฎีกาจะกำหนดให้มีรองประธานศาลฎีกามากกว่าหนึ่งคนแต่ไม่เกินหกคน รองประธานศาลอุทธรณ์ รองประธานศาลอุทธรณ์ภาค หรือรองอธิบดีผู้พิพากษาศาลชั้นต้น มากกว่าหนึ่งคนแต่ไม่เกินสามคนก็ได้
เมื่อตำแหน่งประธานศาลฎีกา ประธานศาลอุทธรณ์ ประธานศาลอุทธรณ์ภาค หรืออธิบดีผู้พิพากษาศาลชั้นต้นว่างลง หรือเมื่อผู้ดำรงตำแหน่งดังกล่าวไม่อาจปฏิบัติราชการได้ให้รองประธานศาลฎีกา รองประธานศาลอุทธรณ์ รองประธานศาลอุทธรณ์ภาค หรือรองอธิบดีผู้พิพากษาศาลชั้นต้น แล้วแต่กรณี เป็นผู้ทำการแทน ถ้ามีรองประธานศาลฎีกา รองประธานศาลอุทธรณ์ รองประธานศาลอุทธรณ์ภาค หรือรองอธิบดีผู้พิพากษาศาลชั้นต้นหลายคน ให้รองประธานศาลฎีกา รองประธานศาลอุทธรณ์ รองประธานศาลอุทธรณ์ภาค หรือรองอธิบดีผู้พิพากษาศาลชั้นต้น ที่มีอาวุโสสูงสุดเป็นผู้ทำการแทน ถ้าผู้ที่มีอาวุโสสูงสุดไม่อาจปฏิบัติราชการได้ ให้ผู้ที่มีอาวุโสถัดลงมาตามลำดับเป็นผู้ทำการแทน
ในกรณีที่ไม่มีผู้ทำการแทนประธานศาลฎีกา ประธานศาลอุทธรณ์ ประธานศาลอุทธรณ์ภาค หรืออธิบดีผู้พิพากษาศาลชั้นต้นตามวรรคสอง หรือมีแต่ไม่อาจปฏิบัติราชการได้ ให้ผู้พิพากษาที่มีอาวุโสสูงสุดในศาลนั้นเป็นผู้ทำการแทน ถ้าผู้ที่มีอาวุโสสูงสุดไม่อาจปฏิบัติราชการได้ ให้ผู้พิพากษาที่มีอาวุโสถัดลงมาตามลำดับเป็นผู้ทำการแทน
ในกรณีที่ไม่มีผู้ทำการแทนตามวรรคสาม ประธานศาลฎีกาจะสั่งให้ผู้พิพากษาคนหนึ่งเป็นผู้ทำการแทนก็ได้
ผู้พิพากษาอาวุโสหรือผู้พิพากษาประจำศาลจะเป็นผู้ทำการแทนในตำแหน่งตามวรรคหนึ่งไม่ได้
มาตรา ๙ ในศาลจังหวัดหรือศาลแขวง ให้มีผู้พิพากษาหัวหน้าศาล ศาลละหนึ่งคน
เมื่อตำแหน่งผู้พิพากษาหัวหน้าศาลจังหวัดหรือผู้พิพากษาหัวหน้าศาลแขวงว่างลง หรือเมื่อผู้ดำรงตำแหน่งดังกล่าวไม่อาจปฏิบัติราชการได้ ให้ผู้พิพากษาที่มีอาวุโสสูงสุดในศาลนั้นเป็นผู้ทำการแทน ถ้าผู้ที่มีอาวุโสสูงสุดในศาลนั้นไม่อาจปฏิบัติราชการได้ ให้ผู้พิพากษาที่มีอาวุโสถัดลงมาตามลำดับในศาลนั้นเป็นผู้ทำการแทน
ในกรณีที่ไม่มีผู้ทำการแทนตามวรรคสอง ประธานศาลฎีกาจะสั่งให้ผู้พิพากษาคนหนึ่งเป็นผู้ทำการแทนก็ได้
ผู้พิพากษาอาวุโสหรือผู้พิพากษาประจำศาลจะเป็นผู้ทำการแทนในตำแหน่งตามวรรคหนึ่งไม่ได้
มาตรา ๑๐ ในกรณีที่มีการแบ่งส่วนราชการในศาลฎีกา ศาลชั้นอุทธรณ์ หรือศาลชั้นต้นออกเป็นแผนกหรือหน่วยงานที่เรียกชื่ออย่างอื่น ให้มีผู้พิพากษาหัวหน้าแผนกหรือผู้พิพากษาหัวหน้าหน่วยงานที่เรียกชื่ออย่างอื่น แผนกหรือหน่วยงานละหนึ่งคน
เมื่อตำแหน่งผู้พิพากษาหัวหน้าแผนกหรือผู้พิพากษาหัวหน้าหน่วยงานที่เรียกชื่ออย่างอื่นตามวรรคหนึ่งว่างลง หรือเมื่อผู้ดำรงตำแหน่งดังกล่าวไม่อาจปฏิบัติราชการได้ ให้ผู้พิพากษาที่มีอาวุโสสูงสุดในแผนกหรือในหน่วยงานที่เรียกชื่ออย่างอื่นนั้นเป็นผู้ทำการแทน ถ้าผู้ที่มีอาวุโสสูงสุดในแผนกหรือในหน่วยงานที่เรียกชื่ออย่างอื่นนั้นไม่อาจปฏิบัติราชการได้ ให้ผู้พิพากษาที่มีอาวุโสถัดลงมาตามลำดับในแผนกหรือในหน่วยงานที่เรียกชื่ออย่างอื่นนั้นเป็นผู้ทำการแทน
ในกรณีที่ไม่มีผู้ทำการแทนตามวรรคสอง ประธานศาลฎีกาจะสั่งให้ผู้พิพากษาคนหนึ่งเป็นผู้ทำการแทนก็ได้
    ผู้พิพากษาอาวุโสหรือผู้พิพากษาประจำศาลจะทำการแทนในตำแหน่งตามวรรคหนึ่งไม่ได้
มาตรา ๑๑ ประธานศาลฎีกา ประธานศาลอุทธรณ์ ประธานศาลอุทธรณ์ภาค อธิบดีผู้พิพากษาศาลชั้นต้น และผู้พิพากษาหัวหน้าศาล ต้องรับผิดชอบในราชการของศาลให้เป็นไปโดยเรียบร้อย และให้มีอำนาจหน้าที่ดังต่อไปนี้ด้วย
(๑) นั่งพิจารณาและพิพากษาคดีใด ๆ ของศาลนั้น หรือเมื่อได้ตรวจสำนวนคดีใดแล้วมีอำนาจทำความเห็นแย้งได้
   (๒) สั่งคำร้องคำขอต่าง ๆ ที่ยื่นต่อตนตามบทบัญญัติแห่งกฎหมายว่าด้วยวิธีพิจารณาความ
(๓) ระมัดระวังการใช้ระเบียบวิธีการต่าง ๆ ที่กำหนดขึ้นโดยกฎหมายหรือโดยประการอื่นให้เป็นไปโดยถูกต้อง เพื่อให้การพิจารณาพิพากษาคดีเสร็จเด็ดขาดไปโดยเร็ว
(๔) ให้คำแนะนำแก่ผู้พิพากษาในศาลนั้นในข้อขัดข้องเนื่องในการปฏิบัติหน้าที่ของผู้พิพากษา
(๕) ร่วมมือกับเจ้าพนักงานฝ่ายปกครองในบรรดากิจการอันเกี่ยวกับการจัดวางระเบียบและการดำเนินการงานส่วนธุรการของศาล
(๖) ทำรายงานการคดีและกิจการของศาลส่งตามระเบียบ
(๗) มีอำนาจหน้าที่อื่นตามที่กฎหมายกำหนด
ให้รองประธานศาลฎีกา รองประธานศาลอุทธรณ์ รองประธานศาลอุทธรณ์ภาค หรือรองอธิบดีผู้พิพากษาศาลชั้นต้น มีอำนาจตาม (๒) ด้วย และให้มีหน้าที่ช่วยประธานศาลฎีกา ประธานศาลอุทธรณ์ ประธานศาลอุทธรณ์ภาค หรืออธิบดีผู้พิพากษาศาลชั้นต้น แล้วแต่กรณี ตามที่ประธานศาลฎีกา ประธานศาลอุทธรณ์ ประธานศาลอุทธรณ์ภาค หรืออธิบดีผู้พิพากษาศาลชั้นต้นมอบหมาย
มาตรา ๑๒ ผู้พิพากษาหัวหน้าแผนกหรือผู้พิพากษาหัวหน้าหน่วยงานที่เรียกชื่ออย่างอื่นตามมาตรา ๑๐ วรรคหนึ่ง ต้องรับผิดชอบงานของแผนกหรือหน่วยงานที่เรียกชื่ออย่างอื่นให้เป็นไปโดยเรียบร้อยตามที่กำหนดไว้ในประกาศคณะกรรมการบริหารศาลยุติธรรมที่ได้จัดตั้งแผนกหรือหน่วยงานที่เรียกชื่ออย่างอื่นนั้น และต้องปฏิบัติตามคำสั่งของประธานศาลฎีกา ประธานศาลอุทธรณ์ ประธานศาลอุทธรณ์ภาค อธิบดีผู้พิพากษาศาลชั้นต้น หรือผู้พิพากษาหัวหน้าศาลนั้น
มาตรา ๑๓ ให้มีอธิบดีผู้พิพากษาภาค ภาคละหนึ่งคน จำนวนเก้าภาค มีสถานที่ตั้งและเขตอำนาจตามที่คณะกรรมการบริหารศาลยุติธรรมกำหนดโดยประกาศในราชกิจจานุเบกษา กับให้มีรองอธิบดีผู้พิพากษาภาค ภาคละสามคน ในกรณีที่มีความจำเป็นเพื่อประโยชน์ในทางราชการ คณะกรรมการบริหารศาลยุติธรรมโดยความเห็นชอบของประธานศาลฎีกาจะกำหนดให้มีรองอธิบดีผู้พิพากษาภาคมากกว่าสามคนแต่ไม่เกินหกคนก็ได้
เมื่อตำแหน่งอธิบดีผู้พิพากษาภาคว่างลง หรือเมื่อผู้ดำรงตำแหน่งดังกล่าวไม่อาจปฏิบัติราชการได้ ให้รองอธิบดีผู้พิพากษาภาคที่มีอาวุโสสูงสุดเป็นผู้ทำการแทน ถ้าผู้ที่มีอาวุโสสูงสุดไม่อาจปฏิบัติราชการได้ ให้ผู้ที่มีอาวุโสถัดลงมาตามลำดับเป็นผู้ทำการแทน
ในกรณีที่ไม่มีผู้ทำการแทนตามวรรคสอง ประธานศาลฎีกาจะสั่งให้ผู้พิพากษาคนหนึ่งเป็นผู้ทำการแทนก็ได้
ผู้พิพากษาอาวุโสหรือผู้พิพากษาประจำศาลจะเป็นผู้ทำการแทนในตำแหน่งตามวรรคหนึ่งไม่ได้
มาตรา ๑๔ ให้อธิบดีผู้พิพากษาภาคเป็นผู้พิพากษาในศาลที่อยู่ในเขตอำนาจด้วยผู้หนึ่ง โดยให้มีอำนาจและหน้าที่ตามที่กำหนดไว้ในมาตรา ๑๑ วรรคหนึ่ง และให้มีอำนาจหน้าที่ดังต่อไปนี้ด้วย
(๑) สั่งให้หัวหน้าสำนักงานประจำศาลยุติธรรมรายงานเกี่ยวด้วยคดี หรือรายงานกิจการอื่นของศาลที่อยู่ในเขตอำนาจของตน
(๒) ในกรณีจำเป็นจะสั่งให้ผู้พิพากษาคนใดคนหนึ่งในศาลที่อยู่ในเขตอำนาจของตนไปช่วยทำงานชั่วคราวมีกำหนดไม่เกินสามเดือนในอีกศาลหนึ่งโดยความยินยอมของผู้พิพากษานั้นก็ได้ แล้วรายงานไปยังประธานศาลฎีกาทันที
ให้รองอธิบดีผู้พิพากษาภาคเป็นผู้พิพากษาในศาลที่อยู่ในเขตอำนาจด้วย โดยให้มีอำนาจตามที่กำหนดไว้ในมาตรา ๑๑ วรรคหนึ่ง (๒) และให้มีหน้าที่ช่วยอธิบดีผู้พิพากษาภาคตามที่อธิบดีผู้พิพากษาภาคมอบหมาย
หมวด ๒
เขตอำนาจศาล
มาตรา ๑๕ ห้ามมิให้ศาลยุติธรรมศาลใดศาลหนึ่งรับคดีซึ่งศาลยุติธรรมอื่นได้สั่งรับประทับฟ้องโดยชอบแล้วไว้พิจารณาพิพากษา เว้นแต่คดีนั้นจะได้โอนมาตามบทบัญญัติแห่งกฎหมายว่าด้วยวิธีพิจารณาความหรือตามพระธรรมนูญศาลยุติธรรม
มาตรา ๑๖ ศาลชั้นต้นมีเขตตามที่พระราชบัญญัติจัดตั้งศาลนั้นกำหนดไว้ในกรณีที่มีความจำเป็นต้องเปลี่ยนแปลงเขตอำนาจศาลเพื่อประโยชน์ในการอำนวยความยุติธรรมแก่ประชาชน ให้ตราเป็นพระราชกฤษฎีกา
ศาลแพ่งและศาลอาญา มีเขตตลอดท้องที่กรุงเทพมหานครนอกจากท้องที่ที่อยู่ในเขตของศาลแพ่งกรุงเทพใต้ ศาลแพ่งตลิ่งชัน ศาลแพ่งธนบุรี ศาลแพ่งพระโขนง ศาลแพ่งมีนบุรี ศาลอาญากรุงเทพใต้ ศาลอาญาตลิ่งชัน ศาลอาญาธนบุรี ศาลอาญาพระโขนง ศาลอาญามีนบุรี และศาลยุติธรรมอื่นตามที่พระราชบัญญัติจัดตั้งศาลนั้นกำหนดไว้
ในกรณีที่มีการยื่นฟ้องคดีต่อศาลแพ่งหรือศาลอาญา และคดีนั้นเกิดขึ้นนอกเขตของศาลแพ่งหรือศาลอาญา ศาลแพ่งหรือศาลอาญา แล้วแต่กรณี อาจใช้ดุลพินิจยอมรับไว้พิจารณาพิพากษาหรือมีคำสั่งโอนคดีไปยังศาลยุติธรรมอื่นที่มีเขตอำนาจ
(ยกเลิก) 
มาตรา ๑๗ ศาลแขวงมีอำนาจพิจารณาพิพากษาคดี และมีอำนาจทำการไต่สวน หรือมีคำสั่งใด ๆ ซึ่งผู้พิพากษาคนเดียวมีอำนาจตามที่กำหนดไว้ในมาตรา ๒๔ และมาตรา ๒๕ วรรคหนึ่ง
มาตรา ๑๘ ภายใต้บังคับมาตรา ๑๙/๑ ศาลจังหวัดมีอำนาจพิจารณาพิพากษาคดีแพ่งและคดีอาญาทั้งปวงที่มิได้อยู่ในอำนาจของศาลยุติธรรมอื่น
มาตรา ๑๙ ศาลแพ่ง ศาลแพ่งกรุงเทพใต้ ศาลแพ่งตลิ่งชัน ศาลแพ่งธนบุรี ศาลแพ่งพระโขนง และศาลแพ่งมีนบุรีมีอำนาจพิจารณาพิพากษาคดีแพ่งทั้งปวงและคดีอื่นใดที่มิได้อยู่ในอำนาจของศาลยุติธรรมอื่น
ศาลอาญา ศาลอาญากรุงเทพใต้ ศาลอาญาตลิ่งชัน ศาลอาญาธนบุรี ศาลอาญาพระโขนง และศาลอาญามีนบุรีมีอำนาจพิจารณาพิพากษาคดีอาญาทั้งปวงที่มิได้อยู่ในอำนาจของศาลยุติธรรมอื่น รวมทั้งคดีอื่นใดที่มีกฎหมายบัญญัติให้อยู่ในอำนาจของศาลที่มีอำนาจพิจารณาพิพากษาคดีอาญา แล้วแต่กรณี
มาตรา ๑๙/๑ บรรดาคดีซึ่งเกิดขึ้นในเขตศาลแขวงและอยู่ในอำนาจของศาลแขวงนั้น ถ้ายื่นฟ้องต่อศาลแพ่ง ศาลแพ่งกรุงเทพใต้ ศาลแพ่งตลิ่งชัน ศาลแพ่งธนบุรี ศาลแพ่งพระโขนง ศาลแพ่งมีนบุรี ศาลอาญา ศาลอาญากรุงเทพใต้ ศาลอาญาตลิ่งชัน ศาลอาญาธนบุรี ศาลอาญาพระโขนง ศาลอาญามีนบุรี หรือศาลจังหวัด ให้อยู่ในดุลพินิจของศาลดังกล่าวที่จะยอมรับพิจารณาคดีใดคดีหนึ่งที่ยื่นฟ้องเช่นนั้นหรือมีคำสั่งโอนคดีไปยังศาลแขวงที่มีเขตอำนาจก็ได้ และไม่ว่ากรณีจะเป็นประการใด หากศาลแพ่ง ศาลแพ่งกรุงเทพใต้ ศาลแพ่งตลิ่งชัน ศาลแพ่งธนบุรี ศาลแพ่งพระโขนง ศาลแพ่งมีนบุรี ศาลอาญา ศาลอาญากรุงเทพใต้ ศาลอาญาตลิ่งชัน ศาลอาญาธนบุรี ศาลอาญาพระโขนง ศาลอาญามีนบุรี หรือศาลจังหวัด ได้มีคำสั่งรับฟ้องคดีเช่นว่านั้นไว้แล้ว ให้ศาลดังกล่าวพิจารณาพิพากษาคดีนั้นต่อไป
ในกรณีที่ขณะยื่นฟ้องคดีนั้นเป็นคดีที่อยู่ในอำนาจศาลแพ่ง ศาลแพ่งกรุงเทพใต้ ศาลแพ่งตลิ่งชัน ศาลแพ่งธนบุรี ศาลแพ่งพระโขนง ศาลแพ่งมีนบุรี ศาลอาญา ศาลอาญากรุงเทพใต้ ศาลอาญาตลิ่งชัน ศาลอาญาธนบุรี ศาลอาญาพระโขนง ศาลอาญามีนบุรี หรือศาลจังหวัดอยู่แล้ว แม้ต่อมาจะมีพฤติการณ์เปลี่ยนแปลงไปทำให้คดีนั้นเป็นคดีที่อยู่ในอำนาจของศาลแขวง ก็ให้ศาลดังกล่าวพิจารณาพิพากษาคดีนั้นต่อไป
มาตรา ๒๐ ศาลยุติธรรมอื่นมีอำนาจพิจารณาพิพากษาคดีตามที่พระราชบัญญัติจัดตั้งศาลนั้นหรือกฎหมายอื่นกำหนดไว้
มาตรา ๒๑ ศาลอุทธรณ์มีเขตตลอดท้องที่ที่มิได้อยู่ในเขตศาลอุทธรณ์ภาค
ในกรณีที่มีการยื่นอุทธรณ์คดีต่อศาลอุทธรณ์ และคดีนั้นอยู่นอกเขตของศาลอุทธรณ์ ศาลอุทธรณ์อาจใช้ดุลพินิจยอมรับไว้พิจารณาพิพากษาหรือมีคำสั่งโอนคดีนั้นไปยังศาลอุทธรณ์ภาคที่มีเขตอำนาจ
มาตรา ๒๒ ศาลอุทธรณ์และศาลอุทธรณ์ภาคมีอำนาจพิจารณาพิพากษาบรรดาคดีที่อุทธรณ์คำพิพากษาหรือคำสั่งของศาลชั้นต้น ตามบทบัญญัติแห่งกฎหมายว่าด้วยการอุทธรณ์ และว่าด้วยเขตอำนาจศาล และมีอำนาจดังต่อไปนี้
(๑) พิพากษายืนตาม แก้ไข กลับ หรือยกคำพิพากษาของศาลชั้นต้นที่พิพากษาลงโทษประหารชีวิตหรือจำคุกตลอดชีวิต ในเมื่อคดีนั้นได้ส่งขึ้นมายังศาลอุทธรณ์และศาลอุทธรณ์ภาคตามที่บัญญัติไว้ในกฎหมายวิธีพิจารณาความอาญา
(๒) วินิจฉัยชี้ขาดคำร้องคำขอที่ยื่นต่อศาลอุทธรณ์หรือศาลอุทธรณ์ภาคตามกฎหมาย
(๓) วินิจฉัยชี้ขาดคดีที่ศาลอุทธรณ์และศาลอุทธรณ์ภาคมีอำนาจวินิจฉัยได้ตามกฎหมายอื่น
มาตรา ๒๓ ศาลฎีกามีอำนาจพิจารณาพิพากษาคดีที่รัฐธรรมนูญหรือกฎหมายบัญญัติให้เสนอต่อศาลฎีกาได้โดยตรง และคดีที่อุทธรณ์หรือฎีกาคำพิพากษาหรือคำสั่งของศาลชั้นต้น ศาลอุทธรณ์ หรือศาลอุทธรณ์ภาคตามที่กฎหมายบัญญัติ เว้นแต่กรณีที่ศาลฎีกาเห็นว่าข้อกฎหมายหรือข้อเท็จจริงที่อุทธรณ์หรือฎีกานั้นจะไม่เป็นสาระอันควรแก่การพิจารณา ศาลฎีกามีอำนาจไม่รับคดีไว้พิจารณาพิพากษาได้ ทั้งนี้ ตามระเบียบที่ที่ประชุมใหญ่ศาลฎีกากำหนดโดยประกาศในราชกิจจานุเบกษา
คดีที่ศาลฎีกาได้พิจารณาพิพากษาหรือมีคำสั่งแล้ว คู่ความไม่มีสิทธิที่จะทูลเกล้าฯ ถวายฎีกาคัดค้านคดีนั้นต่อไป
หมวด ๓
องค์คณะผู้พิพากษา
มาตรา ๒๔ ให้ผู้พิพากษาคนหนึ่งมีอำนาจดังต่อไปนี้
(๑) ออกหมายเรียก หมายอาญา หรือหมายสั่งให้ส่งคนมาจากหรือไปยังจังหวัดอื่น
(๒) ออกคำสั่งใด ๆ ซึ่งมิใช่เป็นไปในทางวินิจฉัยชี้ขาดข้อพิพาทแห่งคดี
มาตรา ๒๕ ในศาลชั้นต้น ผู้พิพากษาคนเดียวเป็นองค์คณะมีอำนาจเกี่ยวแก่คดีซึ่งอยู่ในอำนาจของศาลนั้น ดังต่อไปนี้
(๑) ไต่สวนและวินิจฉัยชี้ขาดคำร้องหรือคำขอที่ยื่นต่อศาลในคดีทั้งปวง
(๒) ไต่สวนและมีคำสั่งเกี่ยวกับวิธีการเพื่อความปลอดภัย
(๓) ไต่สวนมูลฟ้องและมีคำสั่งในคดีอาญา
(๔) พิจารณาพิพากษาคดีแพ่ง ซึ่งราคาทรัพย์สินที่พิพาทหรือจำนวนเงินที่ฟ้องไม่เกินสามแสนบาท ราคาทรัพย์สินที่พิพาทหรือจำนวนเงินดังกล่าวอาจขยายได้โดยการตราเป็นพระราชกฤษฎีกา
(๕) พิจารณาพิพากษาคดีอาญา ซึ่งกฎหมายกำหนดอัตราโทษอย่างสูงไว้ให้จำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ แต่จะลงโทษจำคุกเกินหกเดือน หรือปรับเกินหนึ่งหมื่นบาท หรือทั้งจำทั้งปรับ ซึ่งโทษจำคุกหรือปรับอย่างใดอย่างหนึ่งหรือทั้งสองอย่างเกินอัตราที่กล่าวแล้วไม่ได้
ผู้พิพากษาประจำศาลไม่มีอำนาจตาม (๓) (๔) หรือ (๕)
มาตรา ๒๖ ภายใต้บังคับมาตรา ๒๕ ในการพิจารณาพิพากษาคดีของศาลชั้นต้น นอกจากศาลแขวงและศาลยุติธรรมอื่นซึ่งพระราชบัญญัติจัดตั้งศาลนั้นกำหนดไว้เป็นอย่างอื่น ต้องมีผู้พิพากษาอย่างน้อยสองคนและต้องไม่เป็นผู้พิพากษาประจำศาลเกินหนึ่งคน จึงเป็นองค์คณะที่มีอำนาจพิจารณาพิพากษาคดีแพ่งหรือคดีอาญาทั้งปวง
มาตรา ๒๗ ในการพิจารณาพิพากษาคดีของศาลอุทธรณ์ ศาลอุทธรณ์ภาค หรือศาลฎีกา ต้องมีผู้พิพากษาอย่างน้อยสามคน จึงเป็นองค์คณะที่มีอำนาจพิจารณาพิพากษาคดีได้
ผู้พิพากษาศาลอุทธรณ์ ผู้พิพากษาศาลอุทธรณ์ภาค และผู้พิพากษาศาลฎีกา ที่เข้าประชุมใหญ่ในศาลนั้นหรือในแผนกคดีของศาลดังกล่าว เมื่อได้ตรวจสำนวนคดีที่ประชุมใหญ่หรือที่ประชุมแผนกคดีแล้ว มีอำนาจพิพากษาหรือทำคำสั่งคดีนั้นได้ และเฉพาะในศาลอุทธรณ์หรือศาลอุทธรณ์ภาคมีอำนาจทำความเห็นแย้งได้ด้วย
มาตรา ๒๘ ในระหว่างการพิจารณาคดีใด หากมีเหตุสุดวิสัยหรือมีเหตุจำเป็นอื่นอันมิอาจก้าวล่วงได้ ทำให้ผู้พิพากษาซึ่งเป็นองค์คณะในการพิจารณาคดีนั้น ไม่อาจจะนั่งพิจารณาคดีต่อไป ให้ผู้พิพากษาดังต่อไปนี้นั่งพิจารณาคดีนั้นแทนต่อไปได้
(๑) ในศาลฎีกา ได้แก่ ประธานศาลฎีกา หรือรองประธานศาลฎีกา หรือผู้พิพากษาในศาลฎีกาซึ่งประธานศาลฎีกามอบหมาย
(๒) ในศาลอุทธรณ์หรือศาลอุทธรณ์ภาค ได้แก่ ประธานศาลอุทธรณ์ ประธานศาลอุทธรณ์ภาค หรือรองประธานศาลอุทธรณ์ รองประธานศาลอุทธรณ์ภาค หรือผู้พิพากษาในศาลอุทธรณ์หรือศาลอุทธรณ์ภาคซึ่งประธานศาลอุทธรณ์หรือประธานศาลอุทธรณ์ภาค แล้วแต่กรณี มอบหมาย
(๓) ในศาลชั้นต้น ได้แก่ อธิบดีผู้พิพากษาศาลชั้นต้น อธิบดีผู้พิพากษาภาค ผู้พิพากษาหัวหน้าศาล หรือรองอธิบดีผู้พิพากษาศาลชั้นต้น รองอธิบดีผู้พิพากษาภาค หรือผู้พิพากษาในศาลชั้นต้นของศาลนั้น ซึ่งอธิบดีผู้พิพากษาศาลชั้นต้น อธิบดีผู้พิพากษาภาค หรือผู้พิพากษาหัวหน้าศาล แล้วแต่กรณี มอบหมาย
ให้ผู้ทำการแทนในตำแหน่งต่าง ๆ ตามมาตรา ๘ มาตรา ๙ และมาตรา ๑๓ มีอำนาจตาม (๑) (๒) และ (๓) ด้วย
มาตรา ๒๙ ในระหว่างการทำคำพิพากษาคดีใด หากมีเหตุสุดวิสัยหรือเหตุจำเป็นอื่นอันมิอาจก้าวล่วงได้ ทำให้ผู้พิพากษาซึ่งเป็นองค์คณะในการพิจารณาคดีนั้นไม่อาจจะทำคำพิพากษาในคดีนั้นต่อไปได้ ให้ผู้พิพากษาดังต่อไปนี้มีอำนาจลงลายมือชื่อทำคำพิพากษา และเฉพาะในศาลอุทธรณ์ ศาลอุทธรณ์ภาค และศาลชั้นต้น มีอำนาจทำความเห็นแย้งได้ด้วย ทั้งนี้ หลังจากได้ตรวจสำนวนคดีนั้นแล้ว
(๑) ในศาลฎีกา ได้แก่ ประธานศาลฎีกาหรือรองประธานศาลฎีกา
(๒) ในศาลอุทธรณ์หรือศาลอุทธรณ์ภาค ได้แก่ ประธานศาลอุทธรณ์ ประธานศาลอุทธรณ์ภาค รองประธานศาลอุทธรณ์ หรือรองประธานศาลอุทธรณ์ภาค แล้วแต่กรณี
(๓) ในศาลชั้นต้น ได้แก่ อธิบดีผู้พิพากษาศาลชั้นต้น อธิบดีผู้พิพากษาภาค รองอธิบดีผู้พิพากษาศาลชั้นต้น รองอธิบดีผู้พิพากษาภาค หรือผู้พิพากษาหัวหน้าศาล แล้วแต่กรณี
ให้ผู้ทำการแทนในตำแหน่งต่าง ๆ ตามมาตรา ๘ มาตรา ๙ และมาตรา ๑๓ มีอำนาจตาม (๑) (๒) และ (๓) ด้วย
มาตรา ๓๐ เหตุจำเป็นอื่นอันมิอาจก้าวล่วงได้ตามมาตรา ๒๘ และมาตรา ๒๙ หมายถึง กรณีที่ผู้พิพากษาซึ่งเป็นองค์คณะนั่งพิจารณาคดีนั้นพ้นจากตำแหน่งที่ดำรงอยู่หรือถูกคัดค้านและถอนตัวไป หรือไม่อาจปฏิบัติราชการจนไม่สามารถนั่งพิจารณาหรือทำคำพิพากษาในคดีนั้นได้
มาตรา ๓๑ เหตุจำเป็นอื่นอันมิอาจก้าวล่วงได้ตามมาตรา ๒๘ และมาตรา ๒๙ นอกจากที่กำหนดไว้ในมาตรา ๓๐ แล้ว ให้หมายความรวมถึงกรณีดังต่อไปนี้ด้วย
(๑) กรณีที่ผู้พิพากษาคนเดียวไต่สวนมูลฟ้องคดีอาญาแล้วเห็นว่าควรพิพากษายกฟ้อง แต่คดีนั้นมีอัตราโทษตามที่กฎหมายกำหนดเกินกว่าอัตราโทษตามมาตรา ๒๕ (๕)
(๒) กรณีที่ผู้พิพากษาคนเดียวพิจารณาคดีอาญาตามมาตรา ๒๕ (๕) แล้วเห็นว่าควรพิพากษาลงโทษจำคุกเกินกว่าหกเดือน หรือปรับเกินหนึ่งหมื่นบาท หรือทั้งจำทั้งปรับ ซึ่งโทษจำคุกหรือปรับนั้นอย่างใดอย่างหนึ่ง หรือทั้งสองอย่างเกินอัตราดังกล่าว
(๓) กรณีที่คำพิพากษาหรือคำสั่งคดีแพ่งเรื่องใดของศาลนั้นจะต้องกระทำโดยองค์คณะซึ่งประกอบด้วยผู้พิพากษาหลายคน และผู้พิพากษาในองค์คณะนั้นมีความเห็นแย้งกันจนหาเสียงข้างมากมิได้
(๔) กรณีที่ผู้พิพากษาคนเดียวพิจารณาคดีแพ่งตามมาตรา ๒๕ (๔) ไปแล้ว ต่อมาปรากฏว่าราคาทรัพย์สินที่พิพาทหรือจำนวนเงินที่ฟ้องเกินกว่าอำนาจพิจารณาพิพากษาของผู้พิพากษาคนเดียว
หมวด ๔
การจ่าย การโอน และการเรียกคืนสำนวนคดี
มาตรา ๓๒ ให้ประธานศาลฎีกา ประธานศาลอุทธรณ์ ประธานศาลอุทธรณ์ภาค อธิบดีผู้พิพากษาศาลชั้นต้น ผู้พิพากษาหัวหน้าศาล หรือผู้พิพากษาหัวหน้าแผนกคดีในแต่ละศาล แล้วแต่กรณี รับผิดชอบในการจ่ายสำนวนคดีให้แก่องค์คณะผู้พิพากษาในศาลหรือในแผนกคดีนั้น โดยให้ปฏิบัติตามหลักเกณฑ์และวิธีการที่กำหนดโดยระเบียบราชการฝ่ายตุลาการของศาลยุติธรรม
การออกระเบียบราชการฝ่ายตุลาการของศาลยุติธรรมตามวรรคหนึ่ง ให้คำนึงถึงความเชี่ยวชาญและความเหมาะสมขององค์คณะผู้พิพากษาที่จะรับผิดชอบสำนวนคดีนั้น รวมทั้งปริมาณคดีที่องค์คณะผู้พิพากษาแต่ละองค์คณะรับผิดชอบ
มาตรา ๓๓ การเรียกคืนสำนวนคดีหรือการโอนสำนวนคดีซึ่งอยู่ในความรับผิดชอบขององค์คณะผู้พิพากษาใด ประธานศาลฎีกา ประธานศาลอุทธรณ์ ประธานศาลอุทธรณ์ภาค อธิบดีผู้พิพากษาศาลชั้นต้น หรือผู้พิพากษาหัวหน้าศาล จะกระทำได้ต่อเมื่อเป็นกรณีที่จะกระทบกระเทือนต่อความยุติธรรมในการพิจารณาหรือพิพากษาอรรถคดีของศาลนั้น และรองประธานศาลฎีกา รองประธานศาลอุทธรณ์ รองประธานศาลอุทธรณ์ภาค รองอธิบดีผู้พิพากษาศาลชั้นต้น หรือผู้พิพากษาในศาลจังหวัดหรือศาลแขวง ที่มีอาวุโสสูงสุดในศาลนั้น แล้วแต่กรณี ที่มิได้เป็นองค์คณะในสำนวนคดีดังกล่าวได้เสนอความเห็นให้กระทำได้[21]
ในกรณีที่รองประธานศาลฎีกา รองประธานศาลอุทธรณ์ รองประธานศาลอุทธรณ์ภาค รองอธิบดีผู้พิพากษาศาลชั้นต้น หรือผู้พิพากษาในศาลจังหวัดหรือศาลแขวง ที่มีอาวุโสสูงสุดในศาลนั้น แล้วแต่กรณี ไม่อาจปฏิบัติราชการได้ หรือได้เข้าเป็นองค์คณะในสำนวนคดีที่เรียกคืนหรือโอนนั้น ให้รองประธานศาลฎีกา รองประธานศาลอุทธรณ์ รองประธานศาลอุทธรณ์ภาค รองอธิบดีผู้พิพากษาศาลชั้นต้น หรือผู้พิพากษา ที่มีอาวุโสถัดลงมาตามลำดับในศาลนั้น เป็นผู้มีอำนาจในการเสนอความเห็นแทน ในกรณีที่รองประธานศาลฎีกา รองประธานศาลอุทธรณ์ รองประธานศาลอุทธรณ์ภาค รองอธิบดีผู้พิพากษาศาลชั้นต้น มีหนึ่งคน หรือมีหลายคนแต่ไม่อาจปฏิบัติราชการได้หรือได้เข้าเป็นองค์คณะในสำนวนคดีที่เรียกคืนหรือโอนนั้นทั้งหมด ให้ผู้พิพากษาที่มีอาวุโสสูงสุดของศาลนั้นเป็นผู้มีอำนาจในการเสนอความเห็น[22]
ผู้พิพากษาอาวุโสหรือผู้พิพากษาประจำศาลไม่มีอำนาจในการเสนอความเห็นตามวรรคหนึ่งหรือวรรคสอง
ในกรณีที่ผู้พิพากษาเจ้าของสำนวนหรือองค์คณะผู้พิพากษามีคดีค้างการพิจารณาอยู่เป็นจำนวนมาก ซึ่งจะทำให้การพิจารณาพิพากษาคดีของศาลนั้นล่าช้า และผู้พิพากษาเจ้าของสำนวนหรือองค์คณะผู้พิพากษานั้นขอคืนสำนวนคดีที่ตนรับผิดชอบอยู่ ให้ประธานศาลฎีกา ประธานศาลอุทธรณ์ ประธานศาลอุทธรณ์ภาค อธิบดีผู้พิพากษาศาลชั้นต้น หรือผู้พิพากษาหัวหน้าศาล แล้วแต่กรณี มีอำนาจรับคืนสำนวนคดีดังกล่าว และโอนให้ผู้พิพากษาหรือองค์คณะผู้พิพากษาอื่นในศาลนั้นรับผิดชอบแทนได้
`;
