
export const RAW_KWAENG = `
พระราชบัญญัติ
จัดตั้งศาลแขวงและวิธีพิจารณาความอาญาในศาลแขวง
พ.ศ. ๒๔๙๙
มาตรา ๑ พระราชบัญญัตินี้เรียกว่า “พระราชบัญญัติจัดตั้งศาลแขวงและวิธีพิจารณาความอาญาในศาลแขวง พ.ศ. ๒๔๙๙”
มาตรา ๒ พระราชบัญญัตินี้ให้ใช้บังคับเมื่อพ้นหกสิบวันนับแต่วันประกาศในราชกิจจานุเบกษาเป็นต้นไป
มาตรา ๓ ให้ตั้งศาลแขวงตามกฎหมายว่าด้วยพระธรรมนูญศาลยุติธรรมขึ้นในทุกจังหวัด ในจังหวัดหนึ่งจะมีศาลแขวงกี่ศาล และมีเขตอำนาจเพียงใด และจะเปิดทำการได้เมื่อใด ให้ประกาศโดยพระราชกฤษฎีกา
ศาลแขวงที่ได้ตั้งขึ้นก่อนวันที่พระราชบัญญัตินี้ใช้บังคับให้คงมีอยู่ต่อไป และมีอำนาจหน้าที่ตามพระราชบัญญัตินี้
การเปลี่ยนแปลงเขตอำนาจศาลแขวง ให้ประกาศโดยพระราชกฤษฎีกา
มาตรา ๔ ให้นำวิธีพิจารณาความอาญาตามบทบัญญัติแห่งพระราชบัญญัตินี้มาใช้บังคับในศาลแขวง แต่ในกรณีที่ไม่มีบทบัญญัติในพระราชบัญญัตินี้บังคับ ให้คงใช้กฎหมายว่าด้วยพระธรรมนูญศาลยุติธรรม กฎหมายว่าด้วยวิธีพิจารณาความอาญา กฎหมายว่าด้วย วิธีพิจารณาความแพ่งบังคับ แต่ทั้งนี้ไม่กระทบกระเทือนกฎหมายว่าด้วยการจัดตั้งศาลคดีเด็กและเยาวชนและกฎหมายว่าด้วยวิธีพิจารณาคดีเด็กและเยาวชน
มาตรา ๕ (ยกเลิก) มาตรา ๖ (ยกเลิก)
มาตรา ๗ ในการสอบสวนคดีอาญาที่อยู่ในอำนาจศาลแขวงที่จะพิจารณาพิพากษาได้ เมื่อมีการจับตัวผู้ต้องหาแล้ว ให้พนักงานสอบสวนผู้รับผิดชอบส่งตัวผู้ต้องหาพร้อมด้วยสำนวนการสอบสวนไปยังพนักงานอัยการ เพื่อให้พนักงานอัยการยื่นฟ้องต่อศาลแขวงให้ทันภายในกำหนดเวลาสี่สิบแปดชั่วโมงนับแต่วันที่ผู้ต้องหาถูกจับ แต่มิให้นับเวลาเดินทางตามปกติที่นำตัวผู้ต้องหาจากที่จับมายังที่ทำการของพนักงานสอบสวน จากที่ทำการของพนักงานสอบสวนหรือจากที่ทำการของพนักงานอัยการมาศาลเข้าในกำหนดเวลาสี่สิบแปดชั่วโมงนั้นด้วย
ในกรณีที่ไม่มีการจับแต่พนักงานสอบสวนได้แจ้งข้อหาแก่ผู้ต้องหาแล้ว ให้พนักงานสอบสวนผู้รับผิดชอบส่งสำนวนการสอบสวนไปยังพนักงานอัยการพร้อมกับสั่งให้ผู้ต้องหาไปพบพนักงานอัยการเพื่อให้พนักงานอัยการยื่นฟ้องต่อศาลแขวงให้ทันภายในกำหนดเวลาสี่สิบแปดชั่วโมงนับแต่เวลาที่ผู้ต้องหาได้รับแจ้งข้อหา แต่มิให้นับเวลาเดินทางตามปกติจาก ที่ทำการของพนักงานสอบสวนหรือจากที่ทำการของพนักงานอัยการมาศาลเข้าในกำหนดเวลาสี่สิบแปดชั่วโมงนั้นด้วย
ในกรณีที่เกิดความจำเป็นไม่สามารถฟ้องผู้ต้องหาต่อศาลให้ทันภายในกำหนดเวลาดังกล่าวในวรรคหนึ่งหรือวรรคสอง ให้พนักงานสอบสวนหรือพนักงานอัยการ แล้วแต่กรณี ยื่นคำร้องต่อศาลเพื่อขอผัดฟ้องต่อไปได้อีกคราวละไม่เกินหกวัน แต่ทั้งนี้ต้องไม่เกินสามคราว ในการวินิจฉัยคำร้องเช่นว่านี้ ถ้ามีการขอให้ขังผู้ต้องหาด้วยหรือผู้ต้องหาแสดงตัวต่อศาลให้ศาลสอบถามผู้ต้องหาว่าจะมีข้อคัดค้านประการใดหรือไม่ และศาลอาจเรียกพนักงานสอบสวนหรือพนักงานอัยการมาชี้แจงเหตุจำเป็น หรืออาจเรียกพยานมาเบิกความประกอบก็ได้
เมื่อศาลสั่งอนุญาตให้ผัดฟ้องครบสามคราวแล้ว หากพนักงานสอบสวนหรือพนักงานอัยการยื่นคำร้องต่อศาลเพื่อขอผัดฟ้องต่อไปอีกโดยอ้างเหตุจำเป็น ศาลจะอนุญาตตามขอนั้นได้ก็ต่อเมื่อพนักงานสอบสวนหรือพนักงานอัยการได้แสดงถึงเหตุจำเป็นและนำพยานมาเบิกความประกอบจนเป็นที่พอใจแก่ศาล ถ้ามีการขอให้ขังผู้ต้องหาด้วยหรือผู้ต้องหาแสดงตัวต่อศาล ให้ศาลสอบถามผู้ต้องหาว่าจะมีข้อคัดค้านประการใดหรือไม่ ในกรณีเช่นว่านี้ ศาลมีอำนาจสั่งอนุญาตให้ผัดฟ้องต่อไปได้คราวละไม่เกินหกวันแต่ทั้งนี้ต้องไม่เกินสองคราว
ผู้ต้องหาจะแต่งทนายความเพื่อแถลงข้อคัดค้านและซักถามพยานก็ได้
ในระหว่างการสอบสวนของพนักงานสอบสวน หากผู้ต้องหาซึ่งถูกแจ้งข้อหาได้หลบหนีไป ให้พนักงานสอบสวนผู้รับผิดชอบทำการสอบสวนต่อไปโดยเร็ว และถ้าการสอบสวนได้เสร็จสิ้นลงแล้ว ให้พนักงานสอบสวนผู้รับผิดชอบส่งสำนวนการสอบสวนไปยังพนักงานอัยการเพื่อพิจารณาสั่งต่อไป โดยให้นำมาตรา ๑๔๑ แห่งประมวลกฎหมายวิธีพิจารณาความอาญา มาใช้บังคับโดยอนุโลม ในกรณีที่ระยะเวลาการขอผัดฟ้องตามมาตรานี้ได้สิ้นสุดลงในระหว่างที่ผู้ต้องหาหลบหนี และพนักงานอัยการมีคำสั่งฟ้อง พนักงานอัยการอาจขออนุญาตฟ้องคดีต่ออัยการสูงสุดตามมาตรา ๙ ไว้ก่อนก็ได้
มาตรา ๗ ทวิ ในกรณีที่ผู้ต้องหาหลบหนีจากการควบคุมหรือการขัง มิให้นับระยะเวลาที่ผู้ต้องหาหลบหนีนั้นเข้าในกำหนดระยะเวลาที่บัญญัติไว้ในมาตรา ๗
ในกรณีที่ได้มีการส่งตัวผู้ต้องหาไปดำเนินคดียังศาลทหารหรือศาลคดีเด็กและเยาวชน หากปรากฏในภายหลังว่าผู้ต้องหาไม่ได้อยู่ในอำนาจของศาลทหารหรือศาลคดีเด็กและเยาวชน ตามกฎหมายว่าด้วยธรรมนูญศาลทหารหรือตามกฎหมายว่าด้วยวิธีพิจารณาคดีเด็กและเยาวชน แล้วแต่กรณี และมีการส่งตัวผู้ต้องหามายังพนักงานสอบสวนเพื่อดำเนินคดี ในศาลแขวงต่อไปนั้น มิให้นับระยะเวลาที่ผู้ต้องหาถูกควบคุมตัวหรือขังอยู่ตามกฎหมายดังกล่าวนั้นเข้าในกำหนดระยะเวลาดังบัญญัติไว้ในมาตรา ๗
มาตรา ๘ ในคดีอาญาที่อยู่ในอำนาจศาลแขวงที่จะพิจารณาพิพากษาได้นั้น การควบคุมตัวผู้ต้องหาให้เป็นไปตามกฎหมายว่าด้วยวิธีพิจารณาความอาญา แต่กรณีจะเป็นอย่างไรก็ตาม พนักงานฝ่ายปกครองหรือตำรวจจะควบคุมตัวผู้ต้องหาไว้เกินกว่ากำหนดเวลาดังกล่าวในมาตรา ๗ วรรคหนึ่ง มิได้
ถ้าผู้ต้องหาอยู่ในความควบคุมของพนักงานฝ่ายปกครองหรือตำรวจ ให้พนักงานสอบสวนหรือพนักงานอัยการ แล้วแต่กรณี นำตัวผู้ต้องหามาส่งศาลพร้อมกับการยื่นคำร้องขอผัดฟ้อง และขอให้ศาลออกหมายขังผู้ต้องหาไว้ แต่ถ้าผู้ต้องหาป่วยอยู่ในสภาพที่ไม่อาจนำมาศาลได้ ให้พนักงานสอบสวนหรือพนักงานอัยการขออนุญาตศาลรวมมาในคำขอ ให้ศาลออกหมายขังผู้ต้องหา โดยมีพยานหลักฐานประกอบจนเป็นที่พอใจแก่ศาลในเหตุ ที่ไม่อาจนำตัวผู้ต้องหามาศาลได้ ในกรณีที่ศาลสั่งอนุญาตให้ผัดฟ้อง ให้ศาลออกหมายขังผู้ต้องหาเท่ากับระยะเวลาที่ศาลอนุญาตให้ผัดฟ้องนั้น
ในกรณีที่ผู้ต้องหาตกอยู่ในความควบคุมของพนักงานฝ่ายปกครองหรือตำรวจหลังจากที่ศาลอนุญาตให้ผัดฟ้องแล้ว ให้พนักงานสอบสวนหรือพนักงานอัยการนำตัวผู้ต้องหา มาส่งศาลในโอกาสแรกที่จะส่งได้เพื่อขอให้ศาลออกหมายขังผู้ต้องหาไว้ ให้ศาลออกหมายขังผู้ต้องหาเท่ากับระยะเวลาที่ศาลอนุญาตให้ผัดฟ้อง
คำขอให้ศาลออกหมายขังผู้ต้องหาจะขอรวมมาในคำร้องขอผัดฟ้องก็ได้ ในกรณีที่ศาลเห็นสมควรศาลจะมีคำสั่งให้ส่งตัวผู้ต้องหาไปอยู่ในความควบคุมของพนักงานฝ่ายปกครองหรือตำรวจตามเดิมก็ได้ กรณีจะเป็นอย่างไรก็ตาม ศาลจะออกหมายขังผู้ต้องหาหรือมีคำสั่งให้ส่งตัวผู้ต้องหาไปอยู่ในความควบคุมของพนักงานฝ่ายปกครองหรือตำรวจเกินกว่าเวลาที่กฎหมายว่าด้วยวิธีพิจารณาความอาญากำหนดไว้มิได้
ถ้าผู้ต้องหาไม่ได้อยู่ในความควบคุมของพนักงานฝ่ายปกครองหรือตำรวจ แต่พนักงานสอบสวนได้สั่งให้ผู้ต้องหาไปศาลเพื่อขอออกหมายขังตามมาตรา ๑๓๔ วรรคห้า แห่งประมวลกฎหมายวิธีพิจารณาความอาญา ให้พนักงานสอบสวนหรือพนักงานอัยการ แล้วแต่กรณี ยื่นคำร้องขอผัดฟ้องพร้อมกับขอให้ศาลออกหมายขังผู้ต้องหาไว้ และให้นำ มาตรา ๗ วรรคสาม วรรคสี่ และวรรคห้า มาใช้บังคับโดยอนุโลม ในกรณีที่ศาลสั่งอนุญาตให้ผัดฟ้องให้ศาลออกหมายขังผู้ต้องหาเท่ากับระยะเวลาที่ศาลอนุญาตให้ผัดฟ้อง แต่ถ้าการขอให้ออกหมายขังดังกล่าวกระทำภายหลังจากที่ศาลมีคำสั่งอนุญาตให้ผัดฟ้องแล้ว ให้ศาลออกหมายขังผู้ต้องหาได้เท่ากับระยะเวลาที่ศาลอนุญาตให้ผัดฟ้อง
บทบัญญัติในมาตรานี้ไม่กระทบกระทั่งอำนาจของศาลที่จะสั่งให้ปล่อยตัวผู้ต้องหาชั่วคราว
มาตรา ๙ ห้ามมิให้พนักงานอัยการฟ้องคดีเมื่อพ้นกำหนดระยะเวลาตามมาตรา ๗ เว้นแต่จะได้รับอนุญาตจากอัยการสูงสุด หรือพนักงานอัยการผู้มีตำแหน่งไม่ต่ำกว่าอธิบดีอัยการหรืออธิบดีอัยการภาค ซึ่งอัยการสูงสุดมอบหมาย ทั้งนี้ ให้พนักงานอัยการผู้ได้รับมอบหมายรายงานผลการดำเนินการดังกล่าวให้อัยการสูงสุดทราบด้วย
การขออนุญาตและการอนุญาตตามวรรคหนึ่ง ให้เป็นไปตามหลักเกณฑ์ วิธีการและเงื่อนไขที่กำหนดในข้อบังคับของอัยการสูงสุด
มาตรา ๑๐ (ยกเลิก) มาตรา ๑๑ (ยกเลิก)
มาตรา ๑๒ ในคดีอาญาที่อยู่ในอำนาจศาลแขวงที่จะพิจารณาพิพากษาได้ ในกรณีที่มีคำสั่งไม่ฟ้อง และคำสั่งนั้นไม่ใช่ของอธิบดีกรมอัยการ ถ้าในกรุงเทพมหานคร ให้รีบส่งสำนวนการสอบสวนพร้อมกับคำสั่งเสนออธิบดีกรมตำรวจ รองอธิบดีกรมตำรวจหรือผู้ช่วยอธิบดีกรมตำรวจ ถ้าในจังหวัดอื่นให้รีบส่งสำนวนการสอบสวนพร้อมกับคำสั่งเสนอผู้ว่าราชการจังหวัด แต่ทั้งนี้มิได้ตัดอำนาจพนักงานอัยการที่จะจัดการปล่อยผู้ต้องหา ปล่อยชั่วคราว ควบคุมไว้ หรือขอให้ศาลขัง แล้วแต่กรณี และจัดการหรือสั่งการให้เป็นไปตามนั้น
ในกรณีที่อธิบดีกรมตำรวจ รองอธิบดีกรมตำรวจหรือผู้ช่วยอธิบดีกรมตำรวจในกรุงเทพมหานคร หรือผู้ว่าราชการจังหวัดในจังหวัดอื่น แย้งคำสั่งของพนักงานอัยการให้ส่งสำนวนพร้อมกับความเห็นที่แย้งกันไปยังอธิบดีกรมอัยการเพื่อชี้ขาด แต่ถ้าคดีจะขาดอายุความ หรือมีเหตุอย่างอื่นอันจำเป็นจะต้องรีบฟ้อง ก็ให้ฟ้องคดีนั้นตามความเห็นของอธิบดีกรมตำรวจ รองอธิบดีกรมตำรวจ ผู้ช่วยอธิบดีกรมตำรวจหรือผู้ว่าราชการจังหวัด ไปก่อน
บทบัญญัติในมาตรานี้ ให้นำมาบังคับในการที่พนักงานอัยการจะไม่อุทธรณ์ ไม่ฎีกาหรือถอนฟ้อง ถอนอุทธรณ์และถอนฎีกา โดยอนุโลม
มาตรา ๑๓ (ยกเลิก)มาตรา ๑๔ (ยกเลิก)มาตรา ๑๕ (ยกเลิก)มาตรา ๑๖ (ยกเลิก) มาตรา ๑๗ (ยกเลิก)มาตรา ๑๘ (ยกเลิก)
มาตรา ๑๙ ในคดีอาญาที่อยู่ในอำนาจศาลแขวง ที่จะพิจารณาพิพากษาได้ ผู้เสียหายหรือพนักงานอัยการจะฟ้องด้วยวาจาหรือเป็นหนังสือก็ได้ แต่ถ้าจำเลยร้องขอหรือศาลเห็นสมควร จะสั่งให้ฟ้องเป็นหนังสือก็ได้
การฟ้องด้วยวาจานั้น ให้โจทก์แจ้งต่อศาลถึงชื่อโจทก์ ชื่อ ที่อยู่ และสัญชาติของจำเลย ฐานความผิด การกระทำที่อ้างว่าจำเลยได้กระทำความผิด ข้อเท็จจริง และรายละเอียดเกี่ยวกับเวลา สถานที่ และอื่น ๆ ที่เกี่ยวข้องพอสมควรเท่าที่จะให้จำเลยเข้าใจข้อหาได้ดี และมาตราในกฎหมายซึ่งบัญญัติว่า การกระทำเช่นนั้นเป็นความผิด
จำเลยจะให้การด้วยวาจาหรือเป็นหนังสือก็ได้
ในกรณีที่ฟ้องหรือให้การด้วยวาจา ให้ศาลบันทึกใจความไว้เป็นหลักฐานและให้คู่ความลงชื่อไว้
คำเบิกความของพยาน ให้ศาลบันทึกสารสำคัญโดยย่อ และให้พยานลงชื่อไว้
มาตรา ๒๐ ในคดีอาญาที่อยู่ในอำนาจศาลแขวงที่จะพิจารณาพิพากษาได้ ถ้าผู้ต้องหาให้การรับสารภาพตลอดข้อหาต่อพนักงานสอบสวน ให้พนักงานสอบสวนนำผู้ต้องหามายังพนักงานอัยการหรือสั่งให้ผู้ต้องหาไปพบพนักงานอัยการในกรณีที่ผู้ต้องหามิได้ถูกควบคุมตัวเพื่อฟ้องศาลโดยมิต้องทำการสอบสวน และให้ฟ้องด้วยวาจา ให้ศาลถามผู้ต้องหาว่าจะให้การประการใด และถ้าผู้ต้องหายังให้การรับสารภาพ ให้ศาลบันทึกคำฟ้อง คำรับสารภาพ และทำคำพิพากษาในบันทึกฉบับเดียวกัน แล้วให้โจทก์จำเลยลงชื่อไว้ในบันทึกนั้น ถ้าผู้ต้องหาให้การปฏิเสธให้ศาลสั่งให้พนักงานอัยการรับตัวผู้ต้องหาคืนเพื่อดำเนินการต่อไป
มาตรา ๒๑ ให้ศาลแขวงดำเนินการพิจารณาโดยเร็ว คำสั่งหรือคำพิพากษาจะกระทำด้วยวาจาก็ได้ แต่ให้ทำบันทึกไว้พอได้ใจความ
มาตรา ๒๑ ทวิ (ยกเลิก)
มาตรา ๒๒ ในคดีอาญาห้ามมิให้อุทธรณ์คำพิพากษาของศาลแขวงในปัญหาข้อเท็จจริง เว้นแต่ในกรณีต่อไปนี้ให้จำเลยอุทธรณ์ในปัญหาข้อเท็จจริงได้
(๑) จำเลยต้องคำพิพากษาให้ลงโทษจำคุก หรือให้ลงโทษกักขังแทนโทษจำคุก
(๒) จำเลยต้องคำพิพากษาให้ลงโทษจำคุก แต่ศาลรอการลงโทษไว้
(๓) ศาลพิพากษาว่าจำเลยมีความผิด แต่รอการกำหนดโทษไว้หรือ
(๔) จำเลยต้องคำพิพากษาให้ลงโทษปรับเกินหนึ่งพันบาท
มาตรา ๒๒ ทวิ ในคดีซึ่งต้องห้ามอุทธรณ์ตามมาตรา ๒๒ ถ้าผู้พิพากษาคนใดซึ่งพิจารณาหรือลงชื่อในคำพิพากษาหรือทำความเห็นแย้งในศาลแขวงพิเคราะห์เห็นว่าข้อความที่ตัดสินนั้นเป็นปัญหาสำคัญอันควรสู่ศาลอุทธรณ์และอนุญาตให้อุทธรณ์ หรืออธิบดีกรมอัยการหรือพนักงานอัยการซึ่งอธิบดีกรมอัยการได้มอบหมายลงลายมือชื่อรับรองในอุทธรณ์ว่ามีเหตุอันควรที่ศาลอุทธรณ์จะได้วินิจฉัย ก็ให้รับอุทธรณ์นั้นไว้พิจารณาต่อไป
มาตรา ๒๓ (ยกเลิก)มาตรา ๒๔ (ยกเลิก)มาตรา ๒๕ (ยกเลิก)
มาตรา ๒๖ ให้ประธานศาลฎีกา นายกรัฐมนตรี รัฐมนตรีว่าการกระทรวงมหาดไทยและอัยการสูงสุด รักษาการตามพระราชบัญญัตินี้
ให้ประธานศาลฎีกาและอัยการสูงสุดมีอำนาจออกข้อบังคับ และนายกรัฐมนตรี และรัฐมนตรีว่าการกระทรวงมหาดไทยมีอำนาจออกกฎกระทรวง เพื่อปฏิบัติการตามพระราชบัญญัตินี้ ทั้งนี้ ในส่วนที่เกี่ยวกับอำนาจหน้าที่ของตน
กฎกระทรวงหรือข้อบังคับนั้น เมื่อได้ประกาศในราชกิจจานุเบกษาแล้วให้ใช้บังคับได้
บทเฉพาะกาล
มาตรา ๒๗ (ยกเลิก)มาตรา ๒๘ (ยกเลิก)
มาตรา ๒๙ คดีอาญาทั้งหลายซึ่งอยู่ในระหว่างการสอบสวนของพนักงานสอบสวน การดำเนินคดีของพนักงานอัยการ หรือการพิจารณาของศาลก่อนวันใช้วิธีพิจารณาความอาญาตามบทบัญญัติแห่งพระราชบัญญัตินี้ ให้คงเป็นไปตามกฎหมายซึ่งใช้บังคับอยู่ก่อนนั้นจนกว่าจะถึงที่สุด
`;
