
export const RAW_CRIMINAL_CODE = `
ประมวลกฎหมายอาญา
ภาค ๑
บทบัญญัติทั่วไป
ลักษณะ ๑
บทบัญญัติที่ใช้แก่ความผิดทั่วไป
หมวด ๑
บทนิยาม
มาตรา ๑ ในประมวลกฎหมายนี้
(๑) “โดยทุจริต” หมายความว่า เพื่อแสวงหาประโยชน์ที่มิควรได้โดยชอบด้วยกฎหมายสำหรับตนเองหรือผู้อื่น
(๒) “ทางสาธารณ” หมายความว่า ทางบกหรือทางน้ำสำหรับประชาชนใช้ในการจราจร และให้หมายความรวมถึงทางรถไฟและทางรถรางที่มีรถเดิน สำหรับประชาชนโดยสารด้วย
(๓) “สาธารณสถาน” หมายความว่า สถานที่ใด ๆ ซึ่งประชาชนมีความชอบธรรมที่จะเข้าไปได้
(๔) “เคหสถาน” หมายความว่า ที่ซึ่งใช้เป็นที่อยู่อาศัย เช่น เรือน โรง เรือ หรือแพ ซึ่งคนอยู่อาศัย และให้หมายความรวมถึงบริเวณของที่ซึ่งใช้เป็นที่อยู่อาศัยนั้นด้วย จะมีรั้วล้อมหรือไม่ก็ตาม
(๕) “อาวุธ” หมายความรวมถึงสิ่งซึ่งไม่เป็นอาวุธโดยสภาพ แต่ซึ่งได้ใช้หรือเจตนาจะใช้ประทุษร้ายร่างกายถึงอันตรายสาหัสอย่างอาวุธ
(๖) “ใช้กำลังประทุษร้าย” หมายความว่า ทำการประทุษร้ายแก่กายหรือจิตใจของบุคคล ไม่ว่าจะทำด้วยใช้แรงกายภาพหรือด้วยวิธีอื่นใด และให้หมายความรวมถึงการกระทำใด ๆ ซึ่งเป็นเหตุให้บุคคลหนึ่งบุคคลใดอยู่ในภาวะที่ไม่สามารถขัดขืนได้ ไม่ว่าจะโดยใช้ยาทำให้มึนเมา สะกดจิตหรือใช้วิธีอื่นใดอันคล้ายคลึงกัน
(๗) “เอกสาร” หมายความว่า กระดาษหรือวัตถุอื่นใดซึ่งได้ทำให้ปรากฏความหมายด้วยตัวอักษร ตัวเลข ผังหรือแผนแบบอย่างอื่น จะเป็นโดยวิธีพิมพ์ถ่ายภาพหรือวิธีอื่นอันเป็นหลักฐานแห่งความหมายนั้น
(๘) “เอกสารราชการ” หมายความว่า เอกสารซึ่งเจ้าพนักงานได้ทำขึ้นหรือรับรองในหน้าที่ และให้หมายความรวมถึงสำเนาเอกสารนั้น ๆ ที่เจ้าพนักงานได้รับรองในหน้าที่ด้วย
(๙) “เอกสารสิทธิ” หมายความว่า เอกสารที่เป็นหลักฐานแห่งการก่อ เปลี่ยนแปลง โอน สงวนหรือระงับซึ่งสิทธิ
(๑๐) “ลายมือชื่อ” หมายความรวมถึงลายพิมพ์นิ้วมือและเครื่องหมายซึ่งบุคคลลงไว้แทนลายมือชื่อของตน
(๑๑) “กลางคืน” หมายความว่า เวลาระหว่างพระอาทิตย์ตกและพระอาทิตย์ขึ้น
(๑๒) “คุมขัง” หมายความว่า คุมตัว ควบคุม ขัง กักขังหรือจำคุก
(๑๓) “ค่าไถ่” หมายความว่า ทรัพย์สินหรือประโยชน์ที่เรียกเอา หรือให้เพื่อแลกเปลี่ยนเสรีภาพของผู้ถูกเอาตัวไป ผู้ถูกหน่วงเหนี่ยวหรือผู้ถูกกักขัง
(๑๔)  “บัตรอิเล็กทรอนิกส์” หมายความว่า
(ก) เอกสารหรือวัตถุอื่นใดไม่ว่าจะมีรูปลักษณะใดที่ผู้ออกได้ออกให้แก่ผู้มีสิทธิใช้ ซึ่งจะระบุชื่อหรือไม่ก็ตาม โดยบันทึกข้อมูลหรือรหัสไว้ด้วยการประยุกต์ใช้วิธีการทางอิเล็กตรอน ไฟฟ้า คลื่นแม่เหล็กไฟฟ้า หรือวิธีอื่นใดในลักษณะคล้ายกัน ซึ่งรวมถึงการประยุกต์ใช้วิธีการทางแสงหรือวิธีการทางแม่เหล็กให้ปรากฏความหมายด้วยตัวอักษร ตัวเลข รหัส หมายเลขบัตร หรือสัญลักษณ์อื่นใด ทั้งที่สามารถมองเห็นและมองไม่เห็นด้วยตาเปล่า
(ข) ข้อมูล รหัส หมายเลขบัญชี หมายเลขชุดทางอิเล็กทรอนิกส์หรือเครื่องมือทางตัวเลขใด ๆ ที่ผู้ออกได้ออกให้แก่ผู้มีสิทธิใช้ โดยมิได้มีการออกเอกสารหรือวัตถุอื่นใดให้ แต่มีวิธีการใช้ในทำนองเดียวกับ (ก) หรือ
(ค) สิ่งอื่นใดที่ใช้ประกอบกับข้อมูลอิเล็กทรอนิกส์เพื่อแสดงความสัมพันธ์ระหว่างบุคคลกับข้อมูลอิเล็กทรอนิกส์ โดยมีวัตถุประสงค์เพื่อระบุตัวบุคคลผู้เป็นเจ้าของ
(๑๕) “หนังสือเดินทาง”หมายความว่า เอกสารสำคัญประจำตัวไม่ว่าจะมีรูปลักษณะใดที่รัฐบาลไทย รัฐบาลต่างประเทศ หรือองค์การระหว่างประเทศออกให้แก่บุคคลใด เพื่อใช้แสดงตนในการเดินทางระหว่างประเทศ และให้หมายความรวมถึงเอกสารใช้แทนหนังสือเดินทางและแบบหนังสือเดินทางที่ยังไม่ได้กรอกข้อความเกี่ยวกับผู้ถือหนังสือเดินทางด้วย
(๑๖) “เจ้าพนักงาน” หมายความว่า บุคคลซึ่งกฎหมายบัญญัติว่าเป็นเจ้าพนักงานหรือได้รับแต่งตั้งตามกฎหมายให้ปฏิบัติหน้าที่ราชการ ไม่ว่าเป็นประจำหรือครั้งคราว และไม่ว่าจะได้รับค่าตอบแทนหรือไม่
(๑๗) “สื่อลามกอนาจารเด็ก” หมายความว่า วัตถุหรือสิ่งที่แสดงให้รู้หรือเห็นถึงการกระทำทางเพศของเด็กหรือกับเด็กซึ่งมีอายุไม่เกินสิบแปดปี โดยรูป เรื่อง หรือลักษณะสามารถสื่อไปในทางลามกอนาจาร ไม่ว่าจะอยู่ในรูปแบบของเอกสาร ภาพเขียน ภาพพิมพ์ ภาพระบายสี สิ่งพิมพ์ รูปภาพ ภาพโฆษณา เครื่องหมาย รูปถ่าย ภาพยนตร์ แถบบันทึกเสียง แถบบันทึกภาพ หรือรูปแบบอื่นใดในลักษณะทำนองเดียวกัน และให้หมายความรวมถึงวัตถุหรือสิ่งต่าง ๆ ข้างต้นที่จัดเก็บในระบบคอมพิวเตอร์หรือในอุปกรณ์อิเล็กทรอนิกส์อื่นที่สามารถแสดงผลให้เข้าใจความหมายได้
(๑๘) “กระทำชำเรา” หมายความว่า กระทำเพื่อสนองความใคร่ของผู้กระทำ โดยการใช้อวัยวะเพศของผู้กระทำล่วงล้ำอวัยวะเพศ ทวารหนัก หรือช่องปากของผู้อื่น 
หมวด ๒
การใช้กฎหมายอาญา
มาตรา ๒ บุคคลจักต้องรับโทษในทางอาญาต่อเมื่อได้กระทำการอันกฎหมายที่ใช้ในขณะกระทำนั้นบัญญัติเป็นความผิดและกำหนดโทษไว้ และโทษที่จะลงแก่ผู้กระทำความผิดนั้น ต้องเป็นโทษที่บัญญัติไว้ในกฎหมาย
ถ้าตามบทบัญญัติของกฎหมายที่บัญญัติในภายหลัง การกระทำเช่นนั้นไม่เป็นความผิดต่อไป ให้ผู้ที่ได้กระทำการนั้นพ้นจากการเป็นผู้กระทำความผิด และถ้าได้มีคำพิพากษาถึงที่สุดให้ลงโทษแล้ว ก็ให้ถือว่าผู้นั้นไม่เคยต้องคำพิพากษาว่าได้กระทำความผิดนั้น ถ้ารับโทษอยู่ก็ให้การลงโทษนั้นสิ้นสุดลง
มาตรา ๓ ถ้ากฎหมายที่ใช้ในขณะกระทำความผิดแตกต่างกับกฎหมายที่ใช้ในภายหลังการกระทำความผิด ให้ใช้กฎหมายในส่วนที่เป็นคุณแก่ผู้กระทำความผิดไม่ว่าในทางใดเว้นแต่คดีถึงที่สุดแล้ว แต่ในกรณีที่คดีถึงที่สุดแล้วดังต่อไปนี้
(๑) ถ้าผู้กระทำความผิดยังไม่ได้รับโทษ หรือกำลังรับโทษอยู่ และโทษที่กำหนดตามคำพิพากษาหนักกว่าโทษที่กำหนดตามกฎหมายที่บัญญัติในภายหลัง เมื่อสำนวนความปรากฏแก่ศาลหรือเมื่อผู้กระทำความผิด ผู้แทนโดยชอบธรรมของผู้นั้น ผู้อนุบาลของผู้นั้นหรือพนักงานอัยการร้องขอ ให้ศาลกำหนดโทษเสียใหม่ตามกฎหมายที่บัญญัติในภายหลัง ในการที่ศาลจะกำหนดโทษใหม่นี้ ถ้าปรากฏว่า ผู้กระทำความผิดได้รับโทษมาบ้างแล้ว เมื่อได้คำนึงถึงโทษตามกฎหมายที่บัญญัติในภายหลัง หากเห็นเป็นการสมควร ศาลจะกำหนดโทษน้อยกว่าโทษขั้นต่ำที่กฎหมายที่บัญญัติในภายหลังกำหนดไว้ถ้าหากมีก็ได้ หรือถ้าเห็นว่าโทษที่ผู้กระทำความผิดได้รับมาแล้วเป็นการเพียงพอ ศาลจะปล่อยผู้กระทำความผิดไปก็ได้
(๒) ถ้าศาลพิพากษาให้ประหารชีวิตผู้กระทำความผิดและตามกฎหมายที่บัญญัติในภายหลัง โทษที่จะลงแก่ผู้กระทำความผิดไม่ถึงประหารชีวิต ให้งดการประหารชีวิตผู้กระทำความผิด และให้ถือว่าโทษประหารชีวิตตามคำพิพากษาได้เปลี่ยนเป็นโทษสูงสุดที่จะพึงลงได้ตามกฎหมายที่บัญญัติในภายหลัง
มาตรา ๔ ผู้ใดกระทำความผิดในราชอาณาจักร ต้องรับโทษตามกฎหมาย
การกระทำความผิดในเรือไทยหรืออากาศยานไทย ไม่ว่าจะอยู่ ณ ที่ใด ให้ถือว่ากระทำความผิดในราชอาณาจักร
มาตรา ๕ ความผิดใดที่การกระทำแม้แต่ส่วนหนึ่งส่วนใดได้กระทำในราชอาณาจักรก็ดี ผลแห่งการกระทำเกิดในราชอาณาจักรโดยผู้กระทำประสงค์ให้ผลนั้นเกิดในราชอาณาจักร หรือโดยลักษณะแห่งการกระทำ ผลที่เกิดขึ้นนั้นควรเกิดในราชอาณาจักรหรือย่อมจะเล็งเห็นได้ว่าผลนั้นจะเกิดในราชอาณาจักรก็ดี ให้ถือว่าความผิดนั้นได้กระทำในราชอาณาจักร
ในกรณีการตระเตรียมการ หรือพยายามกระทำการใดซึ่งกฎหมายบัญญัติเป็นความผิด แม้การกระทำนั้นจะได้กระทำนอกราชอาณาจักร ถ้าหากการกระทำนั้นจะได้กระทำตลอดไปจนถึงขั้นความผิดสำเร็จ ผลจะเกิดขึ้นในราชอาณาจักร ให้ถือว่า การตระเตรียมการหรือพยายามกระทำความผิดนั้นได้กระทำในราชอาณาจักร
มาตรา ๖ ความผิดใดที่ได้กระทำในราชอาณาจักรหรือที่ประมวลกฎหมายนี้ถือว่าได้กระทำในราชอาณาจักร แม้การกระทำของผู้เป็นตัวการด้วยกัน ของผู้สนับสนุน หรือของผู้ใช้ให้กระทำความผิดนั้นจะได้กระทำนอกราชอาณาจักร ก็ให้ถือว่าตัวการ ผู้สนับสนุนหรือผู้ใช้ให้กระทำได้กระทำในราชอาณาจักร
มาตรา ๗ ผู้ใดกระทำความผิดดังระบุไว้ต่อไปนี้นอกราชอาณาจักร จะต้องรับโทษในราชอาณาจักร คือ
(๑) ความผิดเกี่ยวกับความมั่นคงแห่งราชอาณาจักรตามที่บัญญัติไว้ในมาตรา ๑๐๗ ถึงมาตรา ๑๒๙
(๑/๑) ความผิดเกี่ยวกับการก่อการร้ายตามที่บัญญัติไว้ในมาตรา ๑๓๕/๑ มาตรา ๑๓๕/๒ มาตรา ๑๓๕/๓ และมาตรา ๑๓๕/๔
(๒) ความผิดเกี่ยวกับการปลอมและการแปลง ตามที่บัญญัติไว้ในมาตรา ๒๔๐ ถึงมาตรา ๒๔๙ มาตรา ๒๕๔ มาตรา ๒๕๖ มาตรา ๒๕๗ และมาตรา ๒๖๖ (๓) และ (๔)
(๒ ทวิ) ความผิดเกี่ยวกับเพศตามที่บัญญัติไว้ในมาตรา ๒๘๒ และมาตรา ๒๘๓
(๓) ความผิดฐานชิงทรัพย์ ตามที่บัญญัติไว้ในมาตรา ๓๓๙ และความผิดฐานปล้นทรัพย์ ตามที่บัญญัติไว้ในมาตรา ๓๔๐ ซึ่งได้กระทำในทะเลหลวง
มาตรา ๘ ผู้ใดกระทำความผิดนอกราชอาณาจักร และ
(ก) ผู้กระทำความผิดนั้นเป็นคนไทย และรัฐบาลแห่งประเทศที่ความผิดได้เกิดขึ้น หรือผู้เสียหายได้ร้องขอให้ลงโทษ หรือ
(ข) ผู้กระทำความผิดนั้นเป็นคนต่างด้าว และรัฐบาลไทยหรือคนไทยเป็นผู้เสียหาย และผู้เสียหายได้ร้องขอให้ลงโทษ
ถ้าความผิดนั้นเป็นความผิดดังระบุไว้ต่อไปนี้ จะต้องรับโทษภายในราชอาณาจักร คือ
(๑) ความผิดเกี่ยวกับการก่อให้เกิดภยันตรายต่อประชาชน ตามที่บัญญัติไว้ในมาตรา ๒๑๗ มาตรา ๒๑๘ มาตรา ๒๒๑ ถึงมาตรา ๒๒๓ ทั้งนี้เว้นแต่กรณีเกี่ยวกับมาตรา ๒๒๐ วรรคแรก และมาตรา ๒๒๔ มาตรา ๒๒๖ มาตรา ๒๒๘ ถึงมาตรา ๒๓๒ มาตรา ๒๓๗ และมาตรา ๒๓๓ ถึงมาตรา ๒๓๖ ทั้งนี้เฉพาะเมื่อเป็นกรณีต้องระวางโทษตามมาตรา ๒๓๘
(๒) ความผิดเกี่ยวกับเอกสาร ตามที่บัญญัติไว้ในมาตรา ๒๖๔ มาตรา ๒๖๕ มาตรา ๒๖๖ (๑) และ (๒) มาตรา ๒๖๘ ทั้งนี้เว้นแต่กรณีเกี่ยวกับมาตรา ๒๖๗ และมาตรา ๒๖๙
(๒/๑) ความผิดเกี่ยวกับบัตรอิเล็กทรอนิกส์ตามที่บัญญัติไว้ในมาตรา ๒๖๙/๑ ถึงมาตรา ๒๖๙/๗
(๒/๒) ความผิดเกี่ยวกับหนังสือเดินทางตามที่บัญญัติไว้ในมาตรา ๒๖๙/๘ ถึงมาตรา ๒๖๙/๑๕
(๓) ความผิดเกี่ยวกับเพศ ตามที่บัญญัติไว้ในมาตรา ๒๗๖ มาตรา ๒๘๐ และมาตรา ๒๘๕ ทั้งนี้เฉพาะที่เกี่ยวกับมาตรา ๒๗๖
(๔) ความผิดต่อชีวิต ตามที่บัญญัติไว้ในมาตรา ๒๘๘ ถึงมาตรา ๒๙๐
(๕) ความผิดต่อร่างกาย ตามที่บัญญัติไว้ในมาตรา ๒๙๕ ถึงมาตรา ๒๙๘
(๖) ความผิดฐานทอดทิ้งเด็ก คนป่วยเจ็บหรือคนชรา ตามที่บัญญัติไว้ในมาตรา ๓๐๖ ถึงมาตรา ๓๐๘
(๗) ความผิดต่อเสรีภาพ ตามที่บัญญัติไว้ในมาตรา ๓๐๙ มาตรา ๓๑๐ มาตรา ๓๑๒ ถึงมาตรา ๓๑๕ และมาตรา ๓๑๗ ถึงมาตรา ๓๒๐
  (๘) ความผิดฐานลักทรัพย์และวิ่งราวทรัพย์ ตามที่บัญญัติไว้ในมาตรา ๓๓๔ ถึงมาตรา ๓๓๖
(๙) ความผิดฐานกรรโชก รีดเอาทรัพย์ ชิงทรัพย์ และปล้นทรัพย์ ตามที่บัญญัติไว้ในมาตรา ๓๓๗ ถึงมาตรา ๓๔๐
(๑๐) ความผิดฐานฉ้อโกง ตามที่บัญญัติไว้ในมาตรา ๓๔๑ ถึงมาตรา ๓๔๔ มาตรา ๓๔๖ และมาตรา ๓๔๗
(๑๑) ความผิดฐานยักยอก ตามที่บัญญัติไว้ในมาตรา ๓๕๒ ถึงมาตรา ๓๕๔
(๑๒) ความผิดฐานรับของโจร ตามที่บัญญัติไว้ในมาตรา ๓๕๗
(๑๓) ความผิดฐานทำให้เสียทรัพย์ ตามที่บัญญัติไว้ในมาตรา ๓๕๘ ถึงมาตรา ๓๖๐
มาตรา ๙ เจ้าพนักงานของรัฐบาลไทยกระทำความผิดตามที่บัญญัติไว้ในมาตรา ๑๔๗ ถึงมาตรา ๑๖๖ และมาตรา ๒๐๐ ถึงมาตรา ๒๐๕ นอกราชอาณาจักร จะต้องรับโทษในราชอาณาจักร
มาตรา ๑๐ ผู้ใดกระทำการนอกราชอาณาจักรซึ่งเป็นความผิดตามมาตราต่าง ๆ ที่ระบุไว้ในมาตรา ๗ (๒) และ (๓) มาตรา ๘ และมาตรา ๙ ห้ามมิให้ลงโทษผู้นั้นในราชอาณาจักรเพราะการกระทำนั้นอีก ถ้า
(๑) ได้มีคำพิพากษาของศาลในต่างประเทศอันถึงที่สุดให้ปล่อยตัวผู้นั้น หรือ
(๒) ศาลในต่างประเทศพิพากษาให้ลงโทษและผู้นั้นได้พ้นโทษแล้ว
ถ้าผู้ต้องคำพิพากษาได้รับโทษสำหรับการกระทำนั้นตามคำพิพากษาของศาลในต่างประเทศมาแล้ว แต่ยังไม่พ้นโทษศาลจะลงโทษน้อยกว่าที่กฎหมายกำหนดไว้สำหรับความผิดนั้นเพียงใดก็ได้ หรือจะไม่ลงโทษเลยก็ได้ ทั้งนี้ โดยคำนึงถึงโทษที่ผู้นั้นได้รับมาแล้ว
มาตรา ๑๑ ผู้ใดกระทำความผิดในราชอาณาจักร หรือกระทำความผิดที่ประมวลกฎหมายนี้ถือว่าได้กระทำในราชอาณาจักร ถ้าผู้นั้นได้รับโทษสำหรับการกระทำนั้นตามคำพิพากษาของศาลในต่างประเทศมาแล้วทั้งหมด หรือแต่บางส่วน ศาลจะลงโทษน้อยกว่าที่กฎหมายกำหนดไว้สำหรับความผิดนั้นเพียงใดก็ได้ หรือจะไม่ลงโทษเลยก็ได้ ทั้งนี้ โดยคำนึงถึงโทษที่ผู้นั้นได้รับมาแล้ว
ในกรณีที่ผู้กระทำความผิดในราชอาณาจักร หรือกระทำความผิดที่ประมวลกฎหมายนี้ถือว่าได้กระทำในราชอาณาจักรได้ถูกฟ้องต่อศาลในต่างประเทศโดยรัฐบาลไทยร้องขอ ห้ามมิให้ลงโทษผู้นั้นในราชอาณาจักรเพราะการกระทำนั้นอีก ถ้า
(๑) ได้มีคำพิพากษาของศาลในต่างประเทศอันถึงที่สุดให้ปล่อยตัวผู้นั้น หรือ
(๒) ศาลในต่างประเทศพิพากษาให้ลงโทษ และผู้นั้นได้พ้นโทษแล้ว
มาตรา ๑๒ วิธีการเพื่อความปลอดภัยจะใช้บังคับแก่บุคคลใดได้ก็ต่อเมื่อมีบทบัญญัติแห่งกฎหมายให้ใช้บังคับได้เท่านั้น และกฎหมายที่จะใช้บังคับนั้นให้ใช้กฎหมายในขณะที่ศาลพิพากษา
มาตรา ๑๓ ถ้าตามบทบัญญัติของกฎหมายที่บัญญัติในภายหลังได้มีการยกเลิกวิธีการเพื่อความปลอดภัยใด และถ้าผู้ใดถูกใช้บังคับวิธีการเพื่อความปลอดภัยนั้นอยู่ ก็ให้ศาลสั่งระงับการใช้บังคับวิธีการเพื่อความปลอดภัยนั้นเสีย เมื่อสำนวนความปรากฏแก่ศาล หรือเมื่อผู้นั้น ผู้แทนโดยชอบธรรมของผู้นั้น ผู้อนุบาลของผู้นั้นหรือพนักงานอัยการร้องขอ
มาตรา ๑๔ ในกรณีที่มีผู้ถูกใช้บังคับวิธีการเพื่อความปลอดภัยใดอยู่ และได้มีบทบัญญัติของกฎหมายที่บัญญัติในภายหลังเปลี่ยนแปลงเงื่อนไขที่จะสั่งให้มีการใช้บังคับวิธีการเพื่อความปลอดภัยนั้นไป ซึ่งเป็นผลอันไม่อาจนำมาใช้บังคับแก่กรณีของผู้นั้นได้ หรือนำมาใช้บังคับได้แต่การใช้บังคับวิธีการเพื่อความปลอดภัยตามบทบัญญัติของกฎหมายที่บัญญัติในภายหลังเป็นคุณแก่ผู้นั้นยิ่งกว่า เมื่อสำนวนความปรากฏแก่ศาล หรือเมื่อผู้นั้น ผู้แทนโดยชอบธรรมของผู้นั้น ผู้อนุบาลของผู้นั้นหรือพนักงานอัยการร้องขอต่อศาลให้ยกเลิกการใช้บังคับวิธีการเพื่อความปลอดภัย หรือร้องขอรับผลตามบทบัญญัติแห่งกฎหมายนั้น แล้วแต่กรณี ให้ศาลมีอำนาจสั่งตามที่เห็นสมควร
มาตรา ๑๕ ถ้าตามบทบัญญัติของกฎหมายที่บัญญัติในภายหลัง โทษใดได้เปลี่ยนลักษณะมาเป็นวิธีการเพื่อความปลอดภัย และได้มีคำพิพากษาลงโทษนั้นแก่บุคคลใดไว้ ก็ให้ถือว่าโทษที่ลงนั้นเป็นวิธีการเพื่อความปลอดภัยด้วย
ในกรณีดังกล่าวในวรรคแรก ถ้ายังไม่ได้ลงโทษผู้นั้นหรือผู้นั้นยังรับโทษอยู่ ก็ให้ใช้บังคับวิธีการเพื่อความปลอดภัยแก่ผู้นั้นต่อไป และถ้าหากว่าตามบทบัญญัติของกฎหมายที่บัญญัติในภายหลังมีเงื่อนไขที่จะสั่งให้มีการใช้บังคับวิธีการเพื่อความปลอดภัย อันไม่อาจนำมาใช้บังคับแก่กรณีของผู้นั้นหรือนำมาใช้บังคับได้ แต่การใช้บังคับวิธีการเพื่อความปลอดภัยตามบทบัญญัติของกฎหมายที่บัญญัติในภายหลังเป็นคุณแก่ผู้นั้นยิ่งกว่า เมื่อสำนวนความปรากฏแก่ศาล หรือเมื่อผู้นั้น ผู้แทนโดยชอบธรรมของผู้นั้น ผู้อนุบาลของผู้นั้นหรือพนักงานอัยการร้องขอต่อศาลให้ยกเลิกการใช้บังคับวิธีการเพื่อความปลอดภัย หรือร้องขอรับผลตามบทบัญญัติแห่งกฎหมายนั้น แล้วแต่กรณี ให้ศาลมีอำนาจสั่งตามที่เห็นสมควร
มาตรา ๑๖ เมื่อศาลได้พิพากษาให้ใช้บังคับวิธีการเพื่อความปลอดภัยแก่ผู้ใดแล้ว ถ้าภายหลังความปรากฏแก่ศาลตามคำเสนอของผู้นั้นเอง ผู้แทนโดยชอบธรรมของผู้นั้น ผู้อนุบาลของผู้นั้นหรือพนักงานอัยการว่า พฤติการณ์เกี่ยวกับการใช้บังคับนั้นได้เปลี่ยนแปลงไปจากเดิม ศาลจะสั่งเพิกถอนหรืองดการใช้บังคับวิธีการเพื่อความปลอดภัยแก่ผู้นั้นไว้ชั่วคราวตามที่เห็นสมควรก็ได้
มาตรา ๑๗ บทบัญญัติในภาค ๑ แห่งประมวลกฎหมายนี้ ให้ใช้ในกรณีแห่งความผิดตามกฎหมายอื่นด้วย เว้นแต่กฎหมายนั้น ๆ จะได้บัญญัติไว้เป็นอย่างอื่น
หมวด ๓
โทษและวิธีการเพื่อความปลอดภัย
ส่วนที่ ๑
โทษ
มาตรา ๑๘ โทษสำหรับลงแก่ผู้กระทำความผิดมีดังนี้
(๑) ประหารชีวิต
(๒) จำคุก
(๓) กักขัง
(๔) ปรับ
(๕) ริบทรัพย์สิน
โทษประหารชีวิตและโทษจำคุกตลอดชีวิตมิให้นำมาใช้บังคับแก่ผู้ซึ่งกระทำความผิดในขณะที่มีอายุต่ำกว่าสิบแปดปี
ในกรณีผู้ซึ่งกระทำความผิดในขณะที่มีอายุต่ำกว่าสิบแปดปีได้กระทำความผิดที่มีระวางโทษประหารชีวิตหรือจำคุกตลอดชีวิต ให้ถือว่าระวางโทษดังกล่าวได้เปลี่ยนเป็นระวางโทษจำคุกห้าสิบปี 
มาตรา ๑๙  ผู้ใดต้องโทษประหารชีวิต ให้ดำเนินการด้วยวิธีฉีดยาหรือสารพิษให้ตาย
หลักเกณฑ์และวิธีการประหารชีวิต ให้เป็นไปตามระเบียบที่กระทรวงยุติธรรมกำหนด โดยประกาศในราชกิจจานุเบกษา
มาตรา ๒๐ บรรดาความผิดที่กฎหมายกำหนดให้ลงโทษทั้งจำคุกและปรับด้วยนั้น ถ้าศาลเห็นสมควรจะลงแต่โทษจำคุกก็ได้
มาตรา ๒๑ ในการคำนวณระยะเวลาจำคุก ให้นับวันเริ่มจำคุกรวมคำนวณเข้าด้วย และให้นับเป็นหนึ่งวันเต็มโดยไม่ต้องคำนึงถึงจำนวนชั่วโมง
ถ้าระยะเวลาที่คำนวณนั้นกำหนดเป็นเดือน ให้นับสามสิบวันเป็นหนึ่งเดือน ถ้ากำหนดเป็นปี ให้คำนวณตามปีปฏิทินในราชการ
เมื่อผู้ต้องคำพิพากษาถูกจำคุกครบกำหนดแล้ว ให้ปล่อยตัวในวันถัดจากวันที่ครบกำหนด
มาตรา ๒๒ โทษจำคุก ให้เริ่มแต่วันมีคำพิพากษา แต่ถ้าผู้ต้องคำพิพากษาถูกคุมขังก่อนศาลพิพากษา ให้หักจำนวนวันที่ถูกคุมขังออกจากระยะเวลาจำคุกตามคำพิพากษา เว้นแต่คำพิพากษานั้นจะกล่าวไว้เป็นอย่างอื่น
ในกรณีที่คำพิพากษากล่าวไว้เป็นอย่างอื่น โทษจำคุกตามคำพิพากษาเมื่อรวมจำนวนวันที่ถูกคุมขังก่อนศาลพิพากษาในคดีเรื่องนั้นเข้าด้วยแล้ว ต้องไม่เกินอัตราโทษขั้นสูงของกฎหมายที่กำหนดไว้สำหรับความผิดที่ได้กระทำลงนั้น ทั้งนี้ ไม่เป็นการกระทบกระเทือนบทบัญญัติในมาตรา ๙๑
มาตรา ๒๓ ผู้ใดกระทำความผิดซึ่งมีโทษจำคุก และในคดีนั้นศาลจะลงโทษจำคุกไม่เกินสามเดือน ถ้าไม่ปรากฏว่าผู้นั้นได้รับโทษจำคุกมาก่อน หรือปรากฏว่าได้รับโทษจำคุกมาก่อน แต่เป็นโทษสำหรับความผิดที่ได้กระทำโดยประมาทหรือความผิดลหุโทษ ศาลจะพิพากษาให้ลงโทษกักขังไม่เกินสามเดือนแทนโทษจำคุกนั้นก็ได้
มาตรา ๒๔ ผู้ใดต้องโทษกักขัง ให้กักตัวไว้ในสถานที่กักขังซึ่งกำหนดไว้อันมิใช่เรือนจำ สถานีตำรวจ หรือสถานที่ควบคุมผู้ต้องหาของพนักงานสอบสวน
ถ้าศาลเห็นเป็นการสมควร จะสั่งในคำพิพากษาให้กักขังผู้กระทำความผิดไว้ในที่อาศัยของผู้นั้นเอง หรือของผู้อื่นที่ยินยอมรับผู้นั้นไว้ หรือสถานที่อื่นที่อาจกักขังได้ เพื่อให้เหมาะสมกับประเภทหรือสภาพของผู้ถูกกักขังก็ได้
ถ้าความปรากฏแก่ศาลว่า การกักขังผู้ต้องโทษกักขังไว้ในสถานที่กักขังตามวรรคหนึ่งหรือวรรคสอง อาจก่อให้เกิดอันตรายต่อผู้นั้น หรือทำให้ผู้ซึ่งต้องพึ่งพาผู้ต้องโทษกักขังในการดำรงชีพได้รับความเดือดร้อนเกินสมควร หรือมีพฤติการณ์พิเศษประการอื่นที่แสดงให้เห็นว่าไม่สมควรกักขังผู้ต้องโทษกักขังในสถานที่ดังกล่าว ศาลจะมีคำสั่งให้กักขังผู้ต้องโทษกักขังในสถานที่อื่นซึ่งมิใช่ที่อยู่อาศัยของผู้นั้นเองโดยได้รับความยินยอมจากเจ้าของหรือผู้ครอบครองสถานที่ก็ได้ กรณีเช่นว่านี้ ให้ศาลมีอำนาจกำหนดเงื่อนไขอย่างหนึ่งอย่างใดให้ผู้ต้องโทษกักขังปฏิบัติ และหากเจ้าของหรือผู้ครอบครองสถานที่ดังกล่าวยินยอม ศาลอาจมีคำสั่งแต่งตั้งผู้นั้นเป็นผู้ควบคุมดูแลและให้ถือว่าผู้ที่ได้รับแต่งตั้งเป็นเจ้าพนักงานตามประมวลกฎหมายนี้
มาตรา ๒๕ ผู้ต้องโทษกักขังในสถานที่ซึ่งกำหนด จะได้รับการเลี้ยงดูจากสถานที่นั้น แต่ภายใต้ข้อบังคับของสถานที่ผู้ต้องโทษกักขังมีสิทธิที่จะรับอาหารจากภายนอกโดยค่าใช้จ่ายของตนเอง ใช้เสื้อผ้าของตนเอง ได้รับการเยี่ยมอย่างน้อยวันละหนึ่งชั่วโมง และรับและส่งจดหมายได้
ผู้ต้องโทษกักขังจะต้องทำงานตามระเบียบ ข้อบังคับและวินัย ถ้าผู้ต้องโทษกักขังประสงค์จะทำงานอย่างอื่นก็ให้อนุญาตให้เลือกทำได้ตามประเภทงานที่ตนสมัคร แต่ต้องไม่ขัดต่อระเบียบ ข้อบังคับ วินัย หรือความปลอดภัยของสถานที่นั้น
มาตรา ๒๖ ถ้าผู้ต้องโทษกักขังถูกกักขังในที่อาศัยของผู้นั้นเอง หรือของผู้อื่นที่ยินยอมรับผู้นั้นไว้ ผู้ต้องโทษกักขังนั้นมีสิทธิที่จะดำเนินการในวิชาชีพหรืออาชีพของตนในสถานที่ดังกล่าวได้ ในการนี้ ศาลจะกำหนดเงื่อนไขให้ผู้ต้องโทษกักขังปฏิบัติอย่างหนึ่งอย่างใดหรือไม่ก็ได้ แล้วแต่ศาลจะเห็นสมควร
มาตรา ๒๗ ถ้าในระหว่างที่ผู้ต้องโทษกักขังตามมาตรา ๒๓ ได้รับโทษกักขังอยู่ความปรากฏแก่ศาลเอง หรือปรากฏแก่ศาลตามคำแถลงของพนักงานอัยการหรือผู้ควบคุมดูแลสถานที่กักขังว่า
(๑) ผู้ต้องโทษกักขังฝ่าฝืนระเบียบ ข้อบังคับ หรือวินัยของสถานที่กักขัง
(๒) ผู้ต้องโทษกักขังไม่ปฏิบัติตามเงื่อนไขที่ศาลกำหนด หรือ
(๓) ผู้ต้องโทษกักขังต้องคำพิพากษาให้ลงโทษจำคุก
ศาลอาจเปลี่ยนโทษกักขังเป็นโทษจำคุกมีกำหนดเวลาตามที่ศาลเห็นสมควร แต่ต้องไม่เกินกำหนดเวลาของโทษกักขังที่ผู้ต้องโทษกักขังจะต้องได้รับต่อไป
มาตรา ๒๘ ผู้ใดต้องโทษปรับ ผู้นั้นจะต้องชำระเงินตามจำนวนที่กำหนดไว้ในคำพิพากษาต่อศาล
มาตรา ๒๙ ผู้ใดต้องโทษปรับและไม่ชำระค่าปรับภายในสามสิบวันนับแต่วันที่ศาลพิพากษา ผู้นั้นจะต้องถูกยึดทรัพย์สินหรืออายัดสิทธิเรียกร้องในทรัพย์สินเพื่อใช้ค่าปรับหรือมิฉะนั้นจะต้องถูกกักขังแทนค่าปรับ แต่ถ้าศาลเห็นเหตุอันควรสงสัยว่าผู้นั้นจะหลีกเลี่ยงไม่ชำระค่าปรับ ศาลจะสั่งเรียกประกันหรือจะสั่งให้กักขังผู้นั้นแทนค่าปรับไปพลางก่อนก็ได้
ความในวรรคสองของมาตรา ๒๔ มิให้นำมาใช้บังคับแก่การกักขังแทนค่าปรับ
มาตรา ๒๙/๑ ในกรณีที่ผู้ต้องโทษปรับไม่ชำระค่าปรับภายในกำหนดเวลาตามมาตรา ๒๙ วรรคหนึ่ง ให้ศาลมีอำนาจออกหมายบังคับคดีเพื่อยึดทรัพย์สินหรืออายัดสิทธิเรียกร้องในทรัพย์สินของผู้นั้นเพื่อใช้ค่าปรับ
การบังคับคดีตามวรรคหนึ่ง ให้นำประมวลกฎหมายวิธีพิจารณาความแพ่งมาใช้บังคับโดยอนุโลม โดยให้เจ้าพนักงานศาลที่ได้รับแต่งตั้งและพนักงานอัยการเป็นผู้มีอำนาจหน้าที่ในการดำเนินการบังคับคดีและให้เจ้าพนักงานบังคับคดีมีอำนาจหน้าที่ยึดทรัพย์สินหรืออายัดสิทธิเรียกร้องในทรัพย์สินของผู้ต้องโทษปรับและขายทอดตลาดตามที่ได้รับแจ้งจากศาลหรือพนักงานอัยการ  ทั้งนี้ มิให้หน่วยงานของรัฐเรียกค่าฤชาธรรมเนียมหรือค่าใช้จ่ายจากผู้ดำเนินการบังคับคดี
       การตรวจสอบหาทรัพย์สินของผู้ต้องโทษปรับโดยพนักงานอัยการเพื่อการบังคับคดีตามวรรคสอง ให้ปฏิบัติตามหลักเกณฑ์ วิธีการ และเงื่อนไขที่กำหนดในข้อบังคับของอัยการสูงสุด
บทบัญญัติมาตรานี้ไม่กระทบต่อการที่ศาลจะมีคำสั่งตามมาตรา ๒๙ วรรคหนึ่ง
มาตรา ๓๐ ในการกักขังแทนค่าปรับ ให้ถืออัตราห้าร้อยบาทต่อหนึ่งวัน และไม่ว่าในกรณีความผิดกระทงเดียวหรือหลายกระทง ห้ามกักขังเกินกำหนดหนึ่งปี เว้นแต่ในกรณีที่ศาลพิพากษาให้ปรับตั้งแต่สองแสนบาทขึ้นไป ศาลจะสั่งให้กักขังแทนค่าปรับเป็นระยะเวลาเกินกว่าหนึ่งปีแต่ไม่เกินสองปีก็ได้
ในการคำนวณระยะเวลานั้น ให้นับวันเริ่มกักขังแทนค่าปรับรวมเข้าด้วยและให้นับเป็นหนึ่งวันเต็มโดยไม่ต้องคำนึงถึงจำนวนชั่วโมง
ในกรณีที่ผู้ต้องโทษปรับถูกคุมขังก่อนศาลพิพากษา ให้หักจำนวนวันที่ถูกคุมขังนั้นออกจากจำนวนเงินค่าปรับ โดยถืออัตราห้าร้อยบาทต่อหนึ่งวัน เว้นแต่ผู้นั้นต้องคำพิพากษาให้ลงโทษทั้งจำคุกและปรับ ในกรณีเช่นว่านี้ ถ้าจะต้องหักจำนวนวันที่ถูกคุมขังออกจากเวลาจำคุกตามมาตรา ๒๒ ก็ให้หักออกเสียก่อนเหลือเท่าใดจึงให้หักออกจากเงินค่าปรับ
เมื่อผู้ต้องโทษปรับถูกกักขังแทนค่าปรับครบกำหนดแล้ว ให้ปล่อยตัวในวันถัดจากวันที่ครบกำหนด ถ้านำเงินค่าปรับมาชำระครบแล้ว ให้ปล่อยตัวไปทันที
มาตรา ๓๐/๑ ในกรณีที่ศาลพิพากษาปรับ ผู้ต้องโทษปรับซึ่งมิใช่นิติบุคคลและไม่มีเงินชำระค่าปรับอาจยื่นคำร้องต่อศาลชั้นต้นที่พิพากษาคดีเพื่อขอทำงานบริการสังคมหรือทำงานสาธารณประโยชน์แทนค่าปรับ หรือถ้าความปรากฏแก่ศาลในขณะที่พิพากษาคดีว่าผู้ต้องโทษปรับรายใดอยู่ในเกณฑ์ที่จะทำงานบริการสังคมหรือทำงานสาธารณประโยชน์ตามมาตรานี้ได้ และถ้าผู้ต้องโทษปรับยินยอม ศาลจะมีคำสั่งให้ผู้นั้นทำงานบริการสังคมหรือทำงานสาธารณประโยชน์แทนค่าปรับก็ได้
การพิจารณาคำร้องตามวรรคแรก เมื่อศาลได้พิจารณาถึงฐานะการเงิน ประวัติและสภาพความผิดของผู้ต้องโทษปรับแล้ว เห็นเป็นการสมควร ศาลจะมีคำสั่งให้ผู้นั้นทำงานบริการสังคมหรือทำงานสาธารณประโยชน์แทนค่าปรับก็ได้  ทั้งนี้ ภายใต้การดูแลของพนักงานคุมประพฤติ เจ้าหน้าที่ของรัฐ หน่วยงานของรัฐ หรือองค์การซึ่งมีวัตถุประสงค์เพื่อการบริการสังคม การกุศลสาธารณะหรือสาธารณประโยชน์ที่ยินยอมรับดูแล
กรณีที่ศาลมีคำสั่งให้ผู้ต้องโทษปรับทำงานบริการสังคมหรือทำงานสาธารณประโยชน์แทนค่าปรับให้ศาลกำหนดลักษณะหรือประเภทของงาน ผู้ดูแลการทำงาน วันเริ่มทำงาน ระยะเวลาทำงาน และจำนวนชั่วโมงที่ถือเป็นการทำงานหนึ่งวัน  ทั้งนี้ โดยคำนึงถึงเพศ อายุ ประวัติ การนับถือศาสนา ความประพฤติ สติปัญญา การศึกษาอบรม สุขภาพ ภาวะแห่งจิต นิสัย อาชีพ สิ่งแวดล้อมหรือสภาพความผิดของผู้ต้องโทษปรับประกอบด้วย และศาลจะกำหนดเงื่อนไขอย่างหนึ่งอย่างใดให้ผู้ต้องโทษปรับปฏิบัติเพื่อแก้ไขฟื้นฟูหรือป้องกันมิให้ผู้นั้นกระทำความผิดขึ้นอีกก็ได้
ถ้าภายหลังความปรากฏแก่ศาลว่าพฤติการณ์เกี่ยวกับการทำงานบริการสังคมหรือทำงานสาธารณประโยชน์ของผู้ต้องโทษปรับได้เปลี่ยนแปลงไป ศาลอาจแก้ไขเปลี่ยนแปลงคำสั่งที่กำหนดไว้นั้นก็ได้ตามที่เห็นสมควร
ในการกำหนดระยะเวลาทำงานแทนค่าปรับตามวรรคสาม ให้นำบทบัญญัติมาตรา ๓๐ มาใช้บังคับโดยอนุโลม และในกรณีที่ศาลมิได้กำหนดให้ผู้ต้องโทษปรับทำงานติดต่อกันไป การทำงานดังกล่าวต้องอยู่ภายในกำหนดระยะเวลาสองปีนับแต่วันเริ่มทำงานตามที่ศาลกำหนด
เพื่อประโยชน์ในการกำหนดจำนวนชั่วโมงทำงานตามวรรคสาม ให้ประธานศาลฎีกามีอำนาจออกระเบียบราชการฝ่ายตุลาการศาลยุติธรรมกำหนดจำนวนชั่วโมงที่ถือเป็นการทำงานหนึ่งวัน สำหรับงานบริการสังคมหรืองานสาธารณประโยชน์แต่ละประเภทได้ตามที่เห็นสมควร
มาตรา ๓๐/๒ ถ้าภายหลังศาลมีคำสั่งอนุญาตตามมาตรา ๓๐/๑ แล้ว ความปรากฏแก่ศาลเองหรือความปรากฏตามคำแถลงของโจทก์หรือเจ้าพนักงานว่าผู้ต้องโทษปรับมีเงินพอชำระค่าปรับได้ในเวลาที่ยื่นคำร้องตามมาตรา ๓๐/๑ หรือฝ่าฝืนหรือไม่ปฏิบัติตามคำสั่งหรือเงื่อนไขที่ศาลกำหนด ศาลจะเพิกถอนคำสั่งอนุญาตดังกล่าวและปรับ หรือกักขังแทนค่าปรับ โดยให้หักจำนวนวันที่ทำงานมาแล้วออกจากจำนวนเงินค่าปรับก็ได้
ในระหว่างการทำงานบริการสังคมหรือทำงานสาธารณประโยชน์แทนค่าปรับหากผู้ต้องโทษปรับไม่ประสงค์จะทำงานดังกล่าวต่อไป อาจขอเปลี่ยนเป็นรับโทษปรับ หรือกักขังแทนค่าปรับก็ได้ ในกรณีนี้ให้ศาลมีคำสั่งอนุญาตตามคำร้อง โดยให้หักจำนวนวันที่ทำงานมาแล้วออกจากจำนวนเงินค่าปรับ
มาตรา ๓๐/๓ คำสั่งศาลตามมาตรา ๓๐/๑ และมาตรา ๓๐/๒ ให้เป็นที่สุด
มาตรา ๓๑ ในกรณีที่ศาลจะพิพากษาให้ปรับผู้กระทำความผิดหลายคน ในความผิดอันเดียวกัน ในกรณีเดียวกันให้ศาลลงโทษปรับเรียงตามรายตัวบุคคล
มาตรา ๓๒ ทรัพย์สินใดที่กฎหมายบัญญัติไว้ว่า ผู้ใดทำหรือมีไว้เป็นความผิด ให้ริบเสียทั้งสิ้น ไม่ว่าเป็นของผู้กระทำความผิด และมีผู้ถูกลงโทษตามคำพิพากษาหรือไม่
มาตรา ๓๓ ในการริบทรัพย์สิน นอกจากศาลจะมีอำนาจริบตามกฎหมายที่บัญญัติไว้โดยเฉพาะแล้ว ให้ศาลมีอำนาจสั่งให้ริบทรัพย์สินดังต่อไปนี้อีกด้วย คือ
(๑) ทรัพย์สินซึ่งบุคคลได้ใช้ หรือมีไว้เพื่อใช้ในการกระทำความผิด หรือ
(๒) ทรัพย์สินซึ่งบุคคลได้มาโดยได้กระทำความผิด
เว้นแต่ทรัพย์สินเหล่านี้เป็นทรัพย์สินของผู้อื่นซึ่งมิได้รู้เห็นเป็นใจด้วยในการกระทำความผิด
มาตรา ๓๔ บรรดาทรัพย์สิน
(๑) ซึ่งได้ให้ตามความในมาตรา ๑๔๓ มาตรา ๑๔๔ มาตรา ๑๔๙ มาตรา ๑๕๐ มาตรา ๑๖๗ มาตรา ๒๐๑ หรือมาตรา ๒๐๒ หรือ
(๒) ซึ่งได้ให้เพื่อจูงใจบุคคลให้กระทำความผิด หรือเพื่อเป็นรางวัลในการที่บุคคลได้กระทำความผิด
ให้ริบเสียทั้งสิ้น เว้นแต่ทรัพย์สินนั้นเป็นของผู้อื่นซึ่งมิได้รู้เห็นเป็นใจด้วยในการกระทำความผิด
มาตรา ๓๕ ทรัพย์สินซึ่งศาลพิพากษาให้ริบให้ตกเป็นของแผ่นดิน แต่ศาลจะพิพากษาให้ทำให้ทรัพย์สินนั้นใช้ไม่ได้หรือทำลายทรัพย์สินนั้นเสียก็ได้
มาตรา ๓๖ ในกรณีที่ศาลสั่งให้ริบทรัพย์สินตามมาตรา ๓๓ หรือมาตรา ๓๔ ไปแล้ว หากปรากฏในภายหลังโดยคำเสนอของเจ้าของแท้จริงว่า ผู้เป็นเจ้าของแท้จริงมิได้รู้เห็นเป็นใจด้วยในการกระทำความผิด ก็ให้ศาลสั่งให้คืนทรัพย์สิน ถ้าทรัพย์สินนั้นยังคงมีอยู่ในความครอบครองของเจ้าพนักงาน แต่คำเสนอของเจ้าของแท้จริงนั้นจะต้องกระทำต่อศาลภายในหนึ่งปีนับแต่วันคำพิพากษาถึงที่สุด
มาตรา ๓๗ ถ้าผู้ที่ศาลสั่งให้ส่งทรัพย์สินที่ริบไม่ส่งภายในเวลาที่ศาลกำหนด ให้ศาลมีอำนาจสั่งดังต่อไปนี้
(๑) ให้ยึดทรัพย์สินนั้น
(๒) ให้ชำระราคาหรือสั่งยึดทรัพย์สินอื่นของผู้นั้นชดใช้ราคาจนเต็ม หรือ
(๓) ในกรณีที่ศาลเห็นว่า ผู้นั้นจะส่งทรัพย์สินที่สั่งให้ส่งได้ แต่ไม่ส่ง หรือชำระราคาทรัพย์สินนั้นได้ แต่ไม่ชำระ ให้ศาลมีอำนาจกักขังผู้นั้นไว้จนกว่าจะปฏิบัติตามคำสั่ง แต่ไม่เกินหนึ่งปี แต่ถ้าภายหลังปรากฏแก่ศาลเอง หรือโดยคำเสนอของผู้นั้นว่า ผู้นั้นไม่สามารถส่งทรัพย์สินหรือชำระราคาได้ ศาลจะสั่งให้ปล่อยตัวผู้นั้นไปก่อนครบกำหนดก็ได้
มาตรา ๓๘ โทษให้เป็นอันระงับไปด้วยความตายของผู้กระทำความผิด
ส่วนที่ ๒
วิธีการเพื่อความปลอดภัย
มาตรา ๓๙ วิธีการเพื่อความปลอดภัย มีดังนี้
(๑) กักกัน
(๒) ห้ามเข้าเขตกำหนด
(๓) เรียกประกันทัณฑ์บน
(๔) คุมตัวไว้ในสถานพยาบาล
(๕) ห้ามการประกอบอาชีพบางอย่าง
มาตรา ๔๐ กักกัน คือ การควบคุมผู้กระทำความผิดติดนิสัยไว้ภายในเขตกำหนด เพื่อป้องกันการกระทำความผิดเพื่อดัดนิสัย และเพื่อฝึกหัดอาชีพ
มาตรา ๔๑ ผู้ใดเคยถูกศาลพิพากษาให้กักกันมาแล้วหรือเคยถูกศาลพิพากษาให้ลงโทษจำคุกไม่ต่ำกว่าหกเดือนมาแล้วไม่น้อยกว่าสองครั้งในความผิดดังต่อไปนี้ คือ
(๑) ความผิดเกี่ยวกับความสงบสุขของประชาชน ตามที่บัญญัติไว้ในมาตรา ๒๐๙ ถึงมาตรา ๒๑๖
(๒) ความผิดเกี่ยวกับการก่อให้เกิดภยันตรายต่อประชาชน ตามที่บัญญัติไว้ในมาตรา ๒๑๗ ถึงมาตรา ๒๒๔
(๓) ความผิดเกี่ยวกับเงินตรา ตามที่บัญญัติไว้ในมาตรา ๒๔๐ ถึงมาตรา ๒๔๖
(๔) ความผิดเกี่ยวกับเพศ ตามที่บัญญัติไว้ในมาตรา ๒๗๖ ถึงมาตรา ๒๘๖
(๕) ความผิดต่อชีวิต ตามที่บัญญัติไว้ในมาตรา ๒๘๘ ถึงมาตรา ๒๙๐ มาตรา ๒๙๒ ถึงมาตรา ๒๙๔
(๖) ความผิดต่อร่างกาย ตามที่บัญญัติไว้ในมาตรา ๒๙๕ ถึงมาตรา ๒๙๙
(๗) ความผิดต่อเสรีภาพ ตามที่บัญญัติไว้ในมาตรา ๓๐๙ ถึงมาตรา ๓๒๐
(๘) ความผิดเกี่ยวกับทรัพย์ ตามที่บัญญัติไว้ในมาตรา ๓๓๔ ถึงมาตรา ๓๔๐ มาตรา ๓๕๔ และมาตรา ๓๕๗
และภายในเวลาสิบปี นับแต่วันที่ผู้นั้นได้พ้นจากการกักกัน หรือพ้นโทษแล้วแต่กรณี ผู้นั้นได้กระทำความผิดอย่างหนึ่งอย่างใดในบรรดาที่ระบุไว้นั้นอีกจนศาลพิพากษาลงโทษจำคุกไม่ต่ำกว่าหกเดือนสำหรับการกระทำความผิดนั้น ศาลอาจถือว่า ผู้นั้นเป็นผู้กระทำความผิดติดนิสัย และจะพิพากษาให้กักกันมีกำหนดเวลาไม่น้อยกว่าสามปีและไม่เกินสิบปีก็ได้
ความผิดซึ่งผู้กระทำได้กระทำในขณะที่มีอายุต่ำกว่าสิบแปดปีนั้น มิให้ถือเป็นความผิดที่จะนำมาพิจารณากักกันตามมาตรานี้
มาตรา ๔๒ ในการคำนวณระยะเวลากักกัน ให้นับวันที่ศาลพิพากษาเป็นวันเริ่มกักกัน แต่ถ้ายังมีโทษจำคุกหรือกักขัง ที่ผู้ต้องกักกันนั้นจะต้องรับอยู่ก็ให้จำคุกหรือกักขังเสียก่อนและให้นับวันถัดจากวันที่พ้นโทษจำคุก หรือพ้นจากกักขังเป็นวันเริ่มกักกัน
ระยะเวลากักกัน และการปล่อยตัวผู้ถูกกักกัน ให้นำบทบัญญัติมาตรา ๒๑ มาใช้บังคับโดยอนุโลม
มาตรา ๔๓ การฟ้องขอให้กักกันเป็นอำนาจของพนักงานอัยการโดยเฉพาะ และจะขอรวมกันไปในฟ้องคดีอันเป็นมูลให้เกิดอำนาจฟ้องขอให้กักกันหรือจะฟ้องภายหลังก็ได้
มาตรา ๔๔ ห้ามเข้าเขตกำหนด คือการห้ามมิให้เข้าไปในท้องที่ หรือสถานที่ที่กำหนดไว้ในคำพิพากษา
มาตรา ๔๕ เมื่อศาลพิพากษาให้ลงโทษผู้ใด และศาลเห็นสมควรเพื่อความปลอดภัยของประชาชน ไม่ว่าจะมีคำขอหรือไม่ ศาลอาจสั่งในคำพิพากษาว่าเมื่อผู้นั้นพ้นโทษตามคำพิพากษาแล้ว ห้ามมิให้ผู้นั้นเข้าในเขตกำหนดเป็นเวลาไม่เกินห้าปี
มาตรา ๔๖ ถ้าความปรากฏแก่ศาลตามข้อเสนอของพนักงานอัยการว่าผู้ใดจะก่อเหตุร้ายให้เกิดภยันตรายแก่บุคคลหรือทรัพย์สินของผู้อื่น หรือจะกระทำการใดให้เกิดความเสียหายแก่สิ่งแวดล้อมหรือทรัพยากรธรรมชาติตามกฎหมายเกี่ยวกับสิ่งแวดล้อมและทรัพยากรธรรมชาติ ในการพิจารณาคดีความผิดใด ไม่ว่าศาลจะลงโทษผู้ถูกฟ้องหรือไม่ก็ตาม เมื่อมีเหตุอันควรเชื่อว่าผู้ถูกฟ้องน่าจะก่อเหตุร้ายให้เกิดภยันตรายแก่บุคคลหรือทรัพย์สินของผู้อื่น หรือจะกระทำความผิดให้เกิดความเสียหายแก่สิ่งแวดล้อมหรือทรัพยากรธรรมชาติตามกฎหมายเกี่ยวกับสิ่งแวดล้อมและทรัพยากรธรรมชาติ ให้ศาลมีอำนาจที่จะสั่งผู้นั้นให้ทำทัณฑ์บนโดยกำหนดจำนวนเงินไม่เกินกว่าห้าหมื่นบาทว่าผู้นั้นจะไม่ก่อเหตุร้ายหรือจะไม่กระทำความผิดดังกล่าวแล้วตลอดเวลาที่ศาลกำหนดแต่ไม่เกินสองปี และจะสั่งให้มีประกันด้วยหรือไม่ก็ได้
ถ้าผู้นั้นไม่ยอมทำทัณฑ์บนหรือหาประกันไม่ได้ ให้ศาลมีอำนาจสั่งกักขังผู้นั้นจนกว่าจะทำทัณฑ์บนหรือหาประกันได้ แต่ไม่ให้กักขังเกินกว่าหกเดือน หรือจะสั่งห้ามผู้นั้นเข้าในเขตกำหนดตามมาตรา ๔๕ ก็ได้
การกระทำของผู้ซึ่งมีอายุต่ำกว่าสิบแปดปีมิให้อยู่ในบังคับแห่งบทบัญญัติตามมาตรานี้
มาตรา ๔๗ ถ้าผู้ทำทัณฑ์บนตามความในมาตรา ๔๖ กระทำผิดทัณฑ์บน ให้ศาลมีอำนาจสั่งให้ผู้นั้นชำระเงินไม่เกินจำนวนที่ได้กำหนดไว้ในทัณฑ์บน ถ้าผู้นั้นไม่ชำระให้นำบทบัญญัติในมาตรา ๒๙ และมาตรา ๓๐ มาใช้บังคับ
มาตรา ๔๘ ถ้าศาลเห็นว่า การปล่อยตัวผู้มีจิตบกพร่อง โรคจิตหรือจิตฟั่นเฟือน ซึ่งไม่ต้องรับโทษหรือได้รับการลดโทษตามมาตรา ๖๕ จะเป็นการไม่ปลอดภัยแก่ประชาชน ศาลจะสั่งให้ส่งไปคุมตัวไว้ในสถานพยาบาลก็ได้ และคำสั่งนี้ศาลจะเพิกถอนเสียเมื่อใดก็ได้
มาตรา ๔๙ ในกรณีที่ศาลพิพากษาลงโทษจำคุก หรือพิพากษาว่ามีความผิดแต่รอการกำหนดโทษ หรือรอการลงโทษบุคคลใด ถ้าศาลเห็นว่าบุคคลนั้นได้กระทำความผิดเกี่ยวเนื่องกับการเสพสุราเป็นอาจิณ หรือการเป็นผู้ติดยาเสพติดให้โทษ ศาลจะกำหนดในคำพิพากษาว่า บุคคลนั้นจะต้องไม่เสพสุรา ยาเสพติดให้โทษอย่างหนึ่งอย่างใด หรือทั้งสองอย่าง ภายในระยะเวลาไม่เกินสองปีนับแต่วันพ้นโทษหรือวันปล่อยตัวเพราะรอการกำหนดโทษ หรือรอการลงโทษก็ได้
ในกรณีที่บุคคลดังกล่าวในวรรคแรกไม่ปฏิบัติตามที่ศาลกำหนด ศาลจะสั่งให้ส่งไปคุมตัวไว้ในสถานพยาบาลเป็นเวลาไม่เกินสองปีก็ได้
มาตรา ๕๐ เมื่อศาลพิพากษาให้ลงโทษผู้ใด ถ้าศาลเห็นว่าผู้นั้นกระทำความผิดโดยอาศัยโอกาสจากการประกอบอาชีพหรือวิชาชีพ หรือเนื่องจากการประกอบอาชีพหรือวิชาชีพ และเห็นว่าหากผู้นั้นประกอบอาชีพหรือวิชาชีพนั้นต่อไปอาจจะกระทำความผิดเช่นนั้นขึ้นอีก ศาลจะสั่งไว้ในคำพิพากษาห้ามการประกอบอาชีพหรือวิชาชีพนั้น มีกำหนดเวลาไม่เกินห้าปีนับแต่วันพ้นโทษไปแล้วก็ได้
ส่วนที่ ๓
วิธีเพิ่มโทษ ลดโทษ และการรอการลงโทษ
มาตรา ๕๑ ในการเพิ่มโทษ มิให้เพิ่มขึ้นถึงประหารชีวิต จำคุกตลอดชีวิต หรือจำคุกเกินห้าสิบปี
มาตรา ๕๒ ในการลดโทษประหารชีวิต ไม่ว่าจะเป็นการลดมาตราส่วนโทษหรือลดโทษที่จะลง ให้ลดดังต่อไปนี้
(๑) ถ้าจะลดหนึ่งในสามให้ลดเป็นโทษจำคุกตลอดชีวิต
(๒) ถ้าจะลดกึ่งหนึ่ง ให้ลดเป็นโทษจำคุกตลอดชีวิต หรือโทษจำคุกตั้งแต่ยี่สิบห้าปี ถึงห้าสิบปี
มาตรา ๕๓ ในการลดโทษจำคุกตลอดชีวิต ไม่ว่าจะเป็นการลดมาตราส่วนโทษหรือลดโทษที่จะลง ให้เปลี่ยนโทษจำคุกตลอดชีวิตเป็นโทษจำคุกห้าสิบปี
มาตรา ๕๔ ในการคำนวณการเพิ่มโทษหรือลดโทษที่จะลง ให้ศาลตั้งกำหนดโทษที่จะลงแก่จำเลยเสียก่อนแล้ว จึงเพิ่มหรือลด ถ้ามีทั้งการเพิ่มและการลดโทษที่จะลง ให้เพิ่มก่อนแล้วจึงลดจากผลที่เพิ่มแล้วนั้น ถ้าส่วนของการเพิ่มเท่ากับหรือมากกว่าส่วนของการลด และศาลเห็นสมควรจะไม่เพิ่มไม่ลดก็ได้
มาตรา ๕๕ ถ้าโทษจำคุกที่ผู้กระทำความผิดจะต้องรับมีกำหนดเวลาเพียงสามเดือนหรือน้อยกว่า ศาลจะกำหนดโทษจำคุกให้น้อยลงอีกก็ได้ หรือถ้าโทษจำคุกที่ผู้กระทำความผิดจะต้องรับ มีกำหนดเวลาเพียงสามเดือนหรือน้อยกว่าและมีโทษปรับด้วย ศาลจะกำหนดโทษจำคุกให้น้อยลง หรือจะยกโทษจำคุกเสีย คงให้ปรับแต่อย่างเดียวก็ได้
มาตรา ๕๖ ผู้ใดกระทำความผิดซึ่งมีโทษจำคุกหรือปรับ และในคดีนั้นศาลจะลงโทษจำคุกไม่เกินห้าปีไม่ว่าจะลงโทษปรับด้วยหรือไม่ก็ตามหรือลงโทษปรับ ถ้าปรากฏว่าผู้นั้น
(๑) ไม่เคยรับโทษจำคุกมาก่อน หรือ
(๒) เคยรับโทษจำคุกมาก่อนแต่เป็นโทษสำหรับความผิดที่ได้กระทำโดยประมาท หรือความผิดลหุโทษ หรือเป็นโทษจำคุกไม่เกินหกเดือน หรือ
        (๓) เคยรับโทษจำคุกมาก่อนแต่พ้นโทษจำคุกมาแล้วเกินกว่าห้าปี แล้วมากระทำความผิดอีก โดยความผิดในครั้งหลังเป็นความผิดที่ได้กระทำโดยประมาทหรือความผิดลหุโทษ
และเมื่อศาลได้คำนึงถึงอายุ ประวัติ ความประพฤติ สติปัญญา การศึกษาอบรม สุขภาพ ภาวะแห่งจิต นิสัย อาชีพ และสิ่งแวดล้อมของผู้นั้น หรือสภาพความผิด หรือการรู้สึกความผิด และพยายามบรรเทาผลร้ายที่เกิดขึ้น หรือเหตุอื่นอันควรปรานีแล้ว ศาลจะพิพากษาว่าผู้นั้นมีความผิดแต่รอการกำหนดโทษหรือกำหนดโทษแต่รอการลงโทษไว้ ไม่ว่าจะเป็นโทษจำคุกหรือปรับอย่างหนึ่งอย่างใดหรือทั้งสองอย่าง เพื่อให้โอกาสกลับตัวภายในระยะเวลาที่ศาลจะได้กำหนดแต่ต้องไม่เกินห้าปีนับแต่วันที่ศาลพิพากษา โดยจะกำหนดเงื่อนไขเพื่อคุมความประพฤติของผู้นั้นด้วยหรือไม่ก็ได้
เงื่อนไขเพื่อคุมความประพฤติของผู้กระทำความผิดตามวรรคหนึ่ง ศาลอาจกำหนดข้อเดียวหรือหลายข้อตามควรแก่กรณีได้ ดังต่อไปนี้
(๑) ให้ไปรายงานตัวต่อเจ้าพนักงานที่ศาลระบุไว้เป็นครั้งคราว เพื่อเจ้าพนักงานจะได้สอบถาม แนะนำ ช่วยเหลือ หรือตักเตือนตามที่เห็นสมควรในเรื่องความประพฤติและการประกอบอาชีพ หรือจัดให้กระทำกิจกรรมบริการสังคมหรือสาธารณประโยชน์
(๒) ให้ฝึกหัดหรือทำงานอาชีพอันเป็นกิจจะลักษณะ
(๓) ให้ละเว้นการคบหาสมาคมหรือการประพฤติใดอันอาจนำไปสู่การกระทำความผิดในทำนองเดียวกันอีก
(๔) ให้ไปรับการบำบัดรักษาการติดยาเสพติดให้โทษ ความบกพร่องทางร่างกายหรือจิตใจ หรือความเจ็บป่วยอย่างอื่น ณ สถานที่และตามระยะเวลาที่ศาลกำหนด
(๕) ให้เข้ารับการฝึกอบรม ณ สถานที่และตามระยะเวลาที่ศาลกำหนด
(๖) ห้ามออกนอกสถานที่อยู่อาศัย หรือห้ามเข้าในสถานที่ใดในระหว่างเวลาที่ศาลกำหนด  ทั้งนี้ จะใช้อุปกรณ์อิเล็กทรอนิกส์หรืออุปกรณ์อื่นใดที่สามารถใช้ตรวจสอบหรือจำกัดการเดินทางด้วยก็ได้
(๗) ให้ชดใช้ค่าสินไหมทดแทนหรือเยียวยาความเสียหายโดยวิธีอื่นให้แก่ผู้เสียหายตามที่ผู้กระทำความผิดและผู้เสียหายตกลงกัน
(๘) ให้แก้ไขฟื้นฟูหรือเยียวยาความเสียหายที่เกิดแก่ทรัพยากรธรรมชาติ หรือสิ่งแวดล้อม หรือชดใช้ค่าเสียหายเพื่อการดังกล่าว
(๙) ให้ทำทัณฑ์บนโดยกำหนดจำนวนเงินตามที่ศาลเห็นสมควรว่าจะไม่ก่อเหตุร้าย หรือก่อให้เกิดภยันตรายแก่บุคคลอื่นหรือทรัพย์สิน
(๑๐) เงื่อนไขอื่น ๆ ตามที่ศาลเห็นสมควรกำหนดเพื่อแก้ไข ฟื้นฟู หรือป้องกันมิให้ผู้กระทำความผิดกระทำหรือมีโอกาสกระทำความผิดขึ้นอีก หรือเงื่อนไขในการเยียวยาผู้เสียหายตามที่เห็นสมควร
เงื่อนไขตามที่ศาลได้กำหนดตามความในวรรคสองนั้น ถ้าภายหลังความปรากฏแก่ศาลตามคำขอของผู้กระทำความผิด ผู้แทนโดยชอบธรรมของผู้นั้น ผู้อนุบาลของผู้นั้น พนักงานอัยการหรือเจ้าพนักงานว่าพฤติการณ์ที่เกี่ยวแก่การควบคุมความประพฤติของผู้กระทำความผิดได้เปลี่ยนแปลงไป เมื่อศาลเห็นสมควรศาลอาจแก้ไขเพิ่มเติมหรือเพิกถอนข้อหนึ่งข้อใดเสียก็ได้ หรือจะกำหนดเงื่อนไขข้อใดตามที่กล่าวในวรรคสองที่ศาลยังมิได้กำหนดไว้เพิ่มเติมขึ้นอีกก็ได้ หรือถ้ามีการกระทำผิดทัณฑ์บนให้นำบทบัญญัติมาตรา ๔๗ มาใช้บังคับโดยอนุโลม
มาตรา ๕๗ เมื่อความปรากฏแก่ศาลเอง หรือความปรากฏตามคำแถลงของพนักงานอัยการหรือเจ้าพนักงานว่า ผู้กระทำความผิดไม่ปฏิบัติตามเงื่อนไขดังที่ศาลกำหนดตามมาตรา ๕๖ ศาลอาจตักเตือนผู้กระทำความผิด หรือจะกำหนดการลงโทษที่ยังไม่ได้กำหนดหรือลงโทษซึ่งรอไว้นั้นก็ได้
มาตรา ๕๘ เมื่อความปรากฏแก่ศาลเอง หรือความปรากฏตามคำแถลงของโจทก์หรือเจ้าพนักงานว่า ภายในเวลาที่ศาลกำหนดตามมาตรา ๕๖ ผู้ที่ถูกศาลพิพากษาได้กระทำความผิดอันมิใช่ความผิดที่ได้กระทำโดยประมาทหรือความผิดลหุโทษ และศาลพิพากษาให้ลงโทษจำคุกสำหรับความผิดนั้น ให้ศาลที่พิพากษาคดีหลังกำหนดโทษที่รอการกำหนดไว้ในคดีก่อนบวกเข้ากับโทษในคดีหลัง หรือบวกโทษที่รอการลงโทษไว้ในคดีก่อนเข้ากับโทษในคดีหลัง แล้วแต่กรณี
แต่ถ้าภายในเวลาที่ศาลได้กำหนดตามมาตรา ๕๖ ผู้นั้นมิได้กระทำความผิดดังกล่าวมาในวรรคแรก ให้ผู้นั้นพ้นจากการที่จะถูกกำหนดโทษ หรือถูกลงโทษในคดีนั้น แล้วแต่กรณี
หมวด ๔
ความรับผิดในทางอาญา
มาตรา ๕๙ บุคคลจะต้องรับผิดในทางอาญาก็ต่อเมื่อได้กระทำโดยเจตนา เว้นแต่จะได้กระทำโดยประมาท ในกรณีที่กฎหมายบัญญัติให้ต้องรับผิดเมื่อได้กระทำโดยประมาท หรือเว้นแต่ในกรณีที่กฎหมายบัญญัติไว้โดยแจ้งชัดให้ต้องรับผิดแม้ได้กระทำโดยไม่มีเจตนา
กระทำโดยเจตนา ได้แก่กระทำโดยรู้สำนึกในการที่กระทำและในขณะเดียวกันผู้กระทำประสงค์ต่อผล หรือย่อมเล็งเห็นผลของการกระทำนั้น
ถ้าผู้กระทำมิได้รู้ข้อเท็จจริงอันเป็นองค์ประกอบของความผิด จะถือว่าผู้กระทำประสงค์ต่อผล หรือย่อมเล็งเห็นผลของการกระทำนั้นมิได้
กระทำโดยประมาท ได้แก่กระทำความผิดมิใช่โดยเจตนา แต่กระทำโดยปราศจากความระมัดระวังซึ่งบุคคลในภาวะเช่นนั้นจักต้องมีตามวิสัยและพฤติการณ์ และผู้กระทำอาจใช้ความระมัดระวังเช่นว่านั้นได้ แต่หาได้ใช้ให้เพียงพอไม่
การกระทำ ให้หมายความรวมถึงการให้เกิดผลอันหนึ่งอันใดขึ้นโดยงดเว้นการที่จักต้องกระทำเพื่อป้องกันผลนั้นด้วย
มาตรา ๖๐ ผู้ใดเจตนาที่จะกระทำต่อบุคคลหนึ่ง แต่ผลของการกระทำเกิดแก่อีกบุคคลหนึ่งโดยพลาดไป ให้ถือว่าผู้นั้นกระทำโดยเจตนาแก่บุคคลซึ่งได้รับผลร้ายจากการกระทำนั้น แต่ในกรณีที่กฎหมายบัญญัติให้ลงโทษหนักขึ้นเพราะฐานะของบุคคลหรือเพราะความสัมพันธ์ระหว่างผู้กระทำกับบุคคลที่ได้รับผลร้าย มิให้นำกฎหมายนั้น มาใช้บังคับเพื่อลงโทษผู้กระทำให้หนักขึ้น
มาตรา ๖๑ ผู้ใดเจตนาจะกระทำต่อบุคคลหนึ่ง แต่ได้กระทำต่ออีกบุคคลหนึ่งโดยสำคัญผิด ผู้นั้นจะยกเอาความสำคัญผิดเป็นข้อแก้ตัวว่ามิได้กระทำโดยเจตนาหาได้ไม่
มาตรา ๖๒ ข้อเท็จจริงใด ถ้ามีอยู่จริงจะทำให้การกระทำไม่เป็นความผิด หรือทำให้ผู้กระทำไม่ต้องรับโทษ หรือได้รับโทษน้อยลง แม้ข้อเท็จจริงนั้นจะไม่มีอยู่จริง แต่ผู้กระทำสำคัญผิดว่ามีอยู่จริง ผู้กระทำย่อมไม่มีความผิด หรือได้รับยกเว้นโทษ หรือได้รับโทษน้อยลง แล้วแต่กรณี
ถ้าความไม่รู้ข้อเท็จจริงตามความในวรรคสามแห่งมาตรา ๕๙ หรือความสำคัญผิดว่ามีอยู่จริงตามความในวรรคแรก ได้เกิดขึ้นด้วยความประมาทของผู้กระทำความผิด ให้ผู้กระทำรับผิดฐานกระทำโดยประมาท ในกรณีที่กฎหมายบัญญัติไว้โดยเฉพาะว่า การกระทำนั้นผู้กระทำจะต้องรับโทษแม้กระทำโดยประมาท
        บุคคลจะต้องรับโทษหนักขึ้นโดยอาศัยข้อเท็จจริงใด บุคคลนั้นจะต้องได้รู้ข้อเท็จจริงนั้น
มาตรา ๖๓ ถ้าผลของการกระทำความผิดใดทำให้ผู้กระทำต้องรับโทษหนักขึ้น ผลของการกระทำความผิดนั้นต้องเป็นผลที่ตามธรรมดาย่อมเกิดขึ้นได้
มาตรา ๖๔ บุคคลจะแก้ตัวว่าไม่รู้กฎหมายเพื่อให้พ้นจากความรับผิดในทางอาญาไม่ได้ แต่ถ้าศาลเห็นว่า ตามสภาพและพฤติการณ์ ผู้กระทำความผิดอาจจะไม่รู้ว่ากฎหมายบัญญัติว่าการกระทำนั้นเป็นความผิด ศาลอาจอนุญาตให้แสดงพยานหลักฐานต่อศาล และถ้าศาลเชื่อว่า ผู้กระทำไม่รู้ว่ากฎหมายบัญญัติไว้เช่นนั้น ศาลจะลงโทษน้อยกว่าที่กฎหมายกำหนดไว้สำหรับความผิดนั้นเพียงใดก็ได้
        มาตรา ๖๕ ผู้ใดกระทำความผิดในขณะไม่สามารถรู้ผิดชอบหรือไม่สามารถบังคับตนเองได้เพราะมีจิตบกพร่อง โรคจิตหรือจิตฟั่นเฟือน ผู้นั้นไม่ต้องรับโทษสำหรับความผิดนั้น
แต่ถ้าผู้กระทำความผิดยังสามารถรู้ผิดชอบอยู่บ้าง หรือยังสามารถบังคับตนเองได้บ้าง ผู้นั้นต้องรับโทษสำหรับความผิดนั้น แต่ศาลจะลงโทษน้อยกว่าที่กฎหมายกำหนดไว้สำหรับความผิดนั้นเพียงใดก็ได้
มาตรา ๖๖ ความมึนเมาเพราะเสพสุราหรือสิ่งเมาอย่างอื่นจะยกขึ้นเป็นข้อแก้ตัวตามมาตรา ๖๕ ไม่ได้ เว้นแต่ความมึนเมานั้นจะได้เกิดโดยผู้เสพไม่รู้ว่าสิ่งนั้นจะทำให้มึนเมา หรือได้เสพโดยถูกขืนใจให้เสพ และได้กระทำความผิดในขณะไม่สามารถรู้ผิดชอบ หรือไม่สามารถบังคับตนเองได้ ผู้กระทำความผิดจึงจะได้รับยกเว้นโทษสำหรับความผิดนั้น แต่ถ้าผู้นั้นยังสามารถรู้ผิดชอบอยู่บ้าง หรือยังสามารถบังคับตนเองได้บ้าง ศาลจะลงโทษน้อยกว่าที่กฎหมายกำหนดไว้สำหรับความผิดนั้นเพียงใดก็ได้
มาตรา ๖๗ ผู้ใดกระทำความผิดด้วยความจำเป็น
(๑) เพราะอยู่ในที่บังคับหรือภายใต้อำนาจซึ่งไม่สามารถหลีกเลี่ยงหรือขัดขืนได้ หรือ
(๒) เพราะเพื่อให้ตนเองหรือผู้อื่นพ้นจากภยันตรายที่ใกล้จะถึงและไม่สามารถหลีกเลี่ยงให้พ้นโดยวิธีอื่นใดได้ เมื่อภยันตรายนั้นตนมิได้ก่อให้เกิดขึ้นเพราะความผิดของตน
ถ้าการกระทำนั้นไม่เป็นการเกินสมควรแก่เหตุแล้ว ผู้นั้นไม่ต้องรับโทษ
มาตรา ๖๘ ผู้ใดจำต้องกระทำการใดเพื่อป้องกันสิทธิของตน หรือของผู้อื่น ให้พ้นภยันตรายซึ่งเกิดจากการประทุษร้ายอันละเมิดต่อกฎหมาย และเป็นภยันตรายที่ใกล้จะถึง ถ้าได้กระทำพอสมควรแก่เหตุ การกระทำนั้นเป็นการป้องกันโดยชอบด้วยกฎหมาย ผู้นั้นไม่มีความผิด
มาตรา ๖๙ ในกรณีที่บัญญัติไว้ในมาตรา ๖๗ และมาตรา ๖๘ นั้น ถ้าผู้กระทำได้กระทำไปเกินสมควรแก่เหตุหรือเกินกว่ากรณีแห่งความจำเป็น หรือเกินกว่ากรณีแห่งการจำต้องกระทำเพื่อป้องกัน ศาลจะลงโทษน้อยกว่าที่กฎหมายกำหนดไว้สำหรับความผิดนั้นเพียงใดก็ได้ แต่ถ้าการกระทำนั้นเกิดขึ้นจากความตื่นเต้น ความตกใจ หรือความกลัว ศาลจะไม่ลงโทษผู้กระทำก็ได้
มาตรา ๗๐ ผู้ใดกระทำตามคำสั่งของเจ้าพนักงาน แม้คำสั่งนั้นจะมิชอบด้วยกฎหมาย ถ้าผู้กระทำมีหน้าที่หรือเชื่อโดยสุจริตว่ามีหน้าที่ต้องปฏิบัติตาม ผู้นั้นไม่ต้องรับโทษ เว้นแต่จะรู้ว่าคำสั่งนั้นเป็นคำสั่งซึ่งมิชอบด้วยกฎหมาย
มาตรา ๗๑ ความผิดตามที่บัญญัติไว้ในมาตรา ๓๓๔ ถึงมาตรา ๓๓๖ วรรคแรก และมาตรา ๓๔๑ ถึงมาตรา ๓๖๔ นั้น ถ้าเป็นการกระทำที่สามีกระทำต่อภริยา หรือภริยากระทำต่อสามี ผู้กระทำไม่ต้องรับโทษ
ความผิดดังระบุมานี้ ถ้าเป็นการกระทำที่ผู้บุพการีกระทำต่อผู้สืบสันดาน ผู้สืบสันดานกระทำต่อผู้บุพการี หรือพี่หรือน้องร่วมบิดามารดาเดียวกันกระทำต่อกัน แม้กฎหมายมิได้บัญญัติให้เป็นความผิดอันยอมความได้ ก็ให้เป็นความผิดอันยอมความได้ และนอกจากนั้น ศาลจะลงโทษน้อยกว่าที่กฎหมายกำหนดไว้สำหรับความผิดนั้นเพียงใดก็ได้
มาตรา ๗๒ ผู้ใดบันดาลโทสะโดยถูกข่มเหงอย่างร้ายแรงด้วยเหตุอันไม่เป็นธรรม จึงกระทำความผิดต่อผู้ข่มเหงในขณะนั้น ศาลจะลงโทษผู้นั้นน้อยกว่าที่กฎหมายกำหนดไว้สำหรับความผิดนั้นเพียงใดก็ได้
มาตรา ๗๓ เด็กอายุยังไม่เกินสิบสองปี กระทำการอันกฎหมายบัญญัติเป็นความผิด เด็กนั้นไม่ต้องรับโทษ 
ให้พนักงานสอบสวนส่งตัวเด็กตามวรรคหนึ่งให้พนักงานเจ้าหน้าที่ตามกฎหมายว่าด้วยการคุ้มครองเด็ก เพื่อดำเนินการคุ้มครองสวัสดิภาพตามกฎหมายว่าด้วยการนั้น
มาตรา ๗๔ เด็กอายุกว่าสิบสองปีแต่ยังไม่เกินสิบห้าปี กระทำการอันกฎหมายบัญญัติเป็นความผิด เด็กนั้นไม่ต้องรับโทษ แต่ให้ศาลมีอำนาจที่จะดำเนินการ ดังต่อไปนี้
(๑) ว่ากล่าวตักเตือนเด็กนั้นแล้วปล่อยตัวไป และถ้าศาลเห็นสมควรจะเรียกบิดา มารดา ผู้ปกครอง หรือบุคคลที่เด็กนั้นอาศัยอยู่มาตักเตือนด้วยก็ได้
(๒) ถ้าศาลเห็นว่าบิดา มารดา หรือผู้ปกครองสามารถดูแลเด็กนั้นได้ ศาลจะมีคำสั่งให้มอบตัวเด็กนั้นให้แก่บิดา มารดา หรือผู้ปกครองไป โดยวางข้อกำหนดให้บิดา มารดา หรือผู้ปกครองระวังเด็กนั้นไม่ให้ก่อเหตุร้ายตลอดเวลาที่ศาลกำหนดซึ่งต้องไม่เกินสามปีและกำหนดจำนวนเงินตามที่เห็นสมควรซึ่งบิดา มารดา หรือผู้ปกครองจะต้องชำระต่อศาลไม่เกินครั้งละหนึ่งหมื่นบาท ในเมื่อเด็กนั้นก่อเหตุร้ายขึ้น แต่ถ้าเด็กนั้นอาศัยอยู่กับบุคคลอื่นนอกจากบิดา มารดา หรือผู้ปกครอง และศาลเห็นว่าไม่สมควรจะเรียกบิดา มารดา หรือผู้ปกครองมาวางข้อกำหนดดังกล่าวข้างต้น ศาลจะเรียกตัวบุคคลที่เด็กนั้นอาศัยอยู่มาสอบถามว่าจะยอมรับข้อกำหนดทำนองที่บัญญัติไว้สำหรับบิดา มารดา หรือผู้ปกครองดังกล่าวมาข้างต้นหรือไม่ก็ได้ ถ้าบุคคลที่เด็กนั้นอาศัยอยู่ยอมรับข้อกำหนดเช่นว่านั้น ก็ให้ศาลมีคำสั่งมอบตัวเด็กให้แก่บุคคลนั้นไปโดยวางข้อกำหนดดังกล่าว
(๓) ส่งตัวเด็กนั้นไปยังสถานศึกษา หรือสถานฝึกและอบรม หรือสถานแนะนำทางจิต หรือสถานที่ซึ่งจัดตั้งขึ้นเพื่อฝึกและอบรมเด็ก ตลอดระยะเวลาที่ศาลกำหนด แต่ไม่ให้เกินกว่าวันที่เด็กนั้นจะมีอายุครบสิบแปดปี
ในกรณีที่ศาลมอบตัวเด็กให้แก่บิดา มารดา ผู้ปกครอง หรือบุคคลที่เด็กนั้นอาศัยอยู่ ตาม (๒) ศาลจะกำหนดเงื่อนไขเพื่อคุมความประพฤติเด็กนั้นเช่นเดียวกับที่บัญญัติไว้ในมาตรา ๕๖ ด้วยก็ได้ ในกรณีเช่นว่านี้ ให้ศาลแต่งตั้งพนักงานคุมประพฤติหรือพนักงานอื่นใดเพื่อคุมความประพฤติเด็กนั้น
ในกรณีที่เด็กนั้นไม่มีบิดา มารดา หรือผู้ปกครอง หรือมีแต่ศาลเห็นว่าไม่สามารถดูแลเด็กนั้นได้ หรือในกรณีที่เด็กอาศัยอยู่กับบุคคลอื่นนอกจากบิดา มารดา หรือผู้ปกครอง และบุคคลนั้นไม่ยอมรับข้อกำหนดดังกล่าวใน (๒) ศาลจะมีคำสั่งให้มอบตัวเด็กนั้นให้อยู่กับบุคคลหรือองค์การที่ศาลเห็นสมควรเพื่อดูแล อบรม และสั่งสอนตามระยะเวลาที่ศาลกำหนดก็ได้ในเมื่อบุคคลหรือองค์การนั้นยินยอม ในกรณีเช่นว่านี้ ให้บุคคลหรือองค์การนั้นมีอำนาจเช่นผู้ปกครองเฉพาะเพื่อดูแล อบรม และสั่งสอน รวมตลอดถึงการกำหนดที่อยู่และการจัดให้เด็กมีงานทำตามสมควรหรือให้ดำเนินการคุ้มครองสวัสดิภาพเด็กตามกฎหมายว่าด้วยการนั้นก็ได้
คำสั่งของศาลดังกล่าวใน (๒) (๓) วรรคสอง และวรรคสามนั้น ถ้าในขณะใดภายในระยะเวลาที่ศาลกำหนดไว้ ความปรากฏแก่ศาลโดยศาลรู้เองหรือตามคำเสนอของผู้มีส่วนได้เสีย พนักงานอัยการ หรือบุคคลหรือองค์การที่ศาลมอบตัวเด็กเพื่อดูแล อบรม และสั่งสอน หรือเจ้าพนักงานว่าพฤติการณ์เกี่ยวกับคำสั่งนั้นได้เปลี่ยนแปลงไป ก็ให้ศาลมีอำนาจเปลี่ยนแปลงแก้ไขคำสั่งนั้นหรือมีคำสั่งใหม่ตามอำนาจในมาตรานี้
มาตรา ๗๕ ผู้ใดอายุกว่าสิบห้าปีแต่ต่ำกว่าสิบแปดปี กระทำการอันกฎหมายบัญญัติเป็นความผิด ให้ศาลพิจารณาถึงความรู้ผิดชอบและสิ่งอื่นทั้งปวงเกี่ยวกับผู้นั้น ในอันที่จะควรวินิจฉัยว่าสมควรพิพากษาลงโทษผู้นั้นหรือไม่ ถ้าศาลเห็นว่าไม่สมควรพิพากษาลงโทษก็ให้จัดการตามมาตรา ๗๔ หรือถ้าศาลเห็นว่าสมควรพิพากษาลงโทษ ก็ให้ลดมาตราส่วนโทษที่กำหนดไว้สำหรับความผิดลงกึ่งหนึ่ง
มาตรา ๗๖ ผู้ใดอายุตั้งแต่สิบแปดปีแต่ยังไม่เกินยี่สิบปี กระทำการอันกฎหมายบัญญัติเป็นความผิด ถ้าศาลเห็นสมควรจะลดมาตราส่วนโทษที่กำหนดไว้สำหรับความผิดนั้นลงหนึ่งในสามหรือกึ่งหนึ่งก็ได้
มาตรา ๗๗ ในกรณีที่ศาลวางข้อกำหนดให้บิดามารดา ผู้ปกครองหรือบุคคลที่เด็กนั้นอาศัยอยู่ ระวังเด็กนั้นไม่ให้ก่อเหตุร้ายตามความในมาตรา ๗๔ (๒) ถ้าเด็กนั้นก่อเหตุร้ายขึ้นภายในเวลาในข้อกำหนด ศาลมีอำนาจบังคับบิดามารดา ผู้ปกครองหรือบุคคลที่เด็กนั้นอาศัยอยู่ ให้ชำระเงินไม่เกินจำนวนในข้อกำหนดนั้น ภายในเวลาที่ศาลเห็นสมควร ถ้าบิดามารดา ผู้ปกครองหรือบุคคลที่เด็กนั้นอาศัยอยู่ไม่ชำระเงิน ศาลจะสั่งให้ยึดทรัพย์สินของบิดามารดา ผู้ปกครองหรือบุคคลที่เด็กนั้นอาศัยอยู่ เพื่อใช้เงินที่จะต้องชำระก็ได้
ในกรณีที่ศาลได้บังคับให้บิดามารดา ผู้ปกครองหรือบุคคลที่เด็กนั้นอาศัยอยู่ชำระเงินตามข้อกำหนดแล้วนั้น ถ้าศาลมิได้เปลี่ยนแปลงแก้ไขคำสั่งที่ได้วางข้อกำหนดนั้นเป็นอย่างอื่นตามความในมาตรา ๗๔ วรรคท้าย ก็ให้ข้อกำหนดนั้นคงใช้บังคับได้ต่อไปจนสิ้นเวลาที่กำหนดไว้ในข้อกำหนดนั้น
มาตรา ๗๘ เมื่อปรากฏว่ามีเหตุบรรเทาโทษ ไม่ว่าจะได้มีการเพิ่มหรือการลดโทษตามบทบัญญัติแห่งประมวลกฎหมายนี้ หรือกฎหมายอื่นแล้วหรือไม่ ถ้าศาลเห็นสมควรจะลดโทษไม่เกินกึ่งหนึ่งของโทษที่จะลงแก่ผู้กระทำความผิดนั้นก็ได้
เหตุบรรเทาโทษนั้นได้แก่ผู้กระทำความผิดเป็นผู้โฉดเขลาเบาปัญญาตกอยู่ในความทุกข์อย่างสาหัส มีคุณความดีมาแต่ก่อน รู้สึกความผิดและพยายามบรรเทาผลร้ายแห่งความผิดนั้น ลุแก่โทษต่อเจ้าพนักงานหรือให้ความรู้แก่ศาลอันเป็นประโยชน์แก่การพิจารณา หรือเหตุอื่นที่ศาลเห็นว่ามีลักษณะทำนองเดียวกัน
มาตรา ๗๙ ในคดีที่มีโทษปรับสถานเดียว ถ้าผู้ที่ต้องหาว่ากระทำความผิด นำค่าปรับในอัตราอย่างสูงสำหรับความผิดนั้นมาชำระก่อนที่ศาลเริ่มต้นสืบพยาน ให้คดีนั้นเป็นอันระงับไป
หมวด ๕
การพยายามกระทำความผิด
มาตรา ๘๐ ผู้ใดลงมือกระทำความผิดแต่กระทำไปไม่ตลอด หรือกระทำไปตลอดแล้วแต่การกระทำนั้นไม่บรรลุผลผู้นั้นพยายามกระทำความผิด
ผู้ใดพยายามกระทำความผิด ผู้นั้นต้องระวางโทษสองในสามส่วนของโทษที่กฎหมายกำหนดไว้สำหรับความผิดนั้น
มาตรา ๘๑ ผู้ใดกระทำการโดยมุ่งต่อผลซึ่งกฎหมายบัญญัติเป็นความผิด แต่การกระทำนั้นไม่สามารถจะบรรลุผลได้อย่างแน่แท้ เพราะเหตุปัจจัยซึ่งใช้ในการกระทำหรือเหตุแห่งวัตถุที่มุ่งหมายกระทำต่อ ให้ถือว่าผู้นั้นพยายามกระทำความผิด แต่ให้ลงโทษไม่เกินกึ่งหนึ่งของโทษที่กฎหมายกำหนดไว้สำหรับความผิดนั้น
ถ้าการกระทำดังกล่าวในวรรคแรกได้กระทำไปโดยความเชื่ออย่างงมงาย ศาลจะไม่ลงโทษก็ได้
มาตรา ๘๒ ผู้ใดพยายามกระทำความผิด หากยับยั้งเสียเองไม่กระทำการให้ตลอด หรือกลับใจแก้ไขไม่ให้การกระทำนั้นบรรลุผล ผู้นั้นไม่ต้องรับโทษสำหรับการพยายามกระทำความผิดนั้น แต่ถ้าการที่ได้กระทำไปแล้วต้องตามบทกฎหมายที่บัญญัติเป็นความผิด ผู้นั้นต้องรับโทษสำหรับความผิดนั้น ๆ
หมวด ๖
ตัวการและผู้สนับสนุน
มาตรา ๘๓ ในกรณีความผิดใดเกิดขึ้นโดยการกระทำของบุคคลตั้งแต่สองคนขึ้นไป ผู้ที่ได้ร่วมกระทำความผิดด้วยกันนั้นเป็นตัวการ ต้องระวางโทษตามที่กฎหมายกำหนดไว้สำหรับความผิดนั้น
มาตรา ๘๔ ผู้ใดก่อให้ผู้อื่นกระทำความผิดไม่ว่าด้วยการใช้ บังคับ ขู่เข็ญ จ้าง วาน หรือยุยงส่งเสริม หรือด้วยวิธีอื่นใด ผู้นั้นเป็นผู้ใช้ให้กระทำความผิด
ถ้าความผิดมิได้กระทำลงไม่ว่าจะเป็นเพราะผู้ถูกใช้ไม่ยอมกระทำ ยังไม่ได้กระทำ หรือเหตุอื่นใด ผู้ใช้ต้องระวางโทษเพียงหนึ่งในสามของโทษที่กำหนดไว้สำหรับความผิดนั้น
ถ้าผู้ถูกใช้ได้กระทำความผิดนั้น ผู้ใช้ต้องรับโทษเสมือนเป็นตัวการ และถ้าผู้ถูกใช้เป็นบุคคลอายุไม่เกินสิบแปดปี ผู้พิการ ผู้ทุพพลภาพ ลูกจ้างหรือผู้ที่อยู่ใต้บังคับบัญชาของผู้ใช้ ผู้ที่มีฐานะยากจน หรือผู้ต้องพึ่งพาผู้ใช้เพราะเหตุป่วยเจ็บหรือไม่ว่าทางใด ให้เพิ่มโทษที่จะลงแก่ผู้ใช้กึ่งหนึ่งของโทษที่ศาลกำหนดสำหรับผู้นั้น
มาตรา ๘๕ ผู้ใดโฆษณาหรือประกาศแก่บุคคลทั่วไปให้กระทำความผิด และความผิดนั้นมีกำหนดโทษไม่ต่ำกว่าหกเดือน ผู้นั้นต้องระวางโทษกึ่งหนึ่งของโทษที่กำหนดไว้สำหรับความผิดนั้น
ถ้าได้มีการกระทำความผิด เพราะเหตุที่ได้มีการโฆษณาหรือประกาศตามความในวรรคแรก ผู้โฆษณาหรือประกาศต้องรับโทษเสมือนเป็นตัวการ
มาตรา ๘๕/๑ ถ้าผู้ถูกใช้ตามมาตรา ๘๔ หรือผู้กระทำตามคำโฆษณา หรือประกาศแก่บุคคลทั่วไปให้กระทำความผิดตามมาตรา ๘๕ ได้ให้ข้อมูลสำคัญอันเป็นการเปิดเผยถึงการกระทำความผิดของผู้ใช้ให้กระทำความผิดหรือผู้โฆษณาหรือประกาศแก่บุคคลทั่วไปให้กระทำความผิด และเป็นประโยชน์อย่างยิ่งต่อการดำเนินคดีแก่บุคคลดังกล่าว ศาลจะลงโทษผู้นั้นน้อยกว่าอัตราโทษขั้นต่ำที่กำหนดไว้สำหรับความผิดนั้นเพียงใดก็ได้
มาตรา ๘๖ ผู้ใดกระทำด้วยประการใด ๆ อันเป็นการช่วยเหลือ หรือให้ความสะดวกในการที่ผู้อื่นกระทำความผิดก่อนหรือขณะกระทำความผิด แม้ผู้กระทำความผิดจะมิได้รู้ถึงการช่วยเหลือหรือให้ความสะดวกนั้นก็ตาม ผู้นั้นเป็นผู้สนับสนุนการกระทำความผิด ต้องระวางโทษสองในสามส่วนของโทษที่กำหนดไว้สำหรับความผิดที่สนับสนุนนั้น
มาตรา ๘๗ ในกรณีที่มีการกระทำความผิดเพราะมีผู้ใช้ให้กระทำตามมาตรา ๘๔ เพราะมีผู้โฆษณาหรือประกาศแก่บุคคลทั่วไปให้กระทำความผิดตามมาตรา ๘๕ หรือโดยมีผู้สนับสนุนตามมาตรา ๘๖ ถ้าความผิดที่เกิดขึ้นนั้น ผู้กระทำได้กระทำไปเกินขอบเขตที่ใช้หรือที่โฆษณาหรือประกาศ หรือเกินไปจากเจตนาของผู้สนับสนุน ผู้ใช้ให้กระทำความผิด ผู้โฆษณาหรือประกาศแก่บุคคลทั่วไปให้กระทำความผิดหรือผู้สนับสนุนการกระทำความผิด แล้วแต่กรณี ต้องรับผิดทางอาญาเพียงสำหรับความผิดเท่าที่อยู่ในขอบเขตที่ใช้หรือที่โฆษณาหรือประกาศ หรืออยู่ในขอบเขตแห่งเจตนาของผู้สนับสนุนการกระทำความผิดเท่านั้น แต่ถ้าโดยพฤติการณ์อาจเล็งเห็นได้ว่า อาจเกิดการกระทำความผิดเช่นที่เกิดขึ้นนั้นได้จากการใช้ การโฆษณา หรือประกาศหรือการสนับสนุนผู้ใช้ให้กระทำความผิด ผู้โฆษณาหรือประกาศแก่บุคคลทั่วไปให้กระทำความผิด หรือผู้สนับสนุนการกระทำความผิด แล้วแต่กรณี ต้องรับผิดทางอาญาตามความผิดที่เกิดขึ้นนั้น
ในกรณีที่ผู้ถูกใช้ ผู้กระทำตามคำโฆษณา หรือประกาศแก่บุคคลทั่วไปให้กระทำความผิด หรือตัวการในความผิด จะต้องรับผิดทางอาญามีกำหนดโทษสูงขึ้นเพราะอาศัยผลที่เกิดจากการกระทำความผิด ผู้ใช้ให้กระทำความผิด ผู้โฆษณาหรือประกาศแก่บุคคลทั่วไปให้กระทำความผิด หรือผู้สนับสนุนการกระทำความผิด แล้วแต่กรณี ต้องรับผิดทางอาญาตามความผิดที่มีกำหนดโทษสูงขึ้นนั้นด้วย แต่ถ้าโดยลักษณะของความผิด ผู้กระทำจะต้องรับผิดทางอาญามีกำหนดโทษสูงขึ้นเฉพาะเมื่อผู้กระทำต้องรู้ หรืออาจเล็งเห็นได้ว่าจะเกิดผลเช่นนั้นขึ้น ผู้ใช้ให้กระทำความผิด ผู้โฆษณาหรือประกาศแก่บุคคลทั่วไปให้กระทำความผิด หรือผู้สนับสนุนการกระทำความผิด จะต้องรับผิดทางอาญาตามความผิดที่มีกำหนดโทษสูงขึ้นก็เฉพาะเมื่อตนได้รู้ หรืออาจเล็งเห็นได้ว่าจะเกิดผลเช่นที่เกิดขึ้นนั้น
มาตรา ๘๘ ถ้าความผิดที่ได้ใช้ ที่ได้โฆษณาหรือประกาศแก่บุคคลทั่วไปให้กระทำ หรือที่ได้สนับสนุนให้กระทำ ได้กระทำถึงขั้นลงมือกระทำความผิด แต่เนื่องจากการเข้าขัดขวางของผู้ใช้ ผู้โฆษณาหรือประกาศหรือผู้สนับสนุน ผู้กระทำได้กระทำไปไม่ตลอด หรือกระทำไปตลอดแล้ว แต่การกระทำนั้นไม่บรรลุผล ผู้ใช้หรือผู้โฆษณาหรือประกาศ คงรับผิดเพียงที่บัญญัติไว้ในมาตรา ๘๔ วรรคสอง หรือมาตรา ๘๕ วรรคแรก แล้วแต่กรณี ส่วนผู้สนับสนุนนั้นไม่ต้องรับโทษ
มาตรา ๘๙ ถ้ามีเหตุส่วนตัวอันควรยกเว้นโทษ ลดโทษหรือเพิ่มโทษแก่ผู้กระทำความผิดคนใด จะนำเหตุนั้นไปใช้แก่ผู้กระทำความผิดคนอื่นในการกระทำความผิดนั้นด้วยไม่ได้ แต่ถ้าเหตุอันควรยกเว้นโทษ ลดโทษหรือเพิ่มโทษเป็นเหตุในลักษณะคดี จึงให้ใช้แก่ผู้กระทำความผิดในการกระทำความผิดนั้นด้วยกันทุกคน
หมวด ๗
การกระทำความผิดหลายบทหรือหลายกระทง
มาตรา ๙๐ เมื่อการกระทำใดอันเป็นกรรมเดียวเป็นความผิดต่อกฎหมายหลายบท ให้ใช้กฎหมายบทที่มีโทษหนักที่สุดลงโทษแก่ผู้กระทำความผิด
มาตรา ๙๑ เมื่อปรากฏว่าผู้ใดได้กระทำการอันเป็นความผิดหลายกรรมต่างกัน ให้ศาลลงโทษผู้นั้นทุกกรรมเป็นกระทงความผิดไป แต่ไม่ว่าการเพิ่มโทษ ลดโทษ หรือลดมาตราส่วนโทษด้วยหรือไม่ก็ตาม เมื่อรวมโทษทุกกระทงแล้ว โทษจำคุกทั้งสิ้นต้องไม่เกินกำหนดดังต่อไปนี้
(๑) สิบปี สำหรับกรณีความผิดกระทงที่หนักที่สุดมีอัตราโทษจำคุกอย่างสูงไม่เกินสามปี
(๒) ยี่สิบปี สำหรับกรณีความผิดกระทงที่หนักที่สุดมีอัตราโทษจำคุกอย่างสูงเกินสามปีแต่ไม่เกินสิบปี
(๓) ห้าสิบปี สำหรับกรณีความผิดกระทงที่หนักที่สุดมีอัตราโทษจำคุกอย่างสูงเกินสิบปีขึ้นไป เว้นแต่กรณีที่ศาลลงโทษจำคุกตลอดชีวิต
หมวด ๘
การกระทำความผิดอีก
มาตรา ๙๒ ผู้ใดต้องคำพิพากษาถึงที่สุดให้ลงโทษจำคุก ถ้าและได้กระทำความผิดใด ๆ อีกในระหว่างที่ยังจะต้องรับโทษอยู่ก็ดี ภายในเวลาห้าปีนับแต่วันพ้นโทษก็ดี หากศาลจะพิพากษาลงโทษครั้งหลังถึงจำคุก ก็ให้เพิ่มโทษที่จะลงแก่ผู้นั้นหนึ่งในสามของโทษที่ศาลกำหนดสำหรับความผิดครั้งหลัง
มาตรา ๙๓ ผู้ใดต้องคำพิพากษาถึงที่สุดให้ลงโทษจำคุก ถ้าและได้กระทำความผิดอย่างหนึ่งอย่างใดที่จำแนกไว้ในอนุมาตราต่อไปนี้ซ้ำในอนุมาตราเดียวกันอีกในระหว่างที่ยังจะต้องรับโทษอยู่ก็ดี ภายในเวลาสามปีนับแต่วันพ้นโทษก็ดี ถ้าความผิดครั้งแรกเป็นความผิดซึ่งศาลพิพากษาลงโทษจำคุกไม่น้อยกว่าหกเดือน หากศาลจะพิพากษาลงโทษครั้งหลังถึงจำคุก ก็ให้เพิ่มโทษที่จะลงแก่ผู้นั้นกึ่งหนึ่งของโทษที่ศาลกำหนดสำหรับความผิดครั้งหลัง
(๑) ความผิดเกี่ยวกับความมั่นคงแห่งราชอาณาจักร ตามที่บัญญัติไว้ในมาตรา ๑๐๗ ถึงมาตรา ๑๓๕
(๒) ความผิดต่อเจ้าพนักงาน ตามที่บัญญัติไว้ในมาตรา ๑๓๖ ถึงมาตรา ๑๔๖
(๓) ความผิดต่อตำแหน่งหน้าที่ราชการ ตามที่บัญญัติไว้ในมาตรา ๑๔๗ ถึงมาตรา ๑๖๖
(๔) ความผิดต่อเจ้าพนักงานในการยุติธรรม ตามที่บัญญัติไว้ในมาตรา ๑๖๗ ถึงมาตรา ๑๙๒ และมาตรา ๑๙๔
(๕) ความผิดต่อตำแหน่งหน้าที่ในการยุติธรรม ตามที่บัญญัติไว้ในมาตรา ๒๐๐ ถึงมาตรา ๒๐๔
(๖) ความผิดเกี่ยวกับความสงบสุขของประชาชน ตามที่บัญญัติไว้ในมาตรา ๒๐๙ ถึงมาตรา ๒๑๖
(๗) ความผิดเกี่ยวกับการก่อให้เกิดภยันตรายต่อประชาชน ตามที่บัญญัติไว้ในมาตรา ๒๑๗ ถึงมาตรา ๒๒๔ มาตรา ๒๒๖ ถึงมาตรา ๒๓๔ และมาตรา ๒๓๖ ถึงมาตรา ๒๓๘
(๘) ความผิดเกี่ยวกับเงินตรา ตามที่บัญญัติไว้ในมาตรา ๒๔๐ ถึงมาตรา ๒๔๙ ความผิดเกี่ยวกับดวงตราแสตมป์และตั๋ว ตามที่บัญญัติไว้ในมาตรา ๒๕๐ ถึงมาตรา ๒๖๑ และความผิดเกี่ยวกับเอกสาร ตามที่บัญญัติไว้ในมาตรา ๒๖๔ ถึงมาตรา ๒๖๙
(๙) ความผิดเกี่ยวกับการค้า ตามที่บัญญัติไว้ในมาตรา ๒๗๐ ถึงมาตรา ๒๗๕
(๑๐) ความผิดเกี่ยวกับเพศ ตามที่บัญญัติไว้ในมาตรา ๒๗๖ ถึงมาตรา ๒๘๕
(๑๑) ความผิดต่อชีวิต ตามที่บัญญัติไว้ในมาตรา ๒๘๘ ถึงมาตรา ๒๙๐ และมาตรา ๒๙๔ ความผิดต่อร่างกาย ตามที่บัญญัติไว้ในมาตรา ๒๙๕ ถึงมาตรา ๒๙๙ ความผิดฐานทำให้แท้งลูก ตามที่บัญญัติไว้ในมาตรา ๓๐๑ ถึงมาตรา ๓๐๓ และความผิดฐานทอดทิ้งเด็ก คนป่วย เจ็บหรือคนชรา ตามที่บัญญัติไว้ในมาตรา ๓๐๖ ถึงมาตรา ๓๐๘
(๑๒) ความผิดต่อเสรีภาพ ตามที่บัญญัติไว้ในมาตรา ๓๐๙ มาตรา ๓๑๐ และมาตรา ๓๑๒ ถึงมาตรา ๓๒๐
(๑๓) ความผิดเกี่ยวกับทรัพย์ ตามที่บัญญัติไว้ในมาตรา ๓๓๔ ถึงมาตรา ๓๖๕
มาตรา ๙๔ ความผิดอันได้กระทำโดยประมาท ความผิดลหุโทษ และความผิดซึ่งผู้กระทำได้กระทำในขณะที่มีอายุต่ำกว่าสิบแปดปีนั้น ไม่ว่าจะได้กระทำในครั้งก่อนหรือครั้งหลัง ไม่ถือว่าเป็นความผิดเพื่อการเพิ่มโทษตามความในหมวดนี้
หมวด ๙
อายุความ
มาตรา ๙๕ ในคดีอาญา ถ้ามิได้ฟ้องและได้ตัวผู้กระทำความผิดมายังศาลภายในกำหนดดังต่อไปนี้ นับแต่วันกระทำความผิด เป็นอันขาดอายุความ
       (๑) ยี่สิบปี สำหรับความผิดต้องระวางโทษประหารชีวิต จำคุกตลอดชีวิต หรือจำคุกยี่สิบปี
(๒) สิบห้าปี สำหรับความผิดต้องระวางโทษจำคุกกว่าเจ็ดปีแต่ยังไม่ถึงยี่สิบปี
(๓) สิบปี สำหรับความผิดต้องระวางโทษจำคุกกว่าหนึ่งปีถึงเจ็ดปี
(๔) ห้าปี สำหรับความผิดต้องระวางโทษจำคุกกว่าหนึ่งเดือนถึงหนึ่งปี
(๕) หนึ่งปี สำหรับความผิดต้องระวางโทษจำคุกตั้งแต่หนึ่งเดือนลงมา หรือต้องระวางโทษอย่างอื่น
ถ้าได้ฟ้องและได้ตัวผู้กระทำความผิดมายังศาลแล้ว ผู้กระทำความผิดหลบหนีหรือวิกลจริต และศาลสั่งงดการพิจารณาไว้จนเกินกำหนดดังกล่าวแล้วนับแต่วันที่หลบหนีหรือวันที่ศาลสั่งงดการพิจารณา ก็ให้ถือว่าเป็นอันขาดอายุความเช่นเดียวกัน
มาตรา ๙๖ ภายใต้บังคับมาตรา ๙๕ ในกรณีความผิดอันยอมความได้ ถ้าผู้เสียหายมิได้ร้องทุกข์ภายในสามเดือนนับแต่วันที่รู้เรื่องความผิดและรู้ตัวผู้กระทำความผิด เป็นอันขาดอายุความ
มาตรา ๙๗ ในการฟ้องขอให้กักกัน ถ้าจะฟ้องภายหลังการฟ้องคดีอันเป็นมูลให้เกิดอำนาจฟ้องขอให้กักกัน ต้องฟ้องภายในกำหนดหกเดือนนับแต่วันที่ฟ้องคดีนั้น มิฉะนั้นเป็นอันขาดอายุความ
มาตรา ๙๘ เมื่อได้มีคำพิพากษาถึงที่สุดให้ลงโทษผู้ใด ผู้นั้นยังมิได้รับโทษก็ดี ได้รับโทษแต่ยังไม่ครบถ้วนโดยหลบหนีก็ดี ถ้ายังมิได้ตัวผู้นั้นมาเพื่อรับโทษนับแต่วันที่มีคำพิพากษาถึงที่สุด หรือนับแต่วันที่ผู้กระทำความผิดหลบหนี แล้วแต่กรณี เกินกำหนดเวลาดังต่อไปนี้ เป็นอันล่วงเลยการลงโทษ จะลงโทษผู้นั้นมิได้
(๑) ยี่สิบปี สำหรับโทษประหารชีวิต จำคุกตลอดชีวิตหรือจำคุกยี่สิบปี
(๒) สิบห้าปี สำหรับโทษจำคุกกว่าเจ็ดปีแต่ยังไม่ถึงยี่สิบปี
(๓) สิบปี สำหรับโทษจำคุกกว่าหนึ่งปีถึงเจ็ดปี
(๔) ห้าปี สำหรับโทษจำคุกตั้งแต่หนึ่งปีลงมาหรือโทษอย่างอื่น
มาตรา ๙๙ การยึดทรัพย์สินหรืออายัดสิทธิเรียกร้องในทรัพย์สินเพื่อใช้ค่าปรับหรือการกักขังแทนค่าปรับ ถ้ามิได้ทำภายในกำหนดห้าปีนับแต่วันที่ได้มีคำพิพากษาถึงที่สุด จะยึดทรัพย์สิน อายัดสิทธิเรียกร้องในทรัพย์สิน หรือกักขังไม่ได้
ความในวรรคหนึ่งมิให้ใช้บังคับในกรณีการกักขังแทนค่าปรับซึ่งทำต่อเนื่องกับการลงโทษจำคุก
มาตรา ๑๐๐ เมื่อได้มีคำพิพากษาถึงที่สุดให้กักกันผู้ใด ถ้าผู้นั้นยังมิได้รับการกักกันก็ดี ได้รับการกักกันแต่ยังไม่ครบถ้วนโดยหลบหนีก็ดี ถ้าพ้นกำหนดสามปีนับแต่วันที่พ้นโทษโดยได้รับโทษตามคำพิพากษาแล้วโดยล่วงเลยการลงโทษหรือนับแต่วันที่ผู้นั้นหลบหนีระหว่างเวลาที่ต้องกักกัน เป็นอันล่วงเลยการกักกัน จะกักกันผู้นั้นไม่ได้
มาตรา ๑๐๑ การบังคับตามคำสั่งของศาลตามความในมาตรา ๔๖ หรือการร้องขอให้ศาลสั่งให้ใช้เงินเมื่อผู้ทำทัณฑ์บนประพฤติผิดทัณฑ์บนตามความในมาตรา ๔๗ นั้น ถ้ามิได้บังคับหรือร้องขอภายในกำหนดสองปีนับแต่วันที่ศาลมีคำสั่งหรือนับแต่วันที่ผู้ทำทัณฑ์บนประพฤติผิดทัณฑ์บน จะบังคับหรือร้องขอมิได้
ลักษณะ ๒
บทบัญญัติที่ใช้แก่ความผิดลหุโทษ
มาตรา ๑๐๒ ความผิดลหุโทษ คือ ความผิดซึ่งต้องระวางโทษจำคุกไม่เกินหนึ่งเดือน หรือปรับไม่เกินหนึ่งหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๐๓ บทบัญญัติในลักษณะ ๑ ให้ใช้ในกรณีแห่งความผิดลหุโทษด้วย เว้นแต่ที่บัญญัติไว้ในสามมาตราต่อไปนี้
    มาตรา ๑๐๔ การกระทำความผิดลหุโทษตามประมวลกฎหมายนี้ แม้กระทำโดยไม่มีเจตนาก็เป็นความผิด เว้นแต่ตามบทบัญญัติความผิดนั้นจะมีความบัญญัติให้เห็นเป็นอย่างอื่น
มาตรา ๑๐๕ ผู้ใดพยายามกระทำความผิดลหุโทษ ผู้นั้นไม่ต้องรับโทษ
มาตรา ๑๐๖ ผู้สนับสนุนในความผิดลหุโทษไม่ต้องรับโทษ
ภาค ๒
ความผิด
ลักษณะ ๑
ความผิดเกี่ยวกับความมั่นคงแห่งราชอาณาจักร
หมวด ๑
ความผิดต่อองค์พระมหากษัตริย์ พระราชินี รัชทายาท
และผู้สำเร็จราชการแทนพระองค์
มาตรา ๑๐๗ ผู้ใดปลงพระชนม์พระมหากษัตริย์ ต้องระวางโทษประหารชีวิต
ผู้ใดพยายามกระทำการเช่นว่านั้น ต้องระวางโทษเช่นเดียวกัน
ผู้ใดกระทำการใดอันเป็นการตระเตรียมเพื่อปลงพระชนม์พระมหากษัตริย์ หรือรู้ว่ามีผู้จะปลงพระชนม์พระมหากษัตริย์ กระทำการใดอันเป็นการช่วยปกปิดไว้ ต้องระวางโทษจำคุกตลอดชีวิต
มาตรา ๑๐๘ ผู้ใดกระทำการประทุษร้ายต่อพระองค์หรือเสรีภาพของพระมหากษัตริย์ ต้องระวางโทษประหารชีวิต หรือจำคุกตลอดชีวิต
ผู้ใดพยายามกระทำการเช่นว่านั้น ต้องระวางโทษเช่นเดียวกัน
ถ้าการกระทำนั้นมีลักษณะอันน่าจะเป็นอันตรายแก่พระชนม์ ผู้กระทำต้องระวางโทษประหารชีวิต
ผู้ใดกระทำการใดอันเป็นการตระเตรียมเพื่อประทุษร้ายต่อพระองค์ หรือเสรีภาพของพระมหากษัตริย์ หรือรู้ว่ามีผู้จะกระทำการประทุษร้ายต่อพระองค์ หรือเสรีภาพของพระมหากษัตริย์ กระทำการใดอันเป็นการช่วยปกปิดไว้ ต้องระวางโทษจำคุกตั้งแต่สิบหกปีถึงยี่สิบปี
มาตรา ๑๐๙ ผู้ใดปลงพระชนม์พระราชินีหรือรัชทายาทหรือฆ่าผู้สำเร็จราชการแทนพระองค์ ต้องระวางโทษประหารชีวิต
ผู้ใดพยายามกระทำการเช่นว่านั้น ต้องระวางโทษเช่นเดียวกัน
ผู้ใดกระทำการใดอันเป็นการตระเตรียมเพื่อปลงพระชนม์พระราชินีหรือรัชทายาท หรือเพื่อฆ่าผู้สำเร็จราชการแทนพระองค์ หรือรู้ว่ามีผู้จะปลงพระชนม์พระราชินีหรือรัชทายาท หรือจะฆ่าผู้สำเร็จราชการแทนพระองค์ กระทำการใดอันเป็นการช่วยปกปิดไว้ ต้องระวางโทษจำคุกตั้งแต่สิบสองปีถึงยี่สิบปี
มาตรา ๑๑๐ ผู้ใดกระทำการประทุษร้ายต่อพระองค์ หรือเสรีภาพของพระราชินีหรือรัชทายาท หรือต่อร่างกายหรือเสรีภาพของผู้สำเร็จราชการแทนพระองค์ ต้องระวางโทษจำคุกตลอดชีวิต หรือจำคุกตั้งแต่สิบหกปีถึงยี่สิบปี
ผู้ใดพยายามกระทำการเช่นว่านั้น ต้องระวางโทษเช่นเดียวกัน
ถ้าการกระทำนั้นมีลักษณะอันน่าจะเป็นอันตรายแก่พระชนม์หรือชีวิต ผู้กระทำต้องระวางโทษประหารชีวิต หรือจำคุกตลอดชีวิต
ผู้ใดกระทำการใดอันเป็นการตระเตรียมเพื่อประทุษร้ายต่อพระองค์ หรือเสรีภาพของพระราชินีหรือรัชทายาท หรือต่อร่างกายหรือเสรีภาพของผู้สำเร็จราชการแทนพระองค์ หรือรู้ว่ามีผู้จะประทุษร้ายต่อพระองค์หรือเสรีภาพของพระราชินีหรือรัชทายาท หรือประทุษร้ายต่อร้างกายหรือเสรีภาพของผู้สำเร็จราชการแทนพระองค์ กระทำการใดอันเป็นการช่วยปกปิดไว้ ต้องระวางโทษจำคุกตั้งแต่สิบสองปีถึงยี่สิบปี
มาตรา ๑๑๑ ผู้ใดเป็นผู้สนับสนุนในการกระทำความผิดตามมาตรา ๑๐๗ ถึงมาตรา ๑๑๐ ต้องระวางโทษเช่นเดียวกับตัวการในความผิดนั้น
มาตรา ๑๑๒ ผู้ใดหมิ่นประมาท ดูหมิ่น หรือแสดงความอาฆาตมาดร้ายพระมหากษัตริย์ พระราชินี รัชทายาท หรือผู้สำเร็จราชการแทนพระองค์ ต้องระวางโทษจำคุกตั้งแต่สามปีถึงสิบห้าปี
หมวด ๒
ความผิดต่อความมั่นคงของรัฐภายในราชอาณาจักร
มาตรา ๑๑๓ ผู้ใดใช้กำลังประทุษร้ายหรือขู่เข็ญว่าจะใช้กำลังประทุษร้าย เพื่อ
(๑) ล้มล้างหรือเปลี่ยนแปลงรัฐธรรมนูญ
(๒) ล้มล้างอำนาจนิติบัญญัติ อำนาจบริหาร หรืออำนาจตุลาการแห่งรัฐธรรมนูญ หรือให้ใช้อำนาจดังกล่าวแล้วไม่ได้ หรือ
(๓) แบ่งแยกราชอาณาจักรหรือยึดอำนาจปกครองในส่วนหนึ่งส่วนใดแห่งราชอาณาจักร
ผู้นั้นกระทำความผิดฐานเป็นกบฏ ต้องระวางโทษประหารชีวิต หรือจำคุกตลอดชีวิต
มาตรา ๑๑๔ ผู้ใดสะสมกำลังพลหรืออาวุธ ตระเตรียมการอื่นใด หรือสมคบกันเพื่อเป็นกบฏ หรือกระทำความผิดใด ๆ อันเป็นส่วนของแผนการ เพื่อเป็นกบฏ หรือยุยงราษฎรให้เป็นกบฏ หรือรู้ว่ามีผู้จะเป็นกบฏ แล้วกระทำการใดอันเป็นการช่วยปกปิดไว้ ต้องระวางโทษจำคุกตั้งแต่สามปีถึงสิบห้าปี
มาตรา ๑๑๕ ผู้ใดยุยงทหารหรือตำรวจให้หนีราชการ ให้ละเลยไม่กระทำการตามหน้าที่ หรือให้ก่อการกำเริบ ต้องระวางโทษจำคุกไม่เกินห้าปี
ถ้าความผิดนั้นได้กระทำลงโดยมุ่งหมายจะบ่อนให้วินัยและสมรรถภาพของกรมกองทหารหรือตำรวจเสื่อมทรามลง ผู้กระทำต้องระวางโทษจำคุกไม่เกินสิบปี
มาตรา ๑๑๖ ผู้ใดกระทำให้ปรากฏแก่ประชาชนด้วยวาจา หนังสือหรือวิธีอื่นใดอันมิใช่เป็นการกระทำภายในความมุ่งหมายแห่งรัฐธรรมนูญ หรือมิใช่เพื่อแสดงความคิดเห็นหรือติชมโดยสุจริต
(๑) เพื่อให้เกิดการเปลี่ยนแปลงในกฎหมายแผ่นดินหรือรัฐบาล โดยใช้กำลังข่มขืนใจหรือใช้กำลังประทุษร้าย
(๒) เพื่อให้เกิดความปั่นป่วนหรือกระด้างกระเดื่องในหมู่ประชาชนถึงขนาดที่จะก่อความไม่สงบขึ้นในราชอาณาจักร หรือ
(๓) เพื่อให้ประชาชนล่วงละเมิดกฎหมายแผ่นดิน ต้องระวางโทษจำคุกไม่เกินเจ็ดปี
มาตรา ๑๑๗ ผู้ใดยุยงหรือจัดให้เกิดการร่วมกันหยุดงาน การร่วมกันปิดงานงดจ้าง หรือการร่วมกันไม่ยอมค้าขายหรือติดต่อทางธุรกิจกับบุคคลใด ๆ เพื่อให้เกิดการเปลี่ยนแปลงในกฎหมายแผ่นดิน เพื่อบังคับรัฐบาลหรือเพื่อข่มขู่ประชาชน ต้องระวางโทษจำคุกไม่เกินเจ็ดปี หรือปรับไม่เกินหนึ่งแสนสี่หมื่นบาท หรือทั้งจำทั้งปรับ
ผู้ใดทราบความมุ่งหมายดังกล่าวและเข้ามีส่วนหรือเข้าช่วยในการร่วมกันหยุดงาน การร่วมกันปิดงานงดจ้างหรือการร่วมกันไม่ยอมค้าขายหรือติดต่อทางธุรกิจกับบุคคลใด ๆ นั้น ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
ผู้ใดทราบความมุ่งหมายดังกล่าว และใช้กำลังประทุษร้าย ขู่เข็ญว่าจะใช้กำลังประทุษร้ายหรือทำให้หวาดกลัวด้วยประการใด ๆ เพื่อให้บุคคลเข้ามีส่วนหรือเข้าช่วยในการร่วมกันหยุดงาน การร่วมกันปิดงานงดจ้างหรือการร่วมกันไม่ยอมค้าขายหรือติดต่อทางธุรกิจกับบุคคลใด ๆ นั้น ต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๑๘ ผู้ใดกระทำการใด ๆ ต่อธงหรือเครื่องหมายอื่นใดอันมีความหมายถึงรัฐ เพื่อเหยียดหยามประเทศชาติ ต้องระวางโทษ จำคุกไม่เกินสองปี หรือปรับไม่เกินสี่หมื่นบาท หรือทั้งจำทั้งปรับ
หมวด ๓
ความผิดต่อความมั่นคงของรัฐภายนอกราชอาณาจักร
มาตรา ๑๑๙ ผู้ใดกระทำการใด ๆ เพื่อให้ราชอาณาจักรหรือส่วนหนึ่งส่วนใดของราชอาณาจักรตกไปอยู่ใต้อำนาจอธิปไตยของรัฐต่างประเทศ หรือเพื่อให้เอกราชของรัฐเสื่อมเสียไป ต้องระวางโทษประหารชีวิต หรือจำคุกตลอดชีวิต
มาตรา ๑๒๐ ผู้ใดคบคิดกับบุคคลซึ่งกระทำการเพื่อประโยชน์ของรัฐต่างประเทศ ด้วยความประสงค์ที่จะก่อให้เกิดการดำเนินการรบต่อรัฐหรือในทางอื่นที่เป็นปรปักษ์ต่อรัฐ ต้องระวางโทษจำคุกตลอดชีวิต หรือจำคุกตั้งแต่สิบปีถึงยี่สิบปี
มาตรา ๑๒๑ คนไทยคนใดกระทำการรบต่อประเทศหรือเข้าร่วมเป็นข้าศึกของประเทศ ต้องระวางโทษประหารชีวิต หรือจำคุกตลอดชีวิต
มาตรา ๑๒๒ ผู้ใดกระทำการใด ๆ เพื่ออุปการะแก่การดำเนินการรบหรือการตระเตรียมการรบของข้าศึก ต้องระวางโทษจำคุกตั้งแต่ห้าปีถึงสิบห้าปี
ถ้าการอุปการะนั้นเป็นการ
(๑) ทำให้ป้อม ค่าย สนามบิน ยานรบ ยานพาหนะ ทางคมนาคม สิ่งที่ใช้ในการสื่อสาร ยุทธภัณฑ์ เสบียงอาหาร อู่เรือ อาคาร หรือสิ่งอื่นใดสำหรับใช้เพื่อการสงครามใช้การไม่ได้หรือตกไปอยู่ในเงื้อมมือของข้าศึก
      (๒) ยุยงทหารให้ละเลยไม่กระทำการตามหน้าที่ ก่อการกำเริบ หนีราชการหรือละเมิดวินัย
(๓) กระทำจารกรรม นำหรือแนะทางให้ข้าศึก หรือ
(๔) กระทำโดยประการอื่นใดให้ข้าศึกได้เปรียบในการรบ
ผู้กระทำต้องระวางโทษประหารชีวิต หรือจำคุกตลอดชีวิต
มาตรา ๑๒๓ ผู้ใดกระทำการใด ๆ เพื่อให้ได้มาซึ่งข้อความ เอกสารหรือสิ่งใด ๆ อันปกปิดไว้เป็นความลับสำหรับความปลอดภัยของประเทศ ต้องระวางโทษจำคุกไม่เกินสิบปี
  มาตรา ๑๒๔ ผู้ใดกระทำการใด ๆ เพื่อให้ผู้อื่นล่วงรู้หรือได้ไปซึ่งข้อความ เอกสารหรือสิ่งใด ๆ อันปกปิดไว้เป็นความลับสำหรับความปลอดภัยของประเทศ ต้องระวางโทษจำคุกไม่เกินสิบปี
ถ้าความผิดนั้นได้กระทำในระหว่างประเทศอยู่ในการรบหรือการสงคราม ผู้กระทำต้องระวางโทษจำคุกตั้งแต่ห้าปีถึงสิบห้าปี
ถ้าความผิดดังกล่าวมาในสองวรรคก่อน ได้กระทำเพื่อให้รัฐต่างประเทศได้ประโยชน์ ผู้กระทำต้องระวางโทษประหารชีวิต หรือจำคุกตลอดชีวิต
มาตรา ๑๒๕ ผู้ใดปลอม ทำเทียมขึ้น กักไว้ ซ่อนเร้น ปิดบัง ยักย้าย ทำให้เสียหาย ทำลาย หรือทำให้สูญหายหรือไร้ประโยชน์ซึ่งเอกสารหรือแบบใด ๆ อันเกี่ยวกับส่วนได้เสียของรัฐในการระหว่างประเทศ ต้องระวางโทษจำคุกไม่เกินสิบปี
มาตรา ๑๒๖ ผู้ใดได้รับมอบหมายจากรัฐบาลให้กระทำกิจการของรัฐกับรัฐบาลต่างประเทศ ถ้าและโดยทุจริตไม่ปฏิบัติการตามที่ได้รับมอบหมาย ต้องระวางโทษจำคุกตั้งแต่หนึ่งปีถึงสิบปี
มาตรา ๑๒๗ ผู้ใดกระทำการใด ๆ เพื่อให้เกิดเหตุร้ายแก่ประเทศจากภายนอก ต้องระวางโทษจำคุกไม่เกินสิบปี
ถ้าเหตุร้ายเกิดขึ้น ผู้กระทำต้องระวางโทษประหารชีวิต หรือจำคุกตลอดชีวิต หรือจำคุกตั้งแต่สองปีถึงยี่สิบปี
มาตรา ๑๒๘ ผู้ใดตระเตรียมการ หรือพยายามกระทำความผิดใด ๆ ในหมวดนี้ ต้องระวางโทษตามที่บัญญัติไว้สำหรับความผิดนั้น
มาตรา ๑๒๙ ผู้ใดเป็นผู้สนับสนุนในการกระทำความผิดใด ๆ ในหมวดนี้ ต้องระวางโทษเช่นเดียวกับตัวการในความผิดนั้น
หมวด ๔
ความผิดต่อสัมพันธไมตรีกับต่างประเทศ
มาตรา ๑๓๐ ผู้ใดทำร้ายร่างกายหรือประทุษร้ายต่อเสรีภาพของราชาธิบดี ราชินี ราชสามี รัชทายาทหรือประมุขแห่งรัฐต่างประเทศ ซึ่งมีสัมพันธไมตรี ต้องระวางโทษจำคุกตั้งแต่หนึ่งปีถึงสิบห้าปี
ผู้ใดพยายามกระทำการเช่นว่านั้น ต้องระวางโทษเช่นเดียวกัน
มาตรา ๑๓๑ ผู้ใดทำร้ายร่างกาย หรือประทุษร้ายต่อเสรีภาพของผู้แทนรัฐต่างประเทศ ซึ่งได้รับแต่งตั้งให้มาสู่พระราชสำนัก ต้องระวางโทษจำคุกไม่เกินสิบปี
ผู้ใดพยายามกระทำการเช่นว่านั้น ต้องระวางโทษเช่นเดียวกัน
มาตรา ๑๓๒ ผู้ใดฆ่าหรือพยายามฆ่าบุคคลหนึ่งบุคคลใดดังระบุไว้ในมาตรา ๑๓๐ หรือมาตรา ๑๓๑ ต้องระวางโทษประหารชีวิตหรือจำคุกตลอดชีวิต
มาตรา ๑๓๓ ผู้ใดหมิ่นประมาท ดูหมิ่นหรือแสดงความอาฆาตมาดร้ายราชาธิบดี ราชินี ราชสามี รัชทายาท หรือประมุขแห่งรัฐต่างประเทศ ต้องระวางโทษ จำคุกตั้งแต่หนึ่งปีถึงเจ็ดปี หรือปรับตั้งแต่สองหมื่นบาทถึงหนึ่งแสนสี่หมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๓๔ ผู้ใดหมิ่นประมาท ดูหมิ่นหรือแสดงความอาฆาตมาดร้ายผู้แทนรัฐต่างประเทศซึ่งได้รับแต่งตั้งให้มาสู่พระราชสำนัก ต้องระวางโทษ จำคุกตั้งแต่หกเดือนถึงห้าปี หรือปรับตั้งแต่หนึ่งหมื่นบาทถึงหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๓๕ ผู้ใดกระทำการใด ๆ ต่อธงหรือเครื่องหมายอื่นใด อันมีความหมายถึงรัฐต่างประเทศซึ่งมีสัมพันธไมตรี เพื่อเหยียดหยามรัฐนั้น ต้องระวางโทษ จำคุกไม่เกินสองปี หรือปรับไม่เกินสี่หมื่นบาท หรือทั้งจำทั้งปรับ
ลักษณะ ๑/๑
ความผิดเกี่ยวกับการก่อการร้าย
มาตรา ๑๓๕/๑ ผู้ใดกระทำการอันเป็นความผิดอาญาดังต่อไปนี้
(๑) ใช้กำลังประทุษร้าย หรือกระทำการใดอันก่อให้เกิดอันตรายต่อชีวิต หรืออันตรายอย่างร้ายแรงต่อร่างกาย หรือเสรีภาพของบุคคลใด ๆ
(๒) กระทำการใดอันก่อให้เกิดความเสียหายอย่างร้ายแรงแก่ระบบการขนส่งสาธารณะ ระบบโทรคมนาคม หรือโครงสร้างพื้นฐานอันเป็นประโยชน์สาธารณะ
(๓) กระทำการใดอันก่อให้เกิดความเสียหายแก่ทรัพย์สินของรัฐหนึ่งรัฐใด หรือของบุคคลใดหรือต่อสิ่งแวดล้อม อันก่อให้เกิดหรือน่าจะก่อให้เกิดความเสียหายทางเศรษฐกิจอย่างสำคัญ
ถ้าการกระทำนั้นได้กระทำโดยมีความมุ่งหมายเพื่อขู่เข็ญหรือบังคับรัฐบาลไทย รัฐบาลต่างประเทศ หรือองค์การระหว่างประเทศ ให้กระทำหรือไม่กระทำการใดอันจะก่อให้เกิดความเสียหายอย่างร้ายแรง หรือเพื่อสร้างความปั่นป่วนโดยให้เกิดความหวาดกลัวในหมู่ประชาชน ผู้นั้นกระทำความผิดฐานก่อการร้าย ต้องระวางโทษประหารชีวิต จำคุกตลอดชีวิต หรือจำคุกตั้งแต่สามปีถึงยี่สิบปี และปรับตั้งแต่หกหมื่นบาทถึงหนึ่งล้านบาท
การกระทำในการเดินขบวน ชุมนุม ประท้วง โต้แย้ง หรือเคลื่อนไหวเพื่อเรียกร้องให้รัฐช่วยเหลือหรือให้ได้รับความเป็นธรรมอันเป็นการใช้เสรีภาพตามรัฐธรรมนูญ ไม่เป็นการกระทำความผิดฐานก่อการร้าย
มาตรา ๑๓๕/๒  ผู้ใด
(๑) ขู่เข็ญว่าจะกระทำการก่อการร้าย โดยมีพฤติการณ์อันควรเชื่อได้ว่าบุคคลนั้นจะกระทำการตามที่ขู่เข็ญจริง หรือ
(๒) สะสมกำลังพลหรืออาวุธ จัดหาหรือรวบรวมทรัพย์สิน ให้หรือรับการฝึกการก่อการร้าย ตระเตรียมการอื่นใด หรือสมคบกัน เพื่อก่อการร้าย หรือกระทำความผิดใด ๆ อันเป็นส่วนของแผนการเพื่อก่อการร้าย หรือยุยงประชาชนให้เข้ามีส่วนในการก่อการร้าย หรือรู้ว่ามีผู้จะก่อการร้ายแล้วกระทำการใดอันเป็นการช่วยปกปิดไว้ 
ผู้นั้นต้องระวางโทษจำคุกตั้งแต่สองปีถึงสิบปี และปรับตั้งแต่สี่หมื่นบาทถึงสองแสนบาท
มาตรา ๑๓๕/๓ ผู้ใดเป็นผู้สนับสนุนในการกระทำความผิดตามมาตรา ๑๓๕/๑ หรือมาตรา ๑๓๕/๒ ต้องระวางโทษเช่นเดียวกับตัวการในความผิดนั้น ๆ
มาตรา ๑๓๕/๔ ผู้ใดเป็นสมาชิกของคณะบุคคลซึ่งมีมติของหรือประกาศภายใต้คณะมนตรีความมั่นคงแห่งสหประชาชาติกำหนดให้เป็นคณะบุคคลที่มีการกระทำอันเป็นการก่อการร้ายและรัฐบาลไทยได้ประกาศให้ความรับรองมติหรือประกาศดังกล่าวด้วยแล้ว ผู้นั้นต้องระวางโทษจำคุกไม่เกินเจ็ดปีและปรับไม่เกินหนึ่งแสนสี่หมื่นบาท
ลักษณะ ๒
ความผิดเกี่ยวกับการปกครอง
หมวด ๑
ความผิดต่อเจ้าพนักงาน
มาตรา ๑๓๖ ผู้ใดดูหมิ่นเจ้าพนักงานซึ่งกระทำการตามหน้าที่ หรือเพราะได้กระทำการตามหน้าที่ ต้องระวางโทษ จำคุกไม่เกินหนึ่งปี หรือปรับไม่เกินสองหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๓๗ ผู้ใดแจ้งข้อความอันเป็นเท็จแก่เจ้าพนักงาน ซึ่งอาจทำให้ผู้อื่นหรือประชาชนเสียหาย ต้องระวางโทษจำคุกไม่เกินหกเดือน หรือปรับไม่เกินหนึ่งหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๓๘ ผู้ใดต่อสู้ หรือขัดขวางเจ้าพนักงานหรือผู้ซึ่งต้องช่วยเจ้าพนักงานตามกฎหมายในการปฏิบัติการตามหน้าที่ ต้องระวางโทษ จำคุกไม่เกินหนึ่งปี หรือปรับไม่เกินสองหมื่นบาท หรือทั้งจำทั้งปรับ
ถ้าการต่อสู้หรือขัดขวางนั้น ได้กระทำโดยใช้กำลังประทุษร้ายหรือขู่เข็ญว่าจะใช้กำลังประทุษร้าย ผู้กระทำต้องระวางโทษจำคุกไม่เกินสองปี หรือปรับไม่เกินสี่หมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๓๙ ผู้ใดข่มขืนใจเจ้าพนักงานให้ปฏิบัติการอันมิชอบด้วยหน้าที่ หรือให้ละเว้นการปฏิบัติการตามหน้าที่ โดยใช้กำลังประทุษร้าย หรือขู่เข็ญว่าจะใช้กำลังประทุษร้าย ต้องระวางโทษจำคุกไม่เกินสี่ปี หรือปรับไม่เกินแปดหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๔๐ ถ้าความผิดตามมาตรา ๑๓๘ วรรคสอง หรือมาตรา ๑๓๙ ได้กระทำโดยมีหรือใช้อาวุธ หรือโดยร่วมกระทำความผิดด้วยกันตั้งแต่สามคนขึ้นไป ผู้กระทำต้องระวางโทษ จำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
ถ้ากระทำโดยอ้างอำนาจอั้งยี่หรือซ่องโจร ไม่ว่าอั้งยี่หรือซ่องโจรนั้นจะมีอยู่หรือไม่ ผู้กระทำต้องระวางโทษจำคุกตั้งแต่สองปีถึงสิบปี และปรับตั้งแต่สี่หมื่นบาทถึงสองแสนบาท
ถ้าความผิดตามมาตรานี้ได้กระทำโดยมีหรือใช้อาวุธปืนหรือวัตถุระเบิด ผู้กระทำต้องระวางโทษหนักกว่าโทษที่กฎหมายบัญญัติไว้ในสองวรรคก่อนกึ่งหนึ่ง
มาตรา ๑๔๑ ผู้ใดถอน ทำให้เสียหาย ทำลายหรือทำให้ไร้ประโยชน์ซึ่งตราหรือเครื่องหมายอันเจ้าพนักงานได้ประทับหรือหมายไว้ที่สิ่งใด ๆ ในการปฏิบัติการตามหน้าที่เพื่อเป็นหลักฐานในการยึด อายัดหรือรักษาสิ่งนั้น ๆ ต้องระวางโทษจำคุกไม่เกินสองปี หรือปรับไม่เกินสี่หมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๔๒ ผู้ใดทำให้เสียหาย ทำลาย ซ่อนเร้น เอาไปเสีย หรือทำให้สูญหาย หรือไร้ประโยชน์ซึ่งทรัพย์สิน หรือเอกสารใด ๆ อันเจ้าพนักงานได้ยึด รักษาไว้ หรือสั่งให้ส่งเพื่อเป็นพยานหลักฐาน หรือเพื่อบังคับการให้เป็นไปตามกฎหมาย ไม่ว่าเจ้าพนักงานจะรักษาทรัพย์หรือเอกสารนั้นไว้เอง หรือสั่งให้ผู้นั้นหรือผู้อื่น ส่งหรือรักษาไว้ก็ตาม ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๔๓ ผู้ใดเรียก รับหรือยอมจะรับทรัพย์สินหรือประโยชน์อื่นใดสำหรับตนเองหรือผู้อื่น เป็นการตอบแทนในการที่จะจูงใจหรือได้จูงใจเจ้าพนักงาน สมาชิกสภานิติบัญญัติแห่งรัฐ สมาชิกสภาจังหวัดหรือสมาชิกสภาเทศบาลโดยวิธีอันทุจริตหรือผิดกฎหมายหรือโดยอิทธิพลของตนให้กระทำการ หรือไม่กระทำการในหน้าที่อันเป็นคุณหรือเป็นโทษแก่บุคคลใด ต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๔๔ ผู้ใดให้ ขอให้หรือรับว่าจะให้ทรัพย์สินหรือประโยชน์อื่นใดแก่เจ้าพนักงาน สมาชิกสภานิติบัญญัติแห่งรัฐ สมาชิกสภาจังหวัดหรือสมาชิกสภาเทศบาล เพื่อจูงใจให้กระทำการ ไม่กระทำการหรือประวิงการกระทำอันมิชอบด้วยหน้าที่ ต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๔๕ ผู้ใดแสดงตนเป็นเจ้าพนักงาน และกระทำการเป็นเจ้าพนักงาน โดยตนเองมิได้เป็นเจ้าพนักงานที่มีอำนาจกระทำการนั้น ต้องระวางโทษจำคุกไม่เกินหนึ่งปี หรือปรับไม่เกินสองหมื่นบาท หรือทั้งจำทั้งปรับ
เจ้าพนักงานผู้ใดได้รับคำสั่งมิให้ปฏิบัติการตามตำแหน่งหน้าที่ต่อไปแล้ว ยังฝ่าฝืนกระทำการใด ๆ ในตำแหน่งหน้าที่นั้น ต้องระวางโทษตามที่กำหนดไว้ในวรรคแรกดุจกัน
มาตรา ๑๔๖ ผู้ใดไม่มีสิทธิที่จะสวมเครื่องแบบหรือประดับเครื่องหมายของเจ้าพนักงาน สมาชิกสภานิติบัญญัติแห่งรัฐ สมาชิกสภาจังหวัดหรือสมาชิกสภาเทศบาล หรือไม่มีสิทธิใช้ยศ ตำแหน่ง เครื่องราชอิสริยาภรณ์หรือสิ่งที่หมายถึงเครื่องราชอิสริยาภรณ์ กระทำการเช่นนั้นเพื่อให้บุคคลอื่นเชื่อว่าตนมีสิทธิ ต้องระวางโทษจำคุกไม่เกินหนึ่งปี หรือปรับไม่เกินสองหมื่นบาท หรือทั้งจำทั้งปรับ
หมวด ๒
ความผิดต่อตำแหน่งหน้าที่ราชการ
มาตรา ๑๔๗ ผู้ใดเป็นเจ้าพนักงาน มีหน้าที่ซื้อ ทำ จัดการหรือรักษาทรัพย์ใด เบียดบังทรัพย์นั้นเป็นของตน หรือเป็นของผู้อื่นโดยทุจริต หรือโดยทุจริตยอมให้ผู้อื่นเอาทรัพย์นั้นเสีย ต้องระวางโทษ จำคุกตั้งแต่ห้าปีถึงยี่สิบปี หรือจำคุกตลอดชีวิต และปรับตั้งแต่หนึ่งแสนบาทถึงสี่แสนบาท
มาตรา ๑๔๘ ผู้ใดเป็นเจ้าพนักงาน ใช้อำนาจในตำแหน่งโดยมิชอบ ข่มขืนใจหรือจูงใจเพื่อให้บุคคลใดมอบให้หรือหามาให้ซึ่งทรัพย์สินหรือประโยชน์อื่นใดแก่ตนเองหรือผู้อื่น ต้องระวางโทษ จำคุกตั้งแต่ห้าปีถึงยี่สิบปี หรือจำคุกตลอดชีวิต และปรับตั้งแต่หนึ่งแสนบาทถึงสี่แสนบาท หรือประหารชีวิต
มาตรา ๑๔๙ ผู้ใดเป็นเจ้าพนักงานสมาชิกสภานิติบัญญัติแห่งรัฐ สมาชิกสภาจังหวัด หรือสมาชิกสภาเทศบาล เรียก รับ หรือยอมจะรับทรัพย์สิน หรือประโยชน์อื่นใดสำหรับตนเองหรือผู้อื่นโดยมิชอบ เพื่อกระทำการหรือไม่กระทำการอย่างใดในตำแหน่งไม่ว่าการนั้นจะชอบหรือมิชอบด้วยหน้าที่ ต้องระวางโทษ จำคุกตั้งแต่ห้าปีถึงยี่สิบปี หรือจำคุกตลอดชีวิต และปรับตั้งแต่หนึ่งแสนบาทถึงสี่แสนบาท หรือประหารชีวิต
มาตรา ๑๕๐ ผู้ใดเป็นเจ้าพนักงาน กระทำการหรือไม่กระทำการอย่างใดในตำแหน่งโดยเห็นแก่ทรัพย์สินหรือประโยชน์อื่นใด ซึ่งตนได้เรียก รับ หรือยอมจะรับไว้ก่อนที่ตนได้รับแต่งตั้งเป็นเจ้าพนักงานในตำแหน่งนั้น ต้องระวางโทษ จำคุกตั้งแต่ห้าปีถึงยี่สิบปี หรือจำคุกตลอดชีวิต และปรับตั้งแต่หนึ่งแสนบาทถึงสี่แสนบาท
มาตรา ๑๕๑ ผู้ใดเป็นเจ้าพนักงาน มีหน้าที่ซื้อ ทำ จัดการหรือรักษาทรัพย์ใด ๆ ใช้อำนาจในตำแหน่งโดยทุจริต อันเป็นการเสียหายแก่รัฐ เทศบาล สุขาภิบาลหรือเจ้าของทรัพย์นั้น ต้องระวางโทษ จำคุกตั้งแต่ห้าปีถึงยี่สิบปี หรือจำคุกตลอดชีวิต และปรับตั้งแต่หนึ่งแสนบาทถึงสี่แสนบาท
มาตรา ๑๕๒ ผู้ใดเป็นเจ้าพนักงาน มีหน้าที่จัดการหรือดูแลกิจการใด เข้ามีส่วนได้เสียเพื่อประโยชน์สำหรับตนเองหรือผู้อื่นเนื่องด้วยกิจการนั้น ต้องระวางโทษ จำคุกตั้งแต่หนึ่งปีถึงสิบปี และปรับตั้งแต่สองหมื่นบาทถึงสองแสนบาท
มาตรา ๑๕๓ ผู้ใดเป็นเจ้าพนักงาน มีหน้าที่จ่ายทรัพย์ จ่ายทรัพย์นั้นเกินกว่าที่ควรจ่ายเพื่อประโยชน์สำหรับตนเองหรือผู้อื่น ต้องระวางโทษ จำคุกตั้งแต่หนึ่งปีถึงสิบปี และปรับตั้งแต่สองหมื่นบาทถึงสองแสนบาท
มาตรา ๑๕๔ ผู้ใดเป็นเจ้าพนักงาน มีหน้าที่หรือแสดงว่าตนมีหน้าที่เรียกเก็บหรือตรวจสอบภาษีอากร ค่าธรรมเนียมหรือเงินอื่นใด โดยทุจริตเรียกเก็บหรือละเว้นไม่เรียกเก็บภาษีอากร ค่าธรรมเนียมหรือเงินนั้น หรือกระทำการหรือไม่กระทำการอย่างใด เพื่อให้ผู้มีหน้าที่เสียภาษีอากรหรือค่าธรรมเนียมนั้นมิต้องเสีย หรือเสียน้อยไปกว่าที่จะต้องเสีย ต้องระวางโทษ จำคุกตั้งแต่ห้าปีถึงยี่สิบปี หรือจำคุกตลอดชีวิต และปรับตั้งแต่หนึ่งแสนบาทถึงสี่แสนบาท
มาตรา ๑๕๕ ผู้ใดเป็นเจ้าพนักงาน มีหน้าที่กำหนดราคาทรัพย์สินหรือสินค้าใด ๆ เพื่อเรียกเก็บภาษีอากรหรือค่าธรรมเนียมตามกฎหมาย โดยทุจริตกำหนดราคาทรัพย์สินหรือสินค้านั้น เพื่อให้ผู้มีหน้าที่เสียภาษีอากรหรือค่าธรรมเนียมนั้นมิต้องเสียหรือเสียน้อยไปกว่าที่จะต้องเสีย ต้องระวางโทษ จำคุกตั้งแต่ห้าปีถึงยี่สิบปี หรือจำคุกตลอดชีวิต และปรับตั้งแต่หนึ่งแสนบาทถึงสี่แสนบาท
มาตรา ๑๕๖ ผู้ใดเป็นเจ้าพนักงาน มีหน้าที่ตรวจสอบบัญชีตามกฎหมาย โดยทุจริต แนะนำ หรือกระทำการหรือไม่กระทำการอย่างใด เพื่อให้มีการละเว้นการลงรายการในบัญชีลงรายการเท็จในบัญชี แก้ไขบัญชี หรือซ่อนเร้น หรือทำหลักฐานในการลงบัญชีอันจะเป็นผลให้การเสียภาษีอากรหรือค่าธรรมเนียมนั้นมิต้องเสีย หรือเสียน้อยกว่าที่จะต้องเสีย ต้องระวางโทษ จำคุกตั้งแต่ห้าปีถึงยี่สิบปี หรือจำคุกตลอดชีวิต และปรับตั้งแต่หนึ่งแสนบาทถึงสี่แสนบาท
มาตรา ๑๕๗ ผู้ใดเป็นเจ้าพนักงาน ปฏิบัติหรือละเว้นการปฏิบัติหน้าที่โดยมิชอบ เพื่อให้เกิดความเสียหายแก่ผู้หนึ่งผู้ใด หรือปฏิบัติหรือละเว้นการปฏิบัติหน้าที่โดยทุจริต ต้องระวางโทษ จำคุกตั้งแต่หนึ่งปีถึงสิบปี หรือปรับตั้งแต่สองหมื่นบาทถึงสองแสนบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๕๘ ผู้ใดเป็นเจ้าพนักงาน ทำให้เสียหาย ทำลาย ซ่อนเร้น เอาไปเสีย หรือทำให้สูญหายหรือทำให้ไร้ประโยชน์ ซึ่งทรัพย์หรือเอกสารใดอันเป็นหน้าที่ของตนที่จะปกครองหรือรักษาไว้ หรือยินยอมให้ผู้อื่นกระทำเช่นนั้น ต้องระวางโทษจำคุกไม่เกินเจ็ดปี และปรับไม่เกินหนึ่งแสนสี่หมื่นบาท
มาตรา ๑๕๙ ผู้ใดเป็นเจ้าพนักงาน มีหน้าที่ดูแล รักษาทรัพย์หรือเอกสารใด กระทำการอันมิชอบด้วยหน้าที่ โดยถอน ทำให้เสียหาย ทำลายหรือทำให้ไร้ประโยชน์ หรือโดยยินยอมให้ผู้อื่นกระทำเช่นนั้น ซึ่งตราหรือเครื่องหมายอันเจ้าพนักงานได้ประทับหรือหมายไว้ที่ทรัพย์หรือเอกสารนั้นในการปฏิบัติการตามหน้าที่ เพื่อเป็นหลักฐานในการยึดหรือรักษาสิ่งนั้น ต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๖๐ ผู้ใดเป็นเจ้าพนักงาน มีหน้าที่รักษาหรือใช้ดวงตราหรือรอยตราของราชการหรือของผู้อื่น กระทำการอันมิชอบด้วยหน้าที่ โดยใช้ดวงตราหรือรอยตรานั้น หรือโดยยินยอมให้ผู้อื่นกระทำเช่นนั้น ซึ่งอาจทำให้ผู้อื่นหรือประชาชนเสียหาย ต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๖๑ ผู้ใดเป็นเจ้าพนักงาน มีหน้าที่ทำเอกสาร กรอกข้อความลงในเอกสารหรือดูแลรักษาเอกสาร กระทำการปลอมเอกสารโดยอาศัยโอกาสที่ตนมีหน้าที่นั้น ต้องระวางโทษจำคุกไม่เกินสิบปี และปรับไม่เกินสองแสนบาท
มาตรา ๑๖๒ ผู้ใดเป็นเจ้าพนักงาน มีหน้าที่ทำเอกสาร รับเอกสารหรือกรอกข้อความลงในเอกสาร กระทำการดังต่อไปนี้ในการปฏิบัติการตามหน้าที่
(๑) รับรองเป็นหลักฐานว่า ตนได้กระทำการอย่างใดขึ้น หรือว่าการอย่างใดได้กระทำต่อหน้าตนอันเป็นความเท็จ
(๒) รับรองเป็นหลักฐานว่า ได้มีการแจ้งซึ่งข้อความอันมิได้มีการแจ้ง
(๓) ละเว้นไม่จดข้อความซึ่งตนมีหน้าที่ต้องรับจดหรือจดเปลี่ยนแปลงข้อความเช่นว่านั้น หรือ
       (๔) รับรองเป็นหลักฐานซึ่งข้อเท็จจริงอันเอกสารนั้นมุ่งพิสูจน์ความจริงอันเป็นความเท็จ
ต้องระวางโทษจำคุกไม่เกินเจ็ดปี และปรับไม่เกินหนึ่งแสนสี่หมื่นบาท
มาตรา ๑๖๓ ผู้ใดเป็นเจ้าพนักงาน มีหน้าที่ในการไปรษณีย์ โทรเลขหรือโทรศัพท์ กระทำการอันมิชอบด้วยหน้าที่ดังต่อไปนี้
(๑) เปิด หรือยอมให้ผู้อื่นเปิด จดหมายหรือสิ่งอื่นที่ส่งทางไปรษณีย์หรือโทรเลข
(๒) ทำให้เสียหาย ทำลาย ทำให้สูญหาย หรือยอมให้ผู้อื่นทำให้เสียหาย ทำลายหรือทำให้สูญหาย ซึ่งจดหมายหรือสิ่งอื่นที่ส่งทางไปรษณีย์หรือโทรเลข
(๓) กัก ส่งให้ผิดทาง หรือส่งให้แก่บุคคลซึ่งรู้ว่ามิใช่เป็นผู้ควรรับซึ่งจดหมายหรือสิ่งอื่นที่ส่งทางไปรษณีย์หรือโทรเลข หรือ
(๔) เปิดเผยข้อความที่ส่งทางไปรษณีย์ ทางโทรเลข หรือทางโทรศัพท์
ต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๖๔ ผู้ใดเป็นเจ้าพนักงาน รู้หรืออาจรู้ความลับในราชการ กระทำโดยประการใด ๆ อันมิชอบด้วยหน้าที่ให้ผู้อื่นล่วงรู้ความลับนั้น ต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๖๕ ผู้ใดเป็นเจ้าพนักงาน มีหน้าที่ปฏิบัติการให้เป็นไปตามกฎหมายหรือคำสั่งซึ่งได้สั่งเพื่อบังคับการให้เป็นไปตามกฎหมาย ป้องกันหรือขัดขวางมิให้การเป็นไปตามกฎหมายหรือคำสั่งนั้น ต้องระวางโทษจำคุกไม่เกินหนึ่งปี หรือปรับไม่เกินสองหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๖๖ ผู้ใดเป็นเจ้าพนักงาน ละทิ้งงานหรือกระทำการอย่างใด ๆ เพื่อให้งานหยุดชะงักหรือเสียหาย โดยร่วมกระทำการเช่นนั้นด้วยกันตั้งแต่ห้าคนขึ้นไป ต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
ถ้าความผิดนั้นได้กระทำลงเพื่อให้เกิดการเปลี่ยนแปลงในกฎหมายแผ่นดิน เพื่อบังคับรัฐบาลหรือเพื่อข่มขู่ประชาชน ผู้กระทำต้องระวางโทษจำคุกไม่เกินสิบปี และปรับไม่เกินสองแสนบาท
ลักษณะ ๓
ความผิดเกี่ยวกับการยุติธรรม
หมวด ๑
ความผิดต่อเจ้าพนักงานในการยุติธรรม
มาตรา ๑๖๗ ผู้ใดให้ ขอให้หรือรับว่าจะให้ทรัพย์สินหรือประโยชน์อื่นใด แก่เจ้าพนักงานในตำแหน่งตุลาการ พนักงานอัยการ ผู้ว่าคดีหรือพนักงานสอบสวน เพื่อจูงใจให้กระทำการ ไม่กระทำการหรือประวิงการกระทำใดอันมิชอบด้วยหน้าที่ ต้องระวางโทษจำคุกไม่เกินเจ็ดปี และปรับไม่เกินหนึ่งแสนสี่หมื่นบาท
มาตรา ๑๖๘ ผู้ใดขัดขืนคำบังคับตามกฎหมายของพนักงานอัยการ ผู้ว่าคดีหรือพนักงานสอบสวน ซึ่งให้มาเพื่อให้ถ้อยคำ ต้องระวางโทษจำคุกไม่เกินสามเดือน หรือปรับไม่เกินห้าพันบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๖๙ ผู้ใดขัดขืนคำบังคับตามกฎหมายของพนักงานอัยการ ผู้ว่าคดีหรือพนักงานสอบสวน ซึ่งให้ส่งหรือจัดการส่งทรัพย์สินหรือเอกสารใด ให้สาบาน ให้ปฏิญาณหรือให้ให้ถ้อยคำ ต้องระวางโทษจำคุกไม่เกินสามเดือน หรือปรับไม่เกินห้าพันบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๗๐ ผู้ใดขัดขืนหมายหรือคำสั่งของศาลให้มาให้ถ้อยคำ ให้มาเบิกความหรือให้ส่งทรัพย์หรือเอกสารใดในการพิจารณาคดี ต้องระวางโทษจำคุกไม่เกินหกเดือน หรือปรับไม่เกินหนึ่งหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๗๑ ผู้ใดขัดขืนคำสั่งของศาลให้สาบาน ปฏิญาณ ให้ถ้อยคำหรือเบิกความ ต้องระวางโทษจำคุกไม่เกินหกเดือน หรือปรับไม่เกินหนึ่งหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๗๒ ผู้ใดแจ้งข้อความอันเป็นเท็จเกี่ยวกับความผิดอาญา แก่พนักงานอัยการ ผู้ว่าคดี พนักงานสอบสวน หรือเจ้าพนักงานผู้มีอำนาจสืบสวนคดีอาญา ซึ่งอาจทำให้ผู้อื่นหรือประชาชนเสียหาย ต้องระวางโทษจำคุกไม่เกินสองปี หรือปรับไม่เกินสี่หมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๗๓ ผู้ใดรู้ว่ามิได้มีการกระทำความผิดเกิดขึ้นแจ้งข้อความแก่พนักงานสอบสวนหรือเจ้าพนักงานผู้มีอำนาจสืบสวนคดีอาญาว่า ได้มีการกระทำความผิด ต้องระวางโทษจำคุกไม่เกินสามปี และปรับไม่เกินหกหมื่นบาท
มาตรา ๑๗๔ ถ้าการแจ้งข้อความตามมาตรา ๑๗๒ หรือมาตรา ๑๗๓ เป็นการเพื่อจะแกล้งให้บุคคลใดต้องถูกบังคับตามวิธีการเพื่อความปลอดภัย ผู้กระทำต้องระวางโทษจำคุกไม่เกินสามปี และปรับไม่เกินหกหมื่นบาท
ถ้าการแจ้งตามความในวรรคแรกเป็นการเพื่อจะแกล้งให้บุคคลใดต้องรับโทษหรือรับโทษหนักขึ้น ผู้กระทำต้องระวางโทษจำคุกไม่เกินห้าปี และปรับไม่เกินหนึ่งแสนบาท
มาตรา ๑๗๕ ผู้ใดเอาความอันเป็นเท็จฟ้องผู้อื่นต่อศาลว่ากระทำความผิดอาญา หรือว่ากระทำความผิดอาญาแรงกว่าที่เป็นความจริง ต้องระวางโทษจำคุกไม่เกินห้าปี และปรับไม่เกินหนึ่งแสนบาท
มาตรา ๑๗๖ ผู้ใดกระทำความผิดตามมาตรา ๑๗๕ แล้วลุแก่โทษต่อศาล และขอถอนฟ้องหรือแก้ฟ้องก่อนมีคำพิพากษา ให้ศาลลงโทษน้อยกว่าที่กฎหมายกำหนดไว้หรือศาลจะไม่ลงโทษเลยก็ได้
มาตรา ๑๗๗ ผู้ใดเบิกความอันเป็นเท็จในการพิจารณาคดีต่อศาล ถ้าความเท็จนั้นเป็นข้อสำคัญในคดี ต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
ถ้าความผิดดังกล่าวในวรรคแรก ได้กระทำในการพิจารณาคดีอาญา ผู้กระทำต้องระวางโทษจำคุกไม่เกินเจ็ดปี และปรับไม่เกินหนึ่งแสนสี่หมื่นบาท
มาตรา ๑๗๘ ผู้ใดซึ่งเจ้าพนักงานในตำแหน่งตุลาการ พนักงานอัยการ ผู้ว่าคดีหรือพนักงานสอบสวน ให้แปลข้อความหรือความหมายใด แปลข้อความหรือความหมายนั้นให้ผิดไปในข้อสำคัญ ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๗๙ ผู้ใดทำพยานหลักฐานอันเป็นเท็จ เพื่อให้พนักงานสอบสวนหรือเจ้าพนักงานผู้มีอำนาจสืบสวนคดีอาญาเชื่อว่าได้มีความผิดอาญาอย่างใดเกิดขึ้น หรือเชื่อว่าความผิดอาญาที่เกิดขึ้นร้ายแรงกว่าที่เป็นความจริง ต้องระวางโทษจำคุกไม่เกินสองปี หรือปรับไม่เกินสี่หมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๘๐ ผู้ใดนำสืบหรือแสดงพยานหลักฐานอันเป็นเท็จในการพิจารณาคดี ถ้าเป็นพยานหลักฐานในข้อสำคัญในคดีนั้น ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
ถ้าความผิดดังกล่าวในวรรคแรก ได้กระทำในการพิจารณาคดีอาญา ผู้กระทำต้องระวางโทษจำคุกไม่เกินเจ็ดปี และปรับไม่เกินหนึ่งแสนสี่หมื่นบาท
มาตรา ๑๘๑ ถ้าการกระทำความผิดตามมาตรา ๑๗๔ มาตรา ๑๗๕ มาตรา ๑๗๗ มาตรา ๑๗๘ หรือมาตรา ๑๘๐
(๑) เป็นการกระทำในกรณีแห่งข้อหาว่า ผู้ใดกระทำความผิดที่มีระวางโทษจำคุกตั้งแต่สามปีขึ้นไป ผู้กระทำต้องระวางโทษจำคุกตั้งแต่หกเดือนถึงเจ็ดปี และปรับตั้งแต่หนึ่งหมื่นบาทถึงหนึ่งแสนสี่หมื่นบาท
(๒) เป็นการกระทำในกรณีแห่งข้อหาว่า ผู้ใดกระทำความผิดที่มีระวางโทษถึงประหารชีวิต หรือจำคุกตลอดชีวิต ผู้กระทำต้องระวางโทษจำคุกตั้งแต่หนึ่งปีถึงสิบห้าปี และปรับตั้งแต่สองหมื่นบาทถึงสามแสนบาท
มาตรา ๑๘๒ ผู้ใดกระทำความผิดตามมาตรา ๑๗๗ หรือมาตรา ๑๗๘ แล้วลุแก่โทษ และกลับแจ้งความจริงต่อศาลหรือเจ้าพนักงานก่อนจบคำเบิกความหรือการแปล ผู้นั้นไม่ต้องรับโทษ
มาตรา ๑๘๓ ผู้ใดกระทำความผิดตามมาตรา ๑๗๗ มาตรา ๑๗๘ หรือมาตรา ๑๘๐ แล้วลุแก่โทษ และกลับแจ้งความจริงต่อศาลหรือเจ้าพนักงานก่อนมีคำพิพากษา และก่อนตนถูกฟ้องในความผิดที่ได้กระทำ ศาลจะลงโทษน้อยกว่าที่กฎหมายกำหนดไว้สำหรับความผิดนั้นเพียงใดก็ได้
มาตรา ๑๘๔ ผู้ใดเพื่อจะช่วยผู้อื่นมิให้ต้องรับโทษหรือให้รับโทษน้อยลง ทำให้เสียหาย ทำลาย ซ่อนเร้น เอาไปเสีย หรือทำให้สูญหายหรือไร้ประโยชน์ซึ่งพยานหลักฐานในการกระทำความผิด ต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๘๕ ผู้ใดทำให้เสียหาย ทำลาย ซ่อนเร้น เอาไปเสีย หรือทำให้สูญหายหรือไร้ประโยชน์ ซึ่งทรัพย์หรือเอกสารใดที่ได้ส่งไว้ต่อศาล หรือที่ศาลให้รักษาไว้ในการพิจารณาคดี ต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๘๖ ผู้ใดทำให้เสียหาย ทำลาย ซ่อนเร้น เอาไปเสีย หรือทำให้สูญหายหรือไร้ประโยชน์ ซึ่งทรัพย์สินที่ได้มีคำพิพากษาให้ริบ ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๘๗ ผู้ใดเพื่อจะมิให้การเป็นไปตามคำพิพากษาหรือคำสั่งของศาล ทำให้เสียหาย ทำลาย ซ่อนเร้น เอาไปเสีย หรือทำให้สูญหายหรือไร้ประโยชน์ ซึ่งทรัพย์ที่ถูกยึดหรืออายัด หรือที่ตนรู้ว่าน่าจะถูกยึดหรืออายัด ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๘๘ ผู้ใดทำให้เสียหาย ทำลาย ซ่อนเร้น เอาไปเสีย หรือทำให้สูญหายหรือไร้ประโยชน์ ซึ่งพินัยกรรมหรือเอกสารใดของผู้อื่น ในประการที่น่าจะเกิดความเสียหายแก่ผู้อื่นหรือประชาชน ต้องระวางโทษจำคุกไม่เกินห้าปี และปรับไม่เกินหนึ่งแสนบาท
มาตรา ๑๘๙ ผู้ใดช่วยผู้อื่นซึ่งเป็นผู้กระทำความผิดหรือเป็นผู้ต้องหาว่ากระทำความผิด อันมิใช่ความผิดลหุโทษเพื่อไม่ให้ต้องโทษ โดยให้พำนักแก่ผู้นั้น โดยซ่อนเร้นหรือโดยช่วยผู้นั้นด้วยประการใดเพื่อไม่ให้ถูกจับกุม ต้องระวางโทษจำคุกไม่เกินสองปี หรือปรับไม่เกินสี่หมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๙๐ ผู้ใดหลบหนีไประหว่างที่ถูกคุมขังตามอำนาจของศาล ของพนักงานอัยการ ของพนักงานสอบสวน หรือของเจ้าพนักงานผู้มีอำนาจสืบสวนคดีอาญา ต้องระวางโทษ จำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
ถ้าความผิดดังกล่าวมาในวรรคแรกได้กระทำโดยแหกที่คุมขัง โดยใช้กำลังประทุษร้ายหรือโดยขู่เข็ญว่าจะใช้กำลังประทุษร้าย หรือโดยร่วมกระทำความผิดด้วยกันตั้งแต่สามคนขึ้นไป ผู้กระทำต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
ถ้าความผิดตามมาตรานี้ได้กระทำโดยมีหรือใช้อาวุธปืนหรือวัตถุระเบิด ผู้กระทำต้องระวางโทษหนักกว่าโทษที่กฎหมายบัญญัติไว้ในสองวรรคก่อนกึ่งหนึ่ง
มาตรา ๑๙๑ ผู้ใดกระทำด้วยประการใดให้ผู้ที่ถูกคุมขังตามอำนาจของศาล ของพนักงานอัยการ ของพนักงานสอบสวน หรือของเจ้าพนักงานผู้มีอำนาจสืบสวนคดีอาญา หลุดพ้นจากการคุมขังไป ต้องระวางโทษ จำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
ถ้าผู้ที่หลุดพ้นจากการคุมขังไปนั้นเป็นบุคคลที่ต้องคำพิพากษาจากศาลหนึ่งศาลใดให้ลงโทษประหารชีวิต จำคุกตลอดชีวิต หรือจำคุกตั้งแต่สิบห้าปีขึ้นไป หรือมีจำนวนตั้งแต่สามคนขึ้นไป ผู้กระทำต้องระวางโทษจำคุกตั้งแต่หกเดือนถึงเจ็ดปี และปรับตั้งแต่หนึ่งหมื่นบาทถึงหนึ่งแสนสี่หมื่นบาท
ถ้าความผิดตามมาตรานี้ได้กระทำโดยใช้กำลังประทุษร้าย หรือโดยขู่เข็ญว่าจะใช้กำลังประทุษร้าย หรือโดยมีหรือใช้อาวุธปืนหรือวัตถุระเบิด ผู้กระทำต้องระวางโทษหนักกว่าโทษที่กฎหมายบัญญัติไว้ในสองวรรคก่อนกึ่งหนึ่ง
มาตรา ๑๙๒ ผู้ใดให้พำนัก ซ่อนเร้นหรือช่วยด้วยประการใด ให้ผู้ที่หลบหนีจากการคุมขัง ตามอำนาจของศาล ของพนักงานสอบสวนหรือของเจ้าพนักงานผู้มีอำนาจสืบสวนคดีอาญา เพื่อไม่ให้ถูกจับกุม ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๙๓ ถ้าการกระทำความผิดดังกล่าวมาในมาตรา ๑๘๔ มาตรา ๑๘๙ หรือมาตรา ๑๙๒ เป็นการกระทำเพื่อช่วยบิดา มารดา บุตร สามีหรือภริยาของผู้กระทำ ศาลจะไม่ลงโทษก็ได้
มาตรา ๑๙๔ ผู้ใดต้องคำพิพากษาห้ามเข้าเขตกำหนดตามมาตรา ๔๕ เข้าไปในเขตกำหนดนั้น ต้องระวางโทษจำคุกไม่เกินหนึ่งปี หรือปรับไม่เกินสองหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๙๕ ผู้ใดหลบหนีจากสถานพยาบาลซึ่งศาลสั่งให้คุมตัวไว้ตามความในมาตรา ๔๙ ต้องระวางโทษจำคุกไม่เกินหกเดือน หรือปรับไม่เกินหนึ่งหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๙๖ ผู้ใดฝ่าฝืนคำสั่งห้ามของศาลซึ่งได้สั่งไว้ในคำพิพากษาตามมาตรา ๕๐ ต้องระวางโทษจำคุกไม่เกินหกเดือน หรือปรับไม่เกินหนึ่งหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๙๗ ผู้ใดใช้กำลังประทุษร้าย ขู่เข็ญว่าจะใช้กำลังประทุษร้าย ให้ประโยชน์หรือรับว่าจะให้ประโยชน์ เพื่อกีดกันหรือขัดขวางการขายทอดตลาดของเจ้าพนักงานเนื่องจากคำพิพากษาหรือคำสั่งของศาล ต้องระวางโทษจำคุกไม่เกินหกเดือน หรือปรับไม่เกินหนึ่งหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๙๘ ผู้ใดดูหมิ่นศาลหรือผู้พิพากษาในการพิจารณาหรือพิพากษาคดี หรือกระทำการขัดขวางการพิจารณาหรือพิพากษาของศาล ต้องระวางโทษ จำคุกตั้งแต่หนึ่งปีถึงเจ็ดปี หรือปรับตั้งแต่สองหมื่นบาทถึงหนึ่งแสนสี่หมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๑๙๙ ผู้ใดลอบฝัง ซ่อนเร้น ย้ายหรือทำลายศพหรือส่วนของศพเพื่อปิดบังการเกิด การตายหรือเหตุแห่งการตาย ต้องระวางโทษจำคุกไม่เกินหนึ่งปี หรือปรับไม่เกินสองหมื่นบาท หรือทั้งจำทั้งปรับ
หมวด ๒
ความผิดต่อตำแหน่งหน้าที่ในการยุติธรรม
มาตรา ๒๐๐ ผู้ใดเป็นเจ้าพนักงานในตำแหน่งพนักงานอัยการ ผู้ว่าคดี พนักงานสอบสวนหรือเจ้าพนักงานผู้มีอำนาจสืบสวนคดีอาญาหรือจัดการให้เป็นไปตามหมายอาญา กระทำการหรือไม่กระทำการอย่างใด ๆ ในตำแหน่งอันเป็นการมิชอบเพื่อจะช่วยบุคคลหนึ่งบุคคลใดมิให้ต้องโทษหรือให้รับโทษน้อยลง ต้องระวางโทษจำคุกตั้งแต่หกเดือนถึงเจ็ดปี และปรับตั้งแต่หนึ่งหมื่นบาทถึงหนึ่งแสนสี่หมื่นบาท
ถ้าการกระทำหรือไม่กระทำนั้นเป็นการเพื่อจะแกล้งให้บุคคลหนึ่งบุคคลใดต้องรับโทษ รับโทษหนักขึ้น หรือต้องถูกบังคับตามวิธีการเพื่อความปลอดภัย ผู้กระทำต้องระวางโทษจำคุกตลอดชีวิต หรือจำคุกตั้งแต่หนึ่งปีถึงยี่สิบปี และปรับตั้งแต่สองหมื่นบาทถึงสี่แสนบาท
มาตรา ๒๐๑ ผู้ใดเป็นเจ้าพนักงานในตำแหน่งตุลาการ พนักงานอัยการ ผู้ว่าคดี หรือพนักงานสอบสวน เรียก รับ หรือยอมจะรับทรัพย์สินหรือประโยชน์อื่นใดสำหรับตนเองหรือผู้อื่นโดยมิชอบเพื่อกระทำการหรือไม่กระทำการอย่างใดในตำแหน่ง ไม่ว่าการนั้นจะชอบหรือมิชอบด้วยหน้าที่ ต้องระวางโทษ จำคุกตั้งแต่ห้าปีถึงยี่สิบปี หรือจำคุกตลอดชีวิต และปรับตั้งแต่หนึ่งแสนบาทถึงสี่แสนบาท หรือประหารชีวิต
มาตรา ๒๐๒ ผู้ใดเป็นเจ้าพนักงานในตำแหน่งตุลาการ พนักงานอัยการ ผู้ว่าคดี หรือพนักงานสอบสวน กระทำการหรือไม่กระทำการอย่างใด ๆ ในตำแหน่ง โดยเห็นแก่ทรัพย์สินหรือประโยชน์อื่นใด ซึ่งตนได้เรียก รับ หรือยอมจะรับไว้ก่อนที่ตนได้รับแต่งตั้งในตำแหน่งนั้น ต้องระวางโทษ จำคุกตั้งแต่ห้าปีถึงยี่สิบปี หรือจำคุกตลอดชีวิต และปรับตั้งแต่หนึ่งแสนบาทถึงสี่แสนบาท หรือประหารชีวิต
มาตรา ๒๐๓ ผู้ใดเป็นเจ้าพนักงาน มีหน้าที่ปฏิบัติการให้เป็นไปตามคำพิพากษาหรือคำสั่งของศาล ป้องกันหรือขัดขวางมิให้การเป็นไปตามคำพิพากษาหรือคำสั่งนั้น ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๒๐๔ ผู้ใดเป็นเจ้าพนักงาน มีตำแหน่งหน้าที่ควบคุมดูแลผู้ที่ต้องคุมขังตามอำนาจของศาล ของพนักงานสอบสวนหรือของเจ้าพนักงานผู้มีอำนาจสืบสวนคดีอาญากระทำด้วยประการใด ๆ ให้ผู้ที่อยู่ในระหว่างคุมขังนั้นหลุดพ้นจากการคุมขังไป ต้องระวางโทษจำคุกตั้งแต่หนึ่งปีถึงเจ็ดปี และปรับตั้งแต่สองหมื่นบาทถึงหนึ่งแสนสี่หมื่นบาท
ถ้าผู้ที่หลุดพ้นจากการคุมขังไปนั้นเป็นบุคคลที่ต้องคำพิพากษาของศาลหนึ่งศาลใดให้ลงโทษประหารชีวิต จำคุกตลอดชีวิตหรือจำคุกตั้งแต่สิบห้าปีขึ้นไป หรือมีจำนวนตั้งแต่สามคนขึ้นไป ผู้กระทำต้องระวางโทษจำคุกตั้งแต่สองปีถึงสิบปี และปรับตั้งแต่สี่หมื่นบาทถึงสองแสนบาท
มาตรา ๒๐๕ ถ้าการกระทำดังกล่าวในมาตรา ๒๐๔ เป็นการกระทำโดยประมาท ผู้กระทำต้องระวางโทษจำคุกไม่เกินสองปี หรือปรับไม่เกินสี่หมื่นบาท หรือทั้งจำทั้งปรับ
ถ้าผู้ที่หลุดพ้นจากการคุมขังไปด้วยการกระทำโดยประมาทนั้นเป็นบุคคลที่ต้องคำพิพากษาของศาลหนึ่งศาลใดให้ลงโทษประหารชีวิต จำคุกตลอดชีวิตหรือจำคุกตั้งแต่สิบห้าปีขึ้นไป หรือมีจำนวนตั้งแต่สามคนขึ้นไป ผู้กระทำต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
ถ้าผู้กระทำความผิดจัดให้ได้ตัวผู้ที่หลุดพ้นจากการคุมขังคืนมาภายในสามเดือน ให้งดการลงโทษแก่ผู้กระทำความผิดนั้น
ลักษณะ ๔
ความผิดเกี่ยวกับศาสนา
มาตรา ๒๐๖ ผู้ใดกระทำด้วยประการใด ๆ แก่วัตถุหรือสถานอันเป็นที่เคารพในทางศาสนาของหมู่ชนใด อันเป็นการเหยียดหยามศาสนานั้น ต้องระวางโทษ จำคุกตั้งแต่หนึ่งปีถึงเจ็ดปี หรือปรับตั้งแต่สองหมื่นบาทถึงหนึ่งแสนสี่หมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๒๐๗ ผู้ใดก่อให้เกิดการวุ่นวายขึ้นในที่ประชุมศาสนิกชนเวลาประชุมกัน นมัสการหรือกระทำพิธีกรรมตามศาสนาใด ๆ โดยชอบด้วยกฎหมาย ต้องระวางโทษจำคุกไม่เกินหนึ่งปี หรือปรับไม่เกินสองหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๒๐๘ ผู้ใดแต่งกายหรือใช้เครื่องหมายที่แสดงว่าเป็นภิกษุ สามเณร นักพรตหรือนักบวชในศาสนาใดโดยมิชอบ เพื่อให้บุคคลอื่นเชื่อว่า ตนเป็นบุคคลเช่นว่านั้น ต้องระวางโทษจำคุกไม่เกินหนึ่งปี หรือปรับไม่เกินสองหมื่นบาท หรือทั้งจำทั้งปรับ
ลักษณะ ๕
ความผิดเกี่ยวกับความสงบสุขของประชาชน
มาตรา ๒๐๙ ผู้ใดเป็นสมาชิกของคณะบุคคลซึ่งปกปิดวิธีดำเนินการและมีความมุ่งหมายเพื่อการอันมิชอบด้วยกฎหมาย ผู้นั้นกระทำความผิดฐานเป็นอั้งยี่ ต้องระวางโทษจำคุกไม่เกินเจ็ดปี และปรับไม่เกินหนึ่งแสนสี่หมื่นบาท
ถ้าผู้กระทำความผิดเป็นหัวหน้า ผู้จัดการหรือผู้มีตำแหน่งหน้าที่ในคณะบุคคลนั้น ผู้นั้นต้องระวางโทษจำคุกไม่เกินสิบปี และปรับไม่เกินสองแสนบาท
มาตรา ๒๑๐ ผู้ใดสมคบกันตั้งแต่ห้าคนขึ้นไปเพื่อกระทำความผิดอย่างหนึ่งอย่างใดตามที่บัญญัติไว้ในภาค ๒ นี้ และความผิดนั้นมีกำหนดโทษจำคุกอย่างสูงตั้งแต่หนึ่งปีขึ้นไป ผู้นั้นกระทำความผิดฐานเป็นซ่องโจร ต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
ถ้าเป็นการสมคบเพื่อกระทำความผิดที่มีระวางโทษถึงประหารชีวิต จำคุกตลอดชีวิตหรือจำคุกอย่างสูงตั้งแต่สิบปีขึ้นไป ผู้กระทำต้องระวางโทษจำคุกตั้งแต่สองปีถึงสิบปี และปรับตั้งแต่สี่หมื่นบาทถึงสองแสนบาท
มาตรา ๒๑๑ ผู้ใดประชุมในที่ประชุมอั้งยี่หรือซ่องโจร ผู้นั้นกระทำความผิดฐานเป็นอั้งยี่หรือซ่องโจร เว้นแต่ผู้นั้นจะแสดงได้ว่า ได้ประชุมโดยไม่รู้ว่าเป็นการประชุมของอั้งยี่หรือซ่องโจร
มาตรา ๒๑๒ ผู้ใด
(๑) จัดหาที่ประชุมหรือที่พำนักให้แก่อั้งยี่หรือซ่องโจร
(๒) ชักชวนบุคคลให้เข้าเป็นสมาชิกอั้งยี่หรือพรรคพวกซ่องโจร
(๓) อุปการะอั้งยี่หรือซ่องโจรโดยให้ทรัพย์หรือโดยประการอื่น หรือ
(๔) ช่วยจำหน่ายทรัพย์ที่อั้งยี่หรือซ่องโจรได้มาโดยการกระทำความผิด
ต้องระวางโทษเช่นเดียวกับผู้กระทำความผิดฐานเป็นอั้งยี่หรือซ่องโจร แล้วแต่กรณี
มาตรา ๒๑๓ ถ้าสมาชิกอั้งยี่หรือพรรคพวกซ่องโจรคนหนึ่งคนใดได้กระทำความผิดตามความมุ่งหมายของอั้งยี่หรือซ่องโจรนั้น สมาชิกอั้งยี่หรือพรรคพวกซ่องโจรที่อยู่ด้วยในขณะกระทำความผิด หรืออยู่ด้วยในที่ประชุมแต่ไม่ได้คัดค้านในการตกลงให้กระทำความผิดนั้น และบรรดาหัวหน้า ผู้จัดการหรือผู้มีตำแหน่งหน้าที่ในอั้งยี่หรือซ่องโจรนั้น ต้องระวางโทษตามที่บัญญัติไว้สำหรับความผิดนั้นทุกคน
มาตรา ๒๑๔ ผู้ใดประพฤติตนเป็นปกติธุระเป็นผู้จัดหาที่พำนัก ที่ซ่อนเร้นหรือที่ประชุมให้บุคคลซึ่งตนรู้ว่าเป็นผู้กระทำความผิดที่บัญญัติไว้ในภาค ๒ นี้ ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
ถ้าการกระทำความผิดนั้น เป็นการกระทำเพื่อช่วยบิดา มารดา บุตร สามีหรือภริยาของผู้กระทำ ศาลจะไม่ลงโทษก็ได้
มาตรา ๒๑๕ ผู้ใดมั่วสุมกันตั้งแต่สิบคนขึ้นไป ใช้กำลังประทุษร้ายขู่เข็ญว่าจะใช้กำลังประทุษร้าย หรือกระทำการอย่างหนึ่งอย่างใดให้เกิดการวุ่นวายขึ้นในบ้านเมือง ต้องระวางโทษจำคุกไม่เกินหกเดือน หรือปรับไม่เกินหนึ่งหมื่นบาท หรือทั้งจำทั้งปรับ
ถ้าผู้กระทำความผิดคนหนึ่งคนใดมีอาวุธ บรรดาผู้ที่กระทำความผิด ต้องระวางโทษจำคุกไม่เกินสองปี หรือปรับไม่เกินสี่หมื่นบาท หรือทั้งจำทั้งปรับ
ถ้าผู้กระทำความผิดเป็นหัวหน้า หรือเป็นผู้มีหน้าที่สั่งการในการกระทำความผิดนั้น ต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
มาตรา ๒๑๖ เมื่อเจ้าพนักงานสั่งผู้ที่มั่วสุมเพื่อกระทำความผิดตามมาตรา ๒๑๕ ให้เลิกไป ผู้ใดไม่เลิก ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
ลักษณะ ๖
ความผิดเกี่ยวกับการก่อให้เกิดภยันตรายต่อประชาชน
มาตรา ๒๑๗ ผู้ใดวางเพลิงเผาทรัพย์ของผู้อื่น ต้องระวางโทษจำคุกตั้งแต่หกเดือนถึงเจ็ดปี และปรับตั้งแต่หนึ่งหมื่นบาท ถึงหนึ่งแสนสี่หมื่นบาท
มาตรา ๒๑๘ ผู้ใดวางเพลิงเผาทรัพย์ดังต่อไปนี้
(๑) โรงเรือน เรือ หรือแพที่คนอยู่อาศัย
(๒) โรงเรือน เรือหรือแพอันเป็นที่เก็บหรือที่ทำสินค้า
(๓) โรงมหรสพหรือสถานที่ประชุม
(๔) โรงเรือนอันเป็นสาธารณสมบัติของแผ่นดิน เป็นสาธารณสถาน หรือเป็นที่สำหรับประกอบพิธีกรรมตามศาสนา
(๕) สถานีรถไฟ ท่าอากาศยานหรือที่จอดรถหรือเรือสาธารณะ
(๖) เรือกลไฟ หรือเรือยนต์ อันมีระวางตั้งแต่ห้าตันขึ้นไป อากาศยาน หรือรถไฟที่ใช้ในการขนส่งสาธารณะ
ต้องระวางโทษประหารชีวิต จำคุกตลอดชีวิต หรือจำคุกตั้งแต่ห้าปีถึงยี่สิบปี
มาตรา ๒๑๙ ผู้ใดตระเตรียมเพื่อกระทำความผิดดังกล่าวในมาตรา ๒๑๗ หรือมาตรา ๒๑๘ ต้องระวางโทษเช่นเดียวกับพยายามกระทำความผิดนั้น ๆ
มาตรา ๒๒๐ ผู้ใดกระทำให้เกิดเพลิงไหม้แก่วัตถุใด ๆ แม้เป็นของตนเอง จนน่าจะเป็นอันตรายแก่บุคคลอื่นหรือทรัพย์ของผู้อื่น ต้องระวางโทษจำคุกไม่เกินเจ็ดปี และปรับไม่เกินหนึ่งแสนสี่หมื่นบาท
ถ้าการกระทำความผิดดังกล่าวในวรรคแรก เป็นเหตุให้เกิดเพลิงไหม้แก่ทรัพย์ตามที่ระบุไว้ในมาตรา ๒๑๘ ผู้กระทำต้องระวางโทษดังที่บัญญัติไว้ในมาตรา ๒๑๘
มาตรา ๒๒๑ ผู้ใดกระทำให้เกิดระเบิดจนน่าจะเป็นอันตรายแก่บุคคลอื่น หรือทรัพย์ของผู้อื่น ต้องระวางโทษจำคุกไม่เกินเจ็ดปี และปรับไม่เกินหนึ่งแสนสี่หมื่นบาท
มาตรา ๒๒๒ ผู้ใดกระทำให้เกิดระเบิดจนเป็นเหตุให้เกิดอันตรายแก่ทรัพย์ดังกล่าวในมาตรา ๒๑๗ หรือมาตรา ๒๑๘ ต้องระวางโทษดังที่บัญญัติไว้ในมาตรานั้น ๆ
มาตรา ๒๒๓ ความผิดดังกล่าวในมาตรา ๒๑๗ มาตรา ๒๑๘ มาตรา ๒๒๐ มาตรา ๒๒๑ หรือมาตรา ๒๒๒ นั้น ถ้าทรัพย์ที่เป็นอันตราย หรือที่น่าจะเป็นอันตราย เป็นทรัพย์ที่มีราคาน้อย และการกระทำนั้นไม่น่าจะเป็นอันตรายแก่บุคคลอื่น ผู้กระทำต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๒๒๔ ถ้าการกระทำความผิดดังกล่าวในมาตรา ๒๑๗ มาตรา ๒๑๘ มาตรา ๒๒๑ หรือมาตรา ๒๒๒ เป็นเหตุให้บุคคลอื่นถึงแก่ความตาย ผู้กระทำต้องระวางโทษประหารชีวิต หรือจำคุกตลอดชีวิต
ถ้าเป็นเหตุให้บุคคลอื่นรับอันตรายสาหัส ผู้กระทำต้องระวางโทษประหารชีวิต จำคุกตลอดชีวิต หรือจำคุกตั้งแต่สิบปีถึงยี่สิบปี
มาตรา ๒๒๕ ผู้ใดกระทำให้เกิดเพลิงไหม้โดยประมาท และเป็นเหตุให้ทรัพย์ของผู้อื่นเสียหาย หรือการกระทำโดยประมาทนั้นน่าจะเป็นอันตรายแก่ชีวิตของบุคคลอื่น ต้องระวางโทษจำคุกไม่เกินเจ็ดปี หรือปรับไม่เกินหนึ่งแสนสี่หมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๒๒๖ ผู้ใดกระทำด้วยประการใด ๆ แก่โรงเรือน อู่เรือ ที่จอดรถหรือเรือสาธารณะ ทุ่นทอดจอดเรือ สิ่งปลูกสร้าง เครื่องจักร เครื่องกล สายไฟฟ้าหรือสิ่งที่ทำไว้เพื่อป้องกันอันตรายแก่บุคคลหรือทรัพย์ จนน่าจะเป็นเหตุให้เกิดอันตรายแก่บุคคลอื่น ต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
มาตรา ๒๒๗ ผู้ใดเป็นผู้มีวิชาชีพในการออกแบบควบคุม หรือทำการก่อสร้าง ซ่อมแซมหรือรื้อถอน อาคารหรือสิ่งปลูกสร้างใด ๆ ไม่ปฏิบัติตามหลักเกณฑ์ หรือวิธีการอันพึงกระทำการนั้น ๆ โดยประการที่น่าจะเป็นเหตุให้เกิดอันตรายแก่บุคคลอื่น ต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
มาตรา ๒๒๘ ผู้ใดกระทำด้วยประการใด ๆ เพื่อให้เกิดอุทกภัย หรือเพื่อให้เกิดขัดข้องแก่การใช้น้ำซึ่งเป็นสาธารณูปโภค ถ้าการกระทำนั้นน่าจะเป็นอันตรายแก่บุคคลอื่นหรือทรัพย์ของผู้อื่น ต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
ถ้าการกระทำผิดดังกล่าวในวรรคแรกเป็นเหตุให้เกิดอันตรายแก่บุคคลอื่นหรือทรัพย์ของผู้อื่น ผู้กระทำต้องระวางโทษจำคุกตั้งแต่หกเดือนถึงเจ็ดปี และปรับตั้งแต่หนึ่งหมื่นบาทถึงหนึ่งแสนสี่หมื่นบาท”
มาตรา ๒๒๙ ผู้ใดกระทำด้วยประการใด ๆ ให้ทางสาธารณะ ประตูน้ำ ทำนบ เขื่อน อันเป็นส่วนของทางสาธารณะ หรือที่ขึ้นลงของอากาศยาน อยู่ในลักษณะอันน่าจะเป็นเหตุให้เกิดอันตรายแก่การจราจร ต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
มาตรา ๒๓๐ ผู้ใดเอาสิ่งใด ๆ กีดขวางทางรถไฟหรือทางรถราง ทำให้รางรถไฟหรือรางรถรางหลุด หลวมหรือเคลื่อนจากที่ หรือกระทำแก่เครื่องสัญญาณจนน่าจะเป็นเหตุให้เกิดอันตรายแก่การเดินรถไฟหรือรถราง ต้องระวางโทษจำคุกตั้งแต่หกเดือนถึงเจ็ดปี และปรับตั้งแต่หนึ่งหมื่นบาทถึงหนึ่งแสนสี่หมื่นบาท
มาตรา ๒๓๑ ผู้ใดกระทำด้วยประการใด ๆ ให้ประภาคาร ทุ่น สัญญาณ หรือสิ่งอื่นใด ซึ่งจัดไว้เป็นสัญญาณเพื่อความปลอดภัยในการจราจรทางบก การเดินเรือหรือการเดินอากาศ อยู่ในลักษณะอันน่าจะเป็นเหตุให้เกิดอันตรายแก่การจราจรทางบก การเดินเรือหรือการเดินอากาศ ต้องระวางโทษจำคุกตั้งแต่หกเดือนถึงเจ็ดปี และปรับตั้งแต่หนึ่งหมื่นบาทถึงหนึ่งแสนสี่หมื่นบาท
มาตรา ๒๓๒ ผู้ใดกระทำด้วยประการใด ๆ ให้ยานพาหนะดังต่อไปนี้ อยู่ในลักษณะอันน่าจะเป็นเหตุให้เกิดอันตรายแก่บุคคล
(๑) เรือเดินทะเล อากาศยาน รถไฟหรือรถราง
(๒) รถยนต์ที่ใช้สำหรับการขนส่งสาธารณะ หรือ
(๓) เรือกลไฟ หรือเรือยนต์อันมีระวางตั้งแต่ห้าตันขึ้นไป ที่ใช้สำหรับการขนส่งสาธารณะ
ต้องระวางโทษจำคุกตั้งแต่หกเดือนถึงเจ็ดปี และปรับตั้งแต่หนึ่งหมื่นบาทถึงหนึ่งแสนสี่หมื่นบาท
มาตรา ๒๓๓ ผู้ใดใช้ยานพาหนะรับจ้างขนส่งคนโดยสาร เมื่อยานพาหนะนั้นมีลักษณะหรือมีการบรรทุกจนน่าจะเป็นอันตรายแก่บุคคลในยานพาหนะนั้น ต้องระวางโทษจำคุกไม่เกินหนึ่งปี หรือปรับไม่เกินสองหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๒๓๔ ผู้ใดกระทำด้วยประการใด ๆ แก่สิ่งที่ใช้ในการผลิต ในการส่งพลังงานไฟฟ้าหรือในการส่งน้ำ จนเป็นเหตุให้ประชาชนขาดความสะดวก หรือน่าจะเป็นเหตุให้เกิดอันตรายแก่ประชาชน ต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
มาตรา ๒๓๕ ผู้ใดกระทำการด้วยประการใด ๆ ให้การสื่อสารสาธารณะทางไปรษณีย์ ทางโทรเลข ทางโทรศัพท์ หรือทางวิทยุขัดข้อง ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๒๓๖ ผู้ใดปลอมปนอาหาร ยาหรือเครื่องอุปโภคบริโภคอื่นใด เพื่อบุคคลอื่นเสพหรือใช้ และการปลอมปนนั้นน่าจะเป็นเหตุให้เกิดอันตรายแก่สุขภาพ หรือจำหน่าย หรือเสนอขาย สิ่งเช่นว่านั้นเพื่อบุคคลเสพหรือใช้ ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๒๓๗ ผู้ใดเอาของที่มีพิษหรือสิ่งอื่นที่น่าจะเป็นอันตรายแก่สุขภาพเจือลงในอาหาร หรือในน้ำซึ่งอยู่ในบ่อสระหรือที่ขังน้ำใด ๆ และอาหารหรือน้ำนั้นได้มีอยู่หรือจัดไว้เพื่อประชาชนบริโภค ต้องระวางโทษจำคุกตั้งแต่หกเดือนถึงสิบปี และปรับตั้งแต่หนึ่งหมื่นบาทถึงสองแสนบาท
มาตรา ๒๓๘ ถ้าการกระทำความผิดตามมาตรา ๒๒๖ ถึงมาตรา ๒๓๗ เป็นเหตุให้บุคคลอื่นถึงแก่ความตาย ผู้กระทำต้องระวางโทษจำคุกตลอดชีวิต หรือจำคุกตั้งแต่ห้าปีถึงยี่สิบปี และปรับตั้งแต่หนึ่งแสนบาทถึงสี่แสนบาท
ถ้าเป็นเหตุให้บุคคลอื่นรับอันตรายสาหัส ผู้กระทำต้องระวางโทษจำคุกตั้งแต่หนึ่งปีถึงสิบปี และปรับตั้งแต่สองหมื่นบาทถึงสองแสนบาท
มาตรา ๒๓๙ ถ้าการกระทำดังกล่าวในมาตรา ๒๒๖ ถึงมาตรา ๒๓๗ เป็นการกระทำโดยประมาท และใกล้จะเป็นอันตรายแก่ชีวิตของบุคคลอื่น ผู้กระทำต้องระวางโทษจำคุกไม่เกินหนึ่งปี หรือปรับไม่เกินสองหมื่นบาท หรือทั้งจำทั้งปรับ
ลักษณะ ๗
ความผิดเกี่ยวกับการปลอมและการแปลง
หมวด ๑
ความผิดเกี่ยวกับเงินตรา
มาตรา ๒๔๐ ผู้ใดทำปลอมขึ้นซึ่งเงินตรา ไม่ว่าจะปลอมขึ้นเพื่อให้เป็นเหรียญกษาปณ์ ธนบัตรหรือสิ่งอื่นใดซึ่งรัฐบาลออกใช้หรือให้อำนาจให้ออกใช้ หรือทำปลอมขึ้นซึ่งพันธบัตรรัฐบาลหรือใบสำคัญสำหรับรับดอกเบี้ยพันธบัตรนั้น ๆ ผู้นั้นกระทำความผิดฐานปลอมเงินตรา ต้องระวางโทษจำคุกตลอดชีวิต หรือจำคุกตั้งแต่สิบปีถึงยี่สิบปี และปรับตั้งแต่สองแสนบาทถึงสี่แสนบาท
มาตรา ๒๔๑ ผู้ใดแปลงเงินตรา ไม่ว่าจะเป็นเหรียญกษาปณ์ ธนบัตรหรือสิ่งอื่นใดซึ่งรัฐบาลออกใช้หรือให้อำนาจให้ออกใช้ หรือแปลงพันธบัตรรัฐบาลหรือใบสำคัญสำหรับรับดอกเบี้ยพันธบัตรนั้น ๆ ให้ผิดไปจากเดิม เพื่อให้ผู้อื่นเชื่อว่ามีมูลค่าสูงกว่าจริง ผู้นั้นกระทำความผิดฐานแปลงเงินตรา ต้องระวางโทษจำคุกตลอดชีวิต หรือจำคุกตั้งแต่ห้าปีถึงยี่สิบปี และปรับตั้งแต่หนึ่งแสนบาทถึงสี่แสนบาท
มาตรา ๒๔๒ ผู้ใดกระทำโดยทุจริตให้เหรียญกษาปณ์ซึ่งรัฐบาลออกใช้มีน้ำหนักลดลง ต้องระวางโทษจำคุกไม่เกินเจ็ดปี และปรับไม่เกินหนึ่งแสนสี่หมื่นบาท
ผู้ใดนำเข้าในราชอาณาจักร นำออกใช้หรือมีไว้เพื่อนำออกใช้ซึ่งเหรียญกษาปณ์ที่มีผู้กระทำโดยทุจริตให้น้ำหนักลดลงตามความในวรรคแรก ต้องระวางโทษเช่นเดียวกัน
มาตรา ๒๔๓ ผู้ใดนำเข้าในราชอาณาจักรซึ่งสิ่งใด ๆ อันเป็นของปลอมตามมาตรา ๒๔๐ หรือของแปลงตามมาตรา ๒๔๑ ต้องระวางโทษดังที่บัญญัติไว้ในมาตรานั้น ๆ
มาตรา ๒๔๔ ผู้ใดมีไว้เพื่อนำออกใช้ซึ่งสิ่งใด ๆ อันตนได้มาโดยรู้ว่าเป็นของปลอมตามมาตรา ๒๔๐ หรือของแปลงตามมาตรา ๒๔๑ ต้องระวางโทษจำคุกตั้งแต่หนึ่งปีถึงสิบห้าปี และปรับตั้งแต่สองหมื่นบาทถึงสามแสนบาท
มาตรา ๒๔๕ ผู้ใดได้มาซึ่งสิ่งใด ๆ โดยไม่รู้ว่าเป็นของปลอมตามมาตรา ๒๔๐ หรือของแปลงตามมาตรา ๒๔๑ ถ้าต่อมารู้ว่าเป็นของปลอมหรือของแปลงเช่นว่านั้น ยังขืนนำออกใช้ ต้องระวางโทษจำคุกไม่เกินสิบปี หรือปรับไม่เกินสองแสนบาท หรือทั้งจำทั้งปรับ
มาตรา ๒๔๖ ผู้ใดทำเครื่องมือหรือวัตถุสำหรับปลอมหรือแปลงเงินตรา ไม่ว่าจะเป็นเหรียญกษาปณ์ ธนบัตรหรือสิ่งใด ๆ ซึ่งรัฐบาลออกใช้หรือให้อำนาจให้ออกใช้ หรือสำหรับปลอมหรือแปลงพันธบัตรรัฐบาลหรือใบสำคัญสำหรับรับดอกเบี้ยพันธบัตรนั้น ๆ หรือมีเครื่องมือหรือวัตถุเช่นว่านั้นเพื่อใช้ในการปลอมหรือแปลง ต้องระวางโทษจำคุกตั้งแต่ห้าปีถึงสิบห้าปี และปรับตั้งแต่หนึ่งแสนบาทถึงสามแสนบาท
มาตรา ๒๔๗ ถ้าการกระทำดังกล่าวในหมวดนี้เป็นการกระทำเกี่ยวกับเงินตรา ไม่ว่าจะเป็นเหรียญกษาปณ์ ธนบัตรหรือสิ่งอื่นใดซึ่งรัฐบาลต่างประเทศออกใช้หรือให้อำนาจให้ออกใช้ หรือเกี่ยวกับพันธบัตรรัฐบาลต่างประเทศหรือใบสำคัญสำหรับรับดอกเบี้ยพันธบัตรนั้น ผู้กระทำต้องระวางโทษกึ่งหนึ่งของโทษที่บัญญัติไว้ในมาตรานั้น ๆ
มาตรา ๒๔๘ ถ้าผู้กระทำความผิดตามมาตรา ๒๔๐ มาตรา ๒๔๑ หรือมาตรา ๒๔๗ ได้กระทำความผิดตามมาตราอื่นที่บัญญัติไว้ในหมวดนี้อันเกี่ยวกับสิ่งที่ตนปลอมหรือแปลงนั้นด้วย ให้ลงโทษผู้นั้นตามมาตรา ๒๔๐ มาตรา ๒๔๑ หรือมาตรา ๒๔๗ แต่กระทงเดียว
มาตรา ๒๔๙ ผู้ใดทำบัตรหรือโลหะธาตุอย่างใด ๆ ให้มีลักษณะและขนาดคล้ายคลึงกับเงินตรา ไม่ว่าจะเป็นเหรียญกษาปณ์ ธนบัตรหรือสิ่งใด ๆ ซึ่งรัฐบาลออกใช้หรือให้อำนาจให้ออกใช้หรือพันธบัตรรัฐบาล หรือใบสำคัญสำหรับรับดอกเบี้ยพันธบัตรนั้น ๆ หรือจำหน่ายบัตรหรือโลหธาตุเช่นว่านั้น ต้องระวางโทษจำคุกไม่เกินหนึ่งปี หรือปรับไม่เกินสองหมื่นบาท หรือทั้งจำทั้งปรับ
ถ้าการจำหน่ายบัตร หรือโลหะธาตุดังกล่าวในวรรคแรกเป็นการจำหน่าย โดยการนำออกใช้ดังเช่นสิ่งใด ๆ ที่กล่าวในวรรคแรก ผู้กระทำต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
หมวด ๒
ความผิดเกี่ยวกับดวงตรา แสตมป์และตั๋ว
มาตรา ๒๕๐ ผู้ใดทำปลอมขึ้นซึ่งดวงตราแผ่นดิน รอยตราแผ่นดิน หรือพระปรมาภิไธย ต้องระวางโทษจำคุกตั้งแต่ห้าปีถึงยี่สิบปี และปรับตั้งแต่หนึ่งแสนบาทถึงสี่แสนบาท”
มาตรา ๒๕๑ ผู้ใดทำปลอมขึ้นซึ่งดวงตราหรือรอยตราของทบวงการเมือง ขององค์การสาธารณะ หรือของเจ้าพนักงาน ต้องระวางโทษจำคุกตั้งแต่หนึ่งปีถึงเจ็ดปี และปรับตั้งแต่สองหมื่นบาทถึงหนึ่งแสนสี่หมื่นบาท
มาตรา ๒๕๒ ผู้ใดใช้ดวงตรา รอยตราหรือพระปรมาภิไธย ดังกล่าวมาในมาตรา ๒๕๐ หรือมาตรา ๒๕๑ อันเป็นดวงตรา รอยตราหรือพระปรมาภิไธยที่ทำปลอมขึ้น ต้องระวางโทษดังที่บัญญัติไว้ในมาตรานั้น ๆ
มาตรา ๒๕๓ ผู้ใดได้มาซึ่งดวงตราหรือรอยตราดังกล่าวในมาตรา ๒๕๐ หรือมาตรา ๒๕๑ ซึ่งเป็นดวงตราหรือรอยตราอันแท้จริง และใช้ดวงตราหรือรอยตรานั้นโดยมิชอบในประการที่น่าจะทำให้ผู้อื่นหรือประชาชนเสียหาย ต้องระวางโทษสองในสามส่วนของโทษที่บัญญัติไว้ในมาตรา ๒๕๐ หรือมาตรา ๒๕๑ นั้น
มาตรา ๒๕๔ ผู้ใดทำปลอมขึ้นซึ่งแสตมป์รัฐบาล ซึ่งใช้สำหรับการไปรษณีย์ การภาษีอากรหรือการเก็บค่าธรรมเนียม หรือแปลงแสตมป์รัฐบาล ซึ่งใช้ในการเช่นว่านั้นให้ผิดไปจากเดิม เพื่อให้ผู้อื่นเชื่อว่ามีมูลค่าสูงกว่าจริง ต้องระวางโทษจำคุกตั้งแต่หนึ่งปีถึงเจ็ดปี และปรับตั้งแต่สองหมื่นบาทถึงหนึ่งแสนสี่หมื่นบาท
มาตรา ๒๕๕ ผู้ใดนำเข้าในราชอาณาจักรซึ่งดวงตราแผ่นดิน รอยตราแผ่นดิน พระปรมาภิไธย ดวงตราหรือรอยตราของทบวงการเมือง ขององค์การสาธารณะ หรือของเจ้าพนักงาน หรือแสตมป์ซึ่งระบุไว้ในมาตรา ๒๕๐ มาตรา ๒๕๑ หรือมาตรา ๒๕๔ อันเป็นของปลอม หรือของแปลง ต้องระวางโทษจำคุกตั้งแต่หนึ่งปีถึงสิบปี และปรับตั้งแต่สองหมื่นบาทถึงสองแสนบาท
มาตรา ๒๕๖ ผู้ใดลบ ถอนหรือกระทำด้วยประการใด ๆ แก่แสตมป์รัฐบาลซึ่งระบุไว้ในมาตรา ๒๕๔ และมีเครื่องหมายหรือการกระทำอย่างใดแสดงว่าใช้ไม่ได้แล้ว เพื่อให้ใช้ได้อีก ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๒๕๗ ผู้ใดใช้ ขาย เสนอขาย แลกเปลี่ยนหรือเสนอแลกเปลี่ยนซึ่งแสตมป์อันเกิดจากการกระทำดังกล่าวในมาตรา ๒๕๔ หรือมาตรา ๒๕๖ ไม่ว่าการกระทำตามมาตรานั้น ๆ จะได้กระทำภายในหรือนอกราชอาณาจักร ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๒๕๘ ผู้ใดทำปลอมขึ้นซึ่งตั๋วโดยสารซึ่งใช้ในการขนส่งสาธารณะ หรือแปลงตั๋วโดยสารซึ่งใช้ในการขนส่งสาธารณะให้ผิดไปจากเดิม เพื่อให้ผู้อื่นเชื่อว่ามีมูลค่าสูงกว่าจริง หรือลบ ถอน หรือกระทำด้วยประการใด ๆ แก่ตั๋วเช่นว่านั้นซึ่งมีเครื่องหมายหรือการกระทำอย่างใด แสดงว่าใช้ไม่ได้แล้วเพื่อให้ใช้ได้อีก ต้องระวางโทษจำคุกไม่เกินสองปี หรือปรับไม่เกินสี่หมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๒๕๙ ถ้าการกระทำตามมาตรา ๒๕๘ เป็นการกระทำเกี่ยวกับตั๋วที่จำหน่ายแก่ประชาชนเพื่อผ่านเข้าสถานที่ใด ๆ ผู้กระทำต้องระวางโทษจำคุกไม่เกินหนึ่งปี หรือปรับไม่เกินสองหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๒๖๐ ผู้ใดใช้ ขาย เสนอขาย แลกเปลี่ยนหรือเสนอแลกเปลี่ยนซึ่งตั๋วอันเกิดจากการกระทำดังกล่าวในมาตรา ๒๕๘ หรือมาตรา ๒๕๙ ต้องระวางโทษจำคุกไม่เกินหนึ่งปี หรือปรับไม่เกินสองหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๒๖๑ ผู้ใดทำเครื่องมือหรือวัตถุสำหรับปลอมหรือแปลงสิ่งใด ๆ ซึ่งระบุไว้ในมาตรา ๒๕๔ มาตรา ๒๕๘ หรือมาตรา ๒๕๙ หรือมีเครื่องมือหรือวัตถุเช่นว่านั้นเพื่อใช้ในการปลอมหรือแปลง ต้องระวางโทษจำคุกไม่เกินสองปี หรือปรับไม่เกินสี่หมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๒๖๒ ถ้าการกระทำดังกล่าวในมาตรา ๒๕๔ มาตรา ๒๕๖ มาตรา ๒๕๗ หรือมาตรา ๒๖๑ เป็นการกระทำเกี่ยวกับแสตมป์รัฐบาลต่างประเทศ ผู้กระทำต้องระวางโทษกึ่งหนึ่งของโทษที่บัญญัติไว้ในมาตรานั้น ๆ
มาตรา ๒๖๓ ถ้าผู้กระทำความผิดตามมาตรา ๒๕๐ มาตรา ๒๕๑ มาตรา ๒๕๔ มาตรา ๒๕๖ มาตรา ๒๕๘ มาตรา ๒๕๙ หรือมาตรา ๒๖๒ ได้กระทำความผิดตามมาตราอื่นที่บัญญัติไว้ในหมวดนี้ อันเกี่ยวกับสิ่งที่เกิดจากการกระทำความผิดนั้นด้วย ให้ลงโทษผู้นั้นตามมาตรา ๒๕๐ มาตรา ๒๕๑ มาตรา ๒๕๔ มาตรา ๒๕๖ มาตรา ๒๕๘ มาตรา ๒๕๙ หรือมาตรา ๒๖๒ แต่กระทงเดียว
หมวด ๓
ความผิดเกี่ยวกับเอกสาร
มาตรา ๒๖๔ ผู้ใดทำเอกสารปลอมขึ้นทั้งฉบับหรือแต่ส่วนหนึ่งส่วนใด เติมหรือตัดทอนข้อความ หรือแก้ไขด้วยประการใด ๆ ในเอกสารที่แท้จริง หรือประทับตราปลอม หรือลงลายมือชื่อปลอมในเอกสาร โดยประการที่น่าจะเกิดความเสียหายแก่ผู้อื่นหรือประชาชน ถ้าได้กระทำเพื่อให้ผู้หนึ่งผู้ใดหลงเชื่อว่าเป็นเอกสารที่แท้จริง ผู้นั้นกระทำความผิดฐานปลอมเอกสาร ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ	
ผู้ใดกรอกข้อความลงในแผ่นกระดาษหรือวัตถุอื่นใดซึ่งมีลายมือชื่อของผู้อื่นโดยไม่ได้รับความยินยอม หรือโดยฝ่าฝืนคำสั่งของผู้อื่นนั้น ถ้าได้กระทำเพื่อนำเอาเอกสารนั้นไปใช้ในกิจการที่อาจเกิดเสียหายแก่ผู้หนึ่งผู้ใดหรือประชาชน ให้ถือว่าผู้นั้นปลอมเอกสาร ต้องระวางโทษเช่นเดียวกัน
มาตรา ๒๖๕ ผู้ใดปลอมเอกสารสิทธิหรือเอกสารราชการ ต้องระวางโทษจำคุกตั้งแต่หกเดือนถึงห้าปี และปรับตั้งแต่หนึ่งหมื่นบาทถึงหนึ่งแสนบาท
มาตรา ๒๖๖ ผู้ใดปลอมเอกสารดังต่อไปนี้
(๑) เอกสารสิทธิอันเป็นเอกสารราชการ
(๒) พินัยกรรม
(๓) ใบหุ้น ใบหุ้นกู้ หรือใบสำคัญของใบหุ้นหรือใบหุ้นกู้
(๔) ตั๋วเงิน หรือ
(๕) บัตรเงินฝาก
ต้องระวางโทษจำคุกตั้งแต่หนึ่งปีถึงสิบปี และปรับตั้งแต่สองหมื่นบาทถึงสองแสนบาท
มาตรา ๒๖๗ ผู้ใดแจ้งให้เจ้าพนักงาน ผู้กระทำการตามหน้าที่จดข้อความอันเป็นเท็จลงในเอกสารมหาชนหรือเอกสารราชการ ซึ่งมีวัตถุประสงค์สำหรับใช้เป็นพยานหลักฐานโดยประการที่น่าจะเกิดความเสียหายแก่ผู้อื่นหรือประชาชน ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๒๖๘ ผู้ใดใช้หรืออ้างเอกสารอันเกิดจากการกระทำความผิดตามมาตรา ๒๖๔ มาตรา ๒๖๕ มาตรา ๒๖๖ หรือมาตรา ๒๖๗ ในประการที่น่าจะเกิดความเสียหายแก่ผู้อื่นหรือประชาชน ต้องระวางโทษดังที่บัญญัติไว้ในมาตรานั้น ๆ
ถ้าผู้กระทำความผิดตามวรรคแรกเป็นผู้ปลอมเอกสารนั้น หรือเป็นผู้แจ้งให้เจ้าพนักงานจดข้อความนั้นเองให้ลงโทษตามมาตรานี้แต่กระทงเดียว
มาตรา ๒๖๙ ผู้ใดในการประกอบการงานในวิชาแพทย์ กฎหมาย บัญชีหรือวิชาชีพอื่นใด ทำคำรับรองเป็นเอกสารอันเป็นเท็จ โดยประการที่น่าจะเกิดความเสียหายแก่ผู้อื่นหรือประชาชน ต้องระวางโทษจำคุกไม่เกินสองปี หรือปรับไม่เกินสี่หมื่นบาท หรือทั้งจำทั้งปรับ
ผู้ใดโดยทุจริตใช้หรืออ้างคำรับรองอันเกิดจากการกระทำความผิดตามวรรคแรก ต้องระวางโทษเช่นเดียวกัน
หมวด ๔
ความผิดเกี่ยวกับบัตรอิเล็กทรอนิกส์
มาตรา ๒๖๙/๑ ผู้ใดทำบัตรอิเล็กทรอนิกส์ปลอมขึ้นทั้งฉบับหรือแต่ส่วนหนึ่งส่วนใด เติมหรือตัดทอนข้อความ หรือแก้ไขด้วยประการใด ๆ ในบัตรอิเล็กทรอนิกส์ที่แท้จริง โดยประการที่น่าจะเกิดความเสียหายแก่ผู้อื่นหรือประชาชน ถ้าได้กระทำเพื่อให้ผู้หนึ่งผู้ใดหลงเชื่อว่าเป็นบัตรอิเล็กทรอนิกส์ที่แท้จริงหรือเพื่อใช้ประโยชน์อย่างหนึ่งอย่างใด ผู้นั้นกระทำความผิดฐานปลอมบัตรอิเล็กทรอนิกส์ ต้องระวางโทษจำคุกตั้งแต่หนึ่งปีถึงห้าปี และปรับตั้งแต่สองหมื่นบาทถึงหนึ่งแสนบาท
มาตรา ๒๖๙/๒ ผู้ใดทำเครื่องมือหรือวัตถุสำหรับปลอมหรือแปลง หรือสำหรับให้ได้ข้อมูลในการปลอมหรือแปลงสิ่งใด ๆ ซึ่งระบุไว้ในมาตรา ๒๖๙/๑ หรือมีเครื่องมือหรือวัตถุเช่นว่านั้น เพื่อใช้หรือให้ได้ข้อมูลในการปลอมหรือแปลง ต้องระวางโทษจำคุกตั้งแต่หนึ่งปีถึงห้าปี และปรับตั้งแต่สองหมื่นบาทถึงหนึ่งแสนบาท
มาตรา ๒๖๙/๓ ผู้ใดนำเข้าในหรือส่งออกไปนอกราชอาณาจักรซึ่งสิ่งใด ๆ ตามมาตรา ๒๖๙/๑ หรือมาตรา ๒๖๙/๒ ต้องระวางโทษจำคุกตั้งแต่สามปีถึงสิบปี และปรับตั้งแต่หกหมื่นบาทถึงสองแสนบาท
มาตรา ๒๖๙/๔ ผู้ใดใช้หรือมีไว้เพื่อใช้ซึ่งสิ่งใด ๆ ตามมาตรา ๒๖๙/๑ อันได้มาโดยรู้ว่าเป็นของที่ทำปลอมหรือแปลงขึ้น ต้องระวางโทษจำคุกตั้งแต่หนึ่งปีถึงเจ็ดปี หรือปรับตั้งแต่สองหมื่นบาทถึงหนึ่งแสนสี่หมื่นบาท หรือทั้งจำทั้งปรับ
ผู้ใดจำหน่ายหรือมีไว้เพื่อจำหน่ายซึ่งสิ่งใด ๆ ที่ทำปลอมหรือแปลงขึ้นตามมาตรา ๒๖๙/๑ ต้องระวางโทษจำคุกตั้งแต่หนึ่งปีถึงสิบปี หรือปรับตั้งแต่สองหมื่นบาทถึงสองแสนบาท หรือทั้งจำทั้งปรับ
ถ้าผู้กระทำความผิดตามวรรคแรกหรือวรรคสองเป็นผู้ปลอมซึ่งบัตรอิเล็กทรอนิกส์ตามมาตรา ๒๖๙/๑ ให้ลงโทษตามมาตรานี้แต่กระทงเดียว
มาตรา ๒๖๙/๕ ผู้ใดใช้บัตรอิเล็กทรอนิกส์ของผู้อื่นโดยมิชอบ ในประการที่น่าจะก่อให้เกิดความเสียหายแก่ผู้อื่นหรือประชาชน ต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
มาตรา ๒๖๙/๖ ผู้ใดมีไว้เพื่อนำออกใช้ซึ่งบัตรอิเล็กทรอนิกส์ของผู้อื่นโดยมิชอบตามมาตรา ๒๖๙/๕ ในประการที่น่าจะก่อให้เกิดความเสียหายแก่ผู้อื่นหรือประชาชน ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๒๖๙/๗ ถ้าการกระทำดังกล่าวในหมวดนี้ เป็นการกระทำเกี่ยวกับบัตรอิเล็กทรอนิกส์ที่ผู้ออกได้ออกให้แก่ผู้มีสิทธิใช้ เพื่อใช้ประโยชน์ในการชำระค่าสินค้า ค่าบริการหรือหนี้อื่นแทนการชำระด้วยเงินสด หรือใช้เบิกถอนเงินสด ผู้กระทำต้องระวางโทษหนักกว่าที่บัญญัติไว้ในมาตรานั้น ๆ กึ่งหนึ่ง
หมวด ๕
ความผิดเกี่ยวกับหนังสือเดินทาง
มาตรา ๒๖๙/๘ ผู้ใดทำหนังสือเดินทางปลอมขึ้นทั้งฉบับหรือแต่ส่วนหนึ่งส่วนใด เติมหรือตัดทอนข้อความ หรือแก้ไขด้วยประการใด ๆ ในหนังสือเดินทางที่แท้จริง หรือประทับตราปลอมหรือลงลายมือชื่อปลอมในหนังสือเดินทาง โดยประการที่น่าจะเกิดความเสียหายแก่ผู้อื่นหรือประชาชน ถ้าได้กระทำเพื่อให้ผู้หนึ่งผู้ใดหลงเชื่อว่าเป็นหนังสือเดินทางที่แท้จริง ผู้นั้นกระทำความผิดฐานปลอมหนังสือเดินทาง ต้องระวางโทษจำคุกตั้งแต่หนึ่งปีถึงสิบปี และปรับตั้งแต่สองหมื่นบาทถึงสองแสนบาท
มาตรา ๒๖๙/๙  ผู้ใดใช้หรือมีไว้เพื่อใช้ซึ่งหนังสือเดินทางปลอมตามมาตรา ๒๖๙/๘ ต้องระวางโทษจำคุกตั้งแต่หนึ่งปีถึงสิบปี และปรับตั้งแต่สองหมื่นบาทถึงสองแสนบาท
ผู้ใดจำหน่ายหรือมีไว้เพื่อจำหน่ายซึ่งหนังสือเดินทางปลอมตามมาตรา ๒๖๙/๘ ต้องระวางโทษจำคุกตั้งแต่สามปีถึงยี่สิบปี และปรับตั้งแต่หกหมื่นบาทถึงสี่แสนบาท
การมีหนังสือเดินทางปลอมตามมาตรา ๒๖๙/๘ จำนวนตั้งแต่สองฉบับขึ้นไป ให้สันนิษฐานไว้ก่อนว่ามีไว้เพื่อจำหน่าย
ถ้าผู้กระทำความผิดตามวรรคหนึ่งหรือวรรคสองเป็นผู้ปลอมซึ่งหนังสือเดินทาง ตามมาตรา ๒๖๙/๘ ให้ลงโทษตามมาตรานี้แต่กระทงเดียว
มาตรา  ๒๖๙/๑๐  ผู้ใดนำเข้าในหรือส่งออกไปนอกราชอาณาจักรซึ่งหนังสือเดินทางปลอมตามมาตรา ๒๖๙/๘ ต้องระวางโทษจำคุกตั้งแต่หนึ่งปีถึงสิบปี และปรับตั้งแต่สองหมื่นบาทถึงสองแสนบาท
ถ้าการกระทำความผิดตามวรรคหนึ่งได้กระทำไปเพื่อจำหน่าย ต้องระวางโทษจำคุกตั้งแต่สามปีถึงยี่สิบปี และปรับตั้งแต่หกหมื่นบาทถึงสี่แสนบาท
มาตรา ๒๖๙/๑๑ ผู้ใดใช้หนังสือเดินทางของผู้อื่นโดยมิชอบ ในประการที่น่าจะก่อให้เกิดความเสียหายแก่ผู้อื่นหรือประชาชน ต้องระวางโทษจำคุกไม่เกินสิบปี และปรับไม่เกินสองแสนบาท
ผู้ใดจัดหาหนังสือเดินทางให้ผู้กระทำความผิดตามวรรคหนึ่ง ต้องระวางโทษเช่นเดียวกัน
มาตรา ๒๖๙/๑๒ ผู้ใดทำปลอมขึ้นซึ่งดวงตรา รอยตรา หรือแผ่นปะตรวจลงตราอันใช้ในการตรวจลงตราสำหรับการเดินทางระหว่างประเทศ ต้องระวางโทษจำคุกตั้งแต่หนึ่งปีถึงสิบปี และปรับตั้งแต่สองหมื่นบาทถึงสองแสนบาท
มาตรา ๒๖๙/๑๓ ผู้ใดใช้ดวงตรา รอยตรา หรือแผ่นปะตรวจลงตราที่ทำปลอมขึ้นตามมาตรา ๒๖๙/๑๒ ต้องระวางโทษจำคุกตั้งแต่หนึ่งปีถึงสิบปี และปรับตั้งแต่สองหมื่นบาทถึงสองแสนบาท
ถ้าผู้กระทำความผิดตามวรรคหนึ่งเป็นผู้ปลอมซึ่งดวงตรา รอยตรา หรือแผ่นปะตรวจลงตราตามมาตรา ๒๖๙/๑๒ ให้ลงโทษตามมาตรานี้แต่กระทงเดียว
มาตรา ๒๖๙/๑๔ ผู้ใดนำเข้าในหรือส่งออกไปนอกราชอาณาจักรซึ่งดวงตรา รอยตรา หรือแผ่นปะตรวจลงตราซึ่งระบุไว้ในมาตรา ๒๖๙/๑๒ อันเป็นของปลอม ต้องระวางโทษจำคุกตั้งแต่หนึ่งปีถึงสิบปี และปรับตั้งแต่สองหมื่นบาทถึงสองแสนบาท
มาตรา ๒๖๙/๑๕ ผู้ใดใช้ดวงตรา รอยตรา หรือแผ่นปะตรวจลงตราอันแท้จริงที่ใช้ในการตรวจลงตราสำหรับการเดินทางระหว่างประเทศโดยมิชอบ ในประการที่น่าจะก่อให้เกิดความเสียหายแก่ผู้อื่นหรือประชาชน ต้องระวางโทษสองในสามส่วนของโทษที่บัญญัติไว้ในมาตรา ๒๖๙/๑๓
ลักษณะ ๘
ความผิดเกี่ยวกับการค้า
มาตรา ๒๗๐ ผู้ใดใช้หรือมีไว้เพื่อใช้ซึ่งเครื่องชั่ง เครื่องตวง หรือเครื่องวัด ที่ผิดอัตราเพื่อเอาเปรียบในการค้า หรือมีเครื่องเช่นว่านั้นไว้เพื่อขาย ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๒๗๑ ผู้ใดขายของโดยหลอกลวงด้วยประการใด ๆ ให้ผู้ซื้อหลงเชื่อในแหล่งกำเนิด สภาพ คุณภาพหรือปริมาณแห่งของนั้นอันเป็นเท็จ ถ้าการกระทำนั้นไม่เป็นความผิดฐานฉ้อโกง ต้องระวางโทษ จำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๒๗๒ ผู้ใด
(๑) เอาชื่อ รูป รอยประดิษฐ์หรือข้อความใด ๆ ในการประกอบการค้าของผู้อื่นมาใช้ หรือทำให้ปรากฏที่สินค้า หีบ ห่อ วัตถุที่ใช้หุ้มห่อ แจ้งความ รายการแสดงราคา จดหมายเกี่ยวกับการค้าหรือสิ่งอื่นทำนองเดียวกัน เพื่อให้ประชาชนหลงเชื่อว่าเป็นสินค้าหรือการค้าของผู้อื่นนั้น
(๒) เลียนป้าย หรือสิ่งอื่นทำนองเดียวกันจนประชาชนน่าจะหลงเชื่อว่าสถานที่การค้าของตนเป็นสถานที่การค้าของผู้อื่นที่ตั้งอยู่ใกล้เคียง
(๓) ไขข่าวแพร่หลายซึ่งข้อความเท็จเพื่อให้เสียความเชื่อถือในสถานที่การค้า สินค้าอุตสาหกรรมหรือพาณิชย์การของผู้หนึ่งผู้ใด โดยมุ่งประโยชน์แก่การค้าของตน
ต้องระวางโทษจำคุกไม่เกินหนึ่งปี หรือปรับไม่เกินสองหมื่นบาท หรือทั้งจำทั้งปรับ
ความผิดตามมาตรานี้เป็นความผิดอันยอมความได้
มาตรา ๒๗๓ ผู้ใดปลอมเครื่องหมายการค้าของผู้อื่นซึ่งได้จดทะเบียนแล้ว ไม่ว่าจะได้จดทะเบียนภายในหรือนอกราชอาณาจักร ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๒๗๔ ผู้ใดเลียนเครื่องหมายการค้าของผู้อื่นซึ่งได้จดทะเบียนแล้ว ไม่ว่าจะได้จดทะเบียนภายในหรือนอกราชอาณาจักร เพื่อให้ประชาชนหลงเชื่อว่าเป็นเครื่องหมายการค้าของผู้อื่นนั้น ต้องระวางโทษจำคุกไม่เกินหนึ่งปี หรือปรับไม่เกินสองหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๒๗๕ ผู้ใดนำเข้าในราชอาณาจักร จำหน่ายหรือเสนอจำหน่าย ซึ่งสินค้าอันเป็นสินค้าที่มีชื่อ รูป รอยประดิษฐ์หรือข้อความใด ๆ ดังบัญญัติไว้ในมาตรา ๒๗๒ (๑) หรือสินค้าอันเป็นสินค้าที่มีเครื่องหมายการค้าปลอมหรือเลียนเครื่องหมายการค้าของผู้อื่นตามความในมาตรา ๒๗๓ หรือมาตรา ๒๗๔ ต้องระวางโทษดังที่บัญญัติไว้ในมาตรานั้น ๆ
ลักษณะ ๙
ความผิดเกี่ยวกับเพศ
มาตรา ๒๗๖ ผู้ใดข่มขืนกระทำชำเราผู้อื่นโดยขู่เข็ญด้วยประการใด ๆ โดยใช้กำลังประทุษร้าย โดยผู้อื่นนั้นอยู่ในภาวะที่ไม่สามารถขัดขืนได้ หรือโดยทำให้ผู้อื่นนั้นเข้าใจผิดว่าตนเป็นบุคคลอื่น ต้องระวางโทษจำคุกตั้งแต่สี่ปีถึงยี่สิบปี และปรับตั้งแต่แปดหมื่นบาทถึงสี่แสนบาท
ถ้าการกระทำความผิดตามวรรคหนึ่ง ได้กระทำโดยทำให้ผู้ถูกกระทำเข้าใจว่าผู้กระทำมีอาวุธปืนหรือวัตถุระเบิด ต้องระวางโทษจำคุกตั้งแต่เจ็ดปีถึงยี่สิบปี และปรับตั้งแต่หนึ่งแสนสี่หมื่นบาทถึงสี่แสนบาท
ถ้าการกระทำความผิดตามวรรคหนึ่ง ได้กระทำโดยมีอาวุธปืนหรือวัตถุระเบิด หรือโดยใช้อาวุธ หรือโดยร่วมกระทำความผิดด้วยกันอันมีลักษณะเป็นการโทรมหญิงหรือกระทำกับชายในลักษณะเดียวกัน ต้องระวางโทษจำคุกตั้งแต่สิบห้าปีถึงยี่สิบปี และปรับตั้งแต่สามแสนบาทถึงสี่แสนบาท หรือจำคุกตลอดชีวิต
ถ้าการกระทำความผิดตามวรรคหนึ่ง เป็นการกระทำความผิดระหว่างคู่สมรส และคู่สมรสนั้นยังประสงค์จะอยู่กินด้วยกันฉันสามีภริยา ศาลจะลงโทษน้อยกว่าที่กฎหมายกำหนดไว้เพียงใดก็ได้ หรือจะกำหนดเงื่อนไขเพื่อคุมความประพฤติแทนการลงโทษก็ได้ ในการพิจารณาของศาล ให้คำนึงถึงอายุ ประวัติ ความประพฤติ สติปัญญา การศึกษาอบรม สุขภาพ ภาวะแห่งจิต นิสัย อาชีพ สิ่งแวดล้อมของผู้กระทำความผิดและเด็กผู้ถูกกระทำ ความสัมพันธ์ระหว่างผู้กระทำความผิดกับเด็กผู้ถูกกระทำ หรือเหตุอื่นอันควรเพื่อประโยชน์ของเด็กผู้ถูกกระทำด้วย
ในกรณีที่ศาลมีคำพิพากษาให้ลงโทษจำคุกและคู่สมรสฝ่ายใดฝ่ายหนึ่งไม่ประสงค์จะอยู่กินด้วยกันฉันสามีภริยาต่อไป และประสงค์จะหย่า ให้คู่สมรสฝ่ายนั้นแจ้งให้ศาลทราบ และให้ศาลแจ้งพนักงานอัยการให้ดำเนินการฟ้องหย่าให้
มาตรา ๒๗๗ ผู้ใดกระทำชำเราเด็กอายุยังไม่เกินสิบห้าปีซึ่งมิใช่ภริยาหรือสามีของตน โดยเด็กนั้นจะยินยอมหรือไม่ก็ตาม ต้องระวางโทษจำคุกตั้งแต่ห้าปีถึงยี่สิบปี และปรับตั้งแต่หนึ่งแสนบาทถึงสี่แสนบาท
ถ้าการกระทำความผิดตามวรรคหนึ่ง เป็นการกระทำแก่เด็กอายุยังไม่เกินสิบสามปี ต้องระวางโทษจำคุกตั้งแต่เจ็ดปีถึงยี่สิบปี และปรับตั้งแต่หนึ่งแสนสี่หมื่นบาทถึงสี่แสนบาท หรือจำคุกตลอดชีวิต
ถ้าการกระทำความผิดตามวรรคหนึ่งหรือวรรคสอง ได้กระทำโดยทำให้ผู้ถูกกระทำเข้าใจว่าผู้กระทำมีอาวุธปืนหรือวัตถุระเบิด ต้องระวางโทษจำคุกตั้งแต่สิบปีถึงยี่สิบปี และปรับตั้งแต่สองแสนบาทถึงสี่แสนบาท หรือจำคุกตลอดชีวิต
ถ้าการกระทำความผิดตามวรรคหนึ่งหรือวรรคสอง ได้กระทำโดยมีอาวุธปืนหรือวัตถุระเบิด หรือโดยใช้อาวุธ หรือโดยร่วมกระทำความผิดด้วยกันอันมีลักษณะเป็นการโทรมเด็กหญิงหรือกระทำกับเด็กชายในลักษณะเดียวกัน ต้องระวางโทษจำคุกตลอดชีวิต
ความผิดตามที่บัญญัติไว้ในวรรคหนึ่ง ถ้าเป็นการกระทำโดยบุคคลอายุไม่เกินสิบแปดปีกระทำต่อเด็กซึ่งมีอายุกว่าสิบสามปีแต่ยังไม่เกินสิบห้าปี โดยเด็กนั้นยินยอม ศาลที่มีอำนาจพิจารณาคดีเยาวชนและครอบครัวจะพิจารณาให้มีการคุ้มครองสวัสดิภาพของเด็กผู้ถูกกระทำหรือผู้กระทำความผิดตามกฎหมายว่าด้วยการคุ้มครองเด็กแทนการลงโทษก็ได้ ในการพิจารณาของศาล ให้คำนึงถึงอายุ ประวัติ ความประพฤติ สติปัญญา การศึกษาอบรม สุขภาพ ภาวะแห่งจิต นิสัย อาชีพ สิ่งแวดล้อมของผู้กระทำความผิดและเด็กผู้ถูกกระทำ ความสัมพันธ์ระหว่างผู้กระทำความผิดกับเด็กผู้ถูกกระทำ หรือเหตุอื่นอันควรเพื่อประโยชน์ของเด็กผู้ถูกกระทำด้วย
ในกรณีที่ได้มีการดำเนินการคุ้มครองสวัสดิภาพของเด็กผู้ถูกกระทำหรือผู้กระทำความผิดตามกฎหมายว่าด้วยการคุ้มครองเด็กแล้ว ผู้กระทำความผิดไม่ต้องรับโทษ แต่ถ้าการคุ้มครองสวัสดิภาพดังกล่าวไม่สำเร็จ ศาลจะลงโทษผู้กระทำความผิดน้อยกว่าที่กฎหมายกำหนดไว้สำหรับความผิดนั้นเพียงใดก็ได้ ในการพิจารณาของศาล ให้คำนึงถึงเหตุตามวรรคห้าด้วย
มาตรา ๒๗๗ ทวิ ถ้าการกระทำความผิดตามมาตรา ๒๗๖ วรรคหนึ่ง หรือมาตรา ๒๗๗ วรรคหนึ่งหรือวรรคสอง เป็นเหตุให้ผู้ถูกกระทำ
(๑) รับอันตรายสาหัส ผู้กระทำต้องระวางโทษจำคุกตั้งแต่สิบห้าปีถึงยี่สิบปี และปรับตั้งแต่สามแสนบาทถึงสี่แสนบาท หรือจำคุกตลอดชีวิต
(๒) ถึงแก่ความตาย ผู้กระทำต้องระวางโทษประหารชีวิต หรือจำคุกตลอดชีวิต
มาตรา ๒๗๗ ตรี ถ้าการกระทำความผิดตามมาตรา ๒๗๖ วรรคสาม หรือมาตรา ๒๗๗ วรรคสี่ เป็นเหตุให้ผู้ถูกกระทำ
(๑) รับอันตรายสาหัส ผู้กระทำต้องระวางโทษประหารชีวิต หรือจำคุกตลอดชีวิต
(๒) ถึงแก่ความตาย ผู้กระทำต้องระวางโทษประหารชีวิต
มาตรา ๒๗๘ ผู้ใดกระทำอนาจารแก่บุคคลอายุกว่าสิบห้าปีโดยขู่เข็ญด้วยประการใด ๆ โดยใช้กำลังประทุษร้าย โดยบุคคลนั้นอยู่ในภาวะที่ไม่สามารถขัดขืนได้ หรือโดยทำให้บุคคลนั้นเข้าใจผิดว่าตนเป็นบุคคลอื่น ต้องระวางโทษ จำคุกไม่เกินสิบปี หรือปรับไม่เกินสองแสนบาท หรือทั้งจำทั้งปรับ
ถ้าการกระทำความผิดตามวรรคหนึ่ง เป็นการกระทำโดยใช้วัตถุหรืออวัยวะอื่นซึ่งมิใช่อวัยวะเพศล่วงล้ำอวัยวะเพศหรือทวารหนักของบุคคลนั้น ผู้กระทำต้องระวางโทษจำคุกตั้งแต่สี่ปีถึงยี่สิบปี และปรับตั้งแต่แปดหมื่นบาทถึงสี่แสนบาท
ถ้าการกระทำความผิดตามวรรคสอง ได้กระทำโดยทำให้ผู้ถูกกระทำเข้าใจว่าผู้กระทำมีอาวุธปืนหรือวัตถุระเบิด ต้องระวางโทษจำคุกตั้งแต่เจ็ดปีถึงยี่สิบปี และปรับตั้งแต่หนึ่งแสนสี่หมื่นบาทถึงสี่แสนบาท 	
ถ้าการกระทำความผิดตามวรรคสอง ได้กระทำโดยมีอาวุธปืนหรือวัตถุระเบิดหรือโดยใช้อาวุธ หรือโดยร่วมกระทำความผิดด้วยกันอันมีลักษณะเป็นการโทรมหญิงหรือกระทำกับชายในลักษณะเดียวกัน ต้องระวางโทษจำคุกตั้งแต่สิบห้าปีถึงยี่สิบปี และปรับตั้งแต่สามแสนบาทถึงสี่แสนบาท หรือจำคุกตลอดชีวิต 
มาตรา ๒๗๙ ผู้ใดกระทำอนาจารแก่เด็กอายุยังไม่เกินสิบห้าปี โดยเด็กนั้นจะยินยอมหรือไม่ก็ตาม ต้องระวางโทษจำคุกไม่เกินสิบปี หรือปรับไม่เกินสองแสนบาท หรือทั้งจำทั้งปรับ
ถ้าการกระทำความผิดตามวรรคหนึ่ง เป็นการกระทำแก่เด็กอายุไม่เกินสิบสามปี ต้องระวางโทษจำคุกตั้งแต่หนึ่งปีถึงสิบปี หรือปรับตั้งแต่สองหมื่นบาทถึงสองแสนบาท หรือทั้งจำทั้งปรับ
ถ้าการกระทำความผิดตามวรรคหนึ่งหรือวรรคสอง ผู้กระทำได้กระทำโดยขู่เข็ญด้วยประการใด ๆ โดยใช้กำลังประทุษร้าย โดยเด็กนั้นอยู่ในภาวะที่ไม่สามารถขัดขืนได้ หรือโดยทำให้เด็กนั้นเข้าใจผิดว่าตนเป็นบุคคลอื่น ต้องระวางโทษจำคุกตั้งแต่หนึ่งปีถึงสิบห้าปี หรือปรับตั้งแต่สองหมื่นบาทถึงสามแสนบาท หรือทั้งจำทั้งปรับ
ถ้าการกระทำความผิดตามวรรคหนึ่งหรือวรรคสาม เป็นการกระทำโดยใช้วัตถุหรืออวัยวะอื่นซึ่งมิใช่อวัยวะเพศล่วงล้ำอวัยวะเพศหรือทวารหนักของเด็กนั้น ผู้กระทำต้องระวางโทษจำคุกตั้งแต่ห้าปีถึงยี่สิบปี และปรับตั้งแต่หนึ่งแสนบาทถึงสี่แสนบาท
ถ้าการกระทำความผิดตามวรรคสี่ เป็นการกระทำแก่เด็กอายุยังไม่เกินสิบสามปี ต้องระวางโทษจำคุกตั้งแต่เจ็ดปีถึงยี่สิบปี และปรับตั้งแต่หนึ่งแสนสี่หมื่นบาทถึงสี่แสนบาท หรือจำคุกตลอดชีวิต
ถ้าการกระทำความผิดตามวรรคสี่หรือวรรคห้า ได้กระทำโดยทำให้ผู้ถูกกระทำเข้าใจว่าผู้กระทำมีอาวุธปืนหรือวัตถุระเบิด ต้องระวางโทษจำคุกตั้งแต่สิบปีถึงยี่สิบปี และปรับตั้งแต่สองแสนบาทถึงสี่แสนบาท หรือจำคุกตลอดชีวิต
ถ้าการกระทำความผิดตามวรรคสี่หรือวรรคห้า ได้กระทำโดยมีอาวุธปืนหรือวัตถุระเบิด หรือโดยใช้อาวุธ หรือโดยร่วมกระทำความผิดด้วยกันอันมีลักษณะเป็นการโทรมเด็กหญิงหรือกระทำกับเด็กชายในลักษณะเดียวกัน ต้องระวางโทษจำคุกตลอดชีวิต
มาตรา ๒๘๐ ถ้าการกระทำความผิดตามมาตรา ๒๗๘ หรือมาตรา ๒๗๙ เป็นเหตุให้ผู้ถูกกระทำ
(๑) รับอันตรายสาหัส ผู้กระทำต้องระวางโทษจำคุกตั้งแต่ห้าปีถึงยี่สิบปี และปรับตั้งแต่หนึ่งแสนบาทถึงสี่แสนบาท หรือจำคุกตลอดชีวิต
(๒) ถึงแก่ความตาย ผู้กระทำต้องระวางโทษประหารชีวิต หรือจำคุกตลอดชีวิต
มาตรา ๒๘๐/๑  ถ้าผู้กระทำความผิดตามมาตรา ๒๗๖ มาตรา ๒๗๗ มาตรา ๒๗๘ หรือมาตรา ๒๗๙ ได้บันทึกภาพหรือเสียงการกระทำชำเราหรือการกระทำอนาจารนั้นไว้ เพื่อแสวงหาประโยชน์โดยมิชอบสำหรับตนเองหรือผู้อื่น ต้องระวางโทษหนักกว่าที่บัญญัติไว้ในมาตรานั้น ๆ หนึ่งในสาม
ถ้าผู้กระทำความผิดตามวรรคหนึ่ง เผยแพร่หรือส่งต่อซึ่งภาพหรือเสียงการกระทำชำเราหรือการกระทำอนาจารที่บันทึกไว้ ต้องระวางโทษหนักกว่าที่บัญญัติไว้ในมาตรานั้น ๆ กึ่งหนึ่ง
มาตรา ๒๘๑ ความผิดตามมาตราดังต่อไปนี้ เป็นความผิดอันยอมความได้
(๑) มาตรา ๒๗๖ วรรคหนึ่ง และมาตรา ๒๗๘ วรรคสอง ซึ่งเป็นการกระทำระหว่างคู่สมรส ถ้ามิได้เกิดต่อหน้าธารกำนัล หรือไม่เป็นเหตุให้ผู้ถูกกระทำรับอันตรายสาหัสหรือถึงแก่ความตาย
(๒) มาตรา ๒๗๘ วรรคหนึ่ง ถ้ามิได้เกิดต่อหน้าธารกำนัล ไม่เป็นเหตุให้ผู้ถูกกระทำรับอันตรายสาหัสหรือถึงแก่ความตาย หรือมิได้เป็นการกระทำแก่บุคคลดังระบุไว้ในมาตรา ๒๘๕ และมาตรา ๒๘๕/๒
มาตรา ๒๘๒ ผู้ใดเพื่อสนองความใคร่ของผู้อื่น เป็นธุระจัดหา ล่อไป หรือพาไปเพื่อการอนาจารซึ่งชายหรือหญิง แม้ผู้นั้นจะยินยอมก็ตาม ต้องระวางโทษ จำคุกตั้งแต่หนึ่งปีถึงสิบปี และปรับตั้งแต่สองหมื่นบาทถึงสองแสนบาท
ถ้าการกระทำความผิดตามวรรคแรกเป็นการกระทำแก่บุคคลอายุเกินสิบห้าปีแต่ยังไม่เกินสิบแปดปี ผู้กระทำต้องระวางโทษจำคุกตั้งแต่สามปีถึงสิบห้าปี และปรับตั้งแต่หกหมื่นบาทถึงสามแสนบาท
ถ้าการกระทำความผิดตามวรรคแรกเป็นการกระทำแก่เด็กอายุยังไม่เกินสิบห้าปี ผู้กระทำต้องระวางโทษจำคุกตั้งแต่ห้าปีถึงยี่สิบปี และปรับตั้งแต่หนึ่งแสนบาทถึงสี่แสนบาท
ผู้ใดเพื่อสนองความใคร่ของผู้อื่น รับตัวบุคคลซึ่งมีผู้จัดหา ล่อไป หรือพาไปตามวรรคแรก วรรคสอง หรือวรรคสาม หรือสนับสนุนในการกระทำความผิดดังกล่าว ต้องระวางโทษตามที่บัญญัติไว้ในวรรคแรก วรรคสอง หรือวรรคสาม แล้วแต่กรณี
มาตรา ๒๘๓ ผู้ใดเพื่อสนองความใคร่ของผู้อื่น เป็นธุระจัดหา ล่อไป หรือพาไปเพื่อการอนาจารซึ่งชายหรือหญิง โดยใช้อุบายหลอกลวง ขู่เข็ญ ใช้กำลังประทุษร้าย ใช้อำนาจครอบงำผิดคลองธรรม หรือใช้วิธีข่มขืนใจด้วยประการอื่นใด ต้องระวางโทษ จำคุกตั้งแต่ห้าปีถึงยี่สิบปี และปรับตั้งแต่หนึ่งแสนบาทถึงสี่แสนบาท
ถ้าการกระทำความผิดตามวรรคแรกเป็นการกระทำแก่บุคคลอายุเกินสิบห้าปีแต่ยังไม่เกินสิบแปดปี ผู้กระทำต้องระวางโทษจำคุกตั้งแต่เจ็ดปีถึงยี่สิบปี และปรับตั้งแต่หนึ่งแสนสี่หมื่นบาทถึงสี่แสนบาท หรือจำคุกตลอดชีวิต
ถ้าการกระทำความผิดตามวรรคแรกเป็นการกระทำแก่เด็กอายุยังไม่เกินสิบห้าปี ผู้กระทำต้องระวางโทษจำคุกตั้งแต่สิบปีถึงยี่สิบปี และปรับตั้งแต่สองแสนบาทถึงสี่แสนบาท หรือจำคุกตลอดชีวิต หรือประหารชีวิต
ผู้ใดเพื่อสนองความใคร่ของผู้อื่น รับตัวบุคคลซึ่งมีผู้จัดหา ล่อไป หรือพาไปตามวรรคแรก วรรคสอง หรือวรรคสาม หรือสนับสนุนในการกระทำความผิดดังกล่าว ต้องระวางโทษตามที่บัญญัติไว้ในวรรคแรก วรรคสอง หรือวรรคสาม แล้วแต่กรณี
มาตรา ๒๘๓ ทวิ  ผู้ใดพาบุคคลอายุเกินสิบห้าปีแต่ยังไม่เกินสิบแปดปีไปเพื่อการอนาจาร แม้ผู้นั้นจะยินยอมก็ตาม ต้องระวางโทษ จำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
ถ้าการกระทำความผิดตามวรรคแรกเป็นการกระทำแก่เด็กอายุยังไม่เกินสิบห้าปี ผู้กระทำต้องระวางโทษจำคุกไม่เกินเจ็ดปี หรือปรับไม่เกินหนึ่งแสนสี่หมื่นบาท หรือทั้งจำทั้งปรับ
ผู้ใดซ่อนเร้นบุคคลซึ่งถูกพาไปตามวรรคแรกหรือวรรคสอง ต้องระวางโทษตามที่บัญญัติในวรรคแรกหรือวรรคสอง แล้วแต่กรณี
ความผิดตามวรรคแรกและวรรคสามเฉพาะกรณีที่กระทำแก่บุคคลอายุเกินสิบห้าปี เป็นความผิดอันยอมความได้
มาตรา ๒๘๔ ผู้ใดพาผู้อื่นไปเพื่อการอนาจาร โดยใช้อุบายหลอกลวงขู่เข็ญ ใช้กำลังประทุษร้าย ใช้อำนาจครอบงำผิดคลองธรรม หรือใช้วิธีข่มขืนใจด้วยประการอื่นใด ต้องระวางโทษ จำคุกตั้งแต่หนึ่งปีถึงสิบปี และปรับตั้งแต่สองหมื่นบาทถึงสองแสนบาท
ผู้ใดซ่อนเร้นบุคคลซึ่งถูกพาไปตามวรรคแรก ต้องระวางโทษเช่นเดียวกับผู้พาไปนั้น
ความผิดตามมาตรานี้ เป็นความผิดอันยอมความได้
มาตรา ๒๘๕ ถ้าการกระทำความผิดตามมาตรา ๒๗๖ มาตรา ๒๗๗ มาตรา ๒๗๗ ทวิ มาตรา ๒๗๗ ตรี มาตรา ๒๗๘ มาตรา ๒๗๙ มาตรา ๒๘๐ มาตรา ๒๘๒ หรือมาตรา ๒๘๓ เป็นการกระทำแก่บุพการี ผู้สืบสันดาน พี่น้องร่วมบิดามารดาหรือร่วมแต่บิดาหรือมารดา ญาติสืบสายโลหิต ศิษย์ซึ่งอยู่ในความดูแล ผู้อยู่ในความควบคุมตามหน้าที่ราชการ ผู้อยู่ในความปกครอง ในความพิทักษ์หรือในความอนุบาล หรือผู้อยู่ภายใต้อำนาจด้วยประการอื่นใด ผู้กระทำต้องระวางโทษหนักกว่าที่บัญญัติไว้ในมาตรานั้น ๆ หนึ่งในสาม
มาตรา ๒๘๕/๑ การกระทำความผิดตามมาตรา ๒๗๗ มาตรา ๒๗๙ มาตรา ๒๘๒ วรรคสาม มาตรา ๒๘๓ วรรคสาม และมาตรา ๒๘๓ ทวิ วรรคสอง หากเป็นการกระทำต่อเด็กอายุไม่เกินสิบสามปี ห้ามอ้างความไม่รู้อายุของเด็กเพื่อให้พ้นจากความผิดนั้น
มาตรา ๒๘๕/๒  ถ้าการกระทำความผิดตามมาตรา ๒๗๖ มาตรา ๒๗๗ มาตรา ๒๗๗ ทวิ มาตรา ๒๗๗ ตรี มาตรา ๒๗๘ หรือมาตรา ๒๗๙ เป็นการกระทำแก่บุคคลซึ่งไม่สามารถปกป้องตนเองอันเนื่องมาจากเป็นผู้ทุพพลภาพ ผู้มีจิตบกพร่อง โรคจิต หรือจิตฟั่นเฟือน คนป่วยเจ็บ คนชรา สตรีมีครรภ์ หรือผู้ซึ่งอยู่ในภาวะไม่สามารถรู้ผิดชอบ ผู้กระทำต้องระวางโทษหนักกว่าที่บัญญัติไว้ในมาตรานั้น ๆ หนึ่งในสาม
มาตรา ๒๘๖ ผู้ใดกระทำด้วยประการใด ๆ ดังต่อไปนี้ ต้องระวางโทษจำคุกไม่เกินยี่สิบปี และปรับไม่เกินสี่แสนบาท หรือจำคุกตลอดชีวิต
(๑) ช่วยเหลือ ให้ความสะดวก หรือคุ้มครองการค้าประเวณีของผู้อื่น
(๒) รับประโยชน์ไม่ว่ารูปแบบใดจากการค้าประเวณีของผู้อื่นหรือจากผู้ซึ่งค้าประเวณี
(๓) บังคับ ขู่เข็ญ หลอกลวง หรือใช้อำนาจครอบงำผู้อื่น หรือรับผู้อื่นเข้าทำงานเพื่อการค้าประเวณี
(๔) จัดให้มีการค้าประเวณีระหว่างผู้ซึ่งค้าประเวณีกับผู้ใช้บริการ
(๕) ปกปิดหรืออำพรางแหล่งที่มาของรายได้หรือทรัพย์สินซึ่งได้มาจากการค้าประเวณี
(๖) อยู่ร่วมกับผู้ซึ่งค้าประเวณีหรือสมาคมกับผู้ซึ่งค้าประเวณีคนเดียวหรือหลายคนเป็นอาจิณ และไม่สามารถแสดงที่มาของรายได้ในการดำรงชีพของตน
(๗) ขัดขวางการดำเนินการของหน่วยงานที่ดูแลในการป้องกัน ควบคุม ช่วยเหลือ หรือให้การศึกษาแก่ผู้ซึ่งค้าประเวณี ผู้ซึ่งจะเข้าร่วมในการค้าประเวณี หรือผู้ซึ่งอาจได้รับอันตรายจากการค้าประเวณี
ความในวรรคหนึ่ง (๒) และ (๖) มิให้ใช้บังคับแก่ผู้รับประโยชน์ไม่ว่ารูปแบบใดซึ่งพึงได้รับตามกฎหมายหรือตามธรรมจรรยา
มาตรา ๒๘๗ ผู้ใด
(๑) เพื่อความประสงค์แห่งการค้า หรือโดยการค้า เพื่อการแจกจ่ายหรือเพื่อการแสดงอวดแก่ประชาชน ทำ ผลิต มีไว้ นำเข้าหรือยังให้นำเข้าในราชอาณาจักร ส่งออกหรือยังให้ส่งออกไปนอกราชอาณาจักร พาไปหรือยังให้พาไปหรือทำให้แพร่หลายโดยประการใด ๆ ซึ่งเอกสาร ภาพเขียน ภาพพิมพ์ ภาพระบายสี สิ่งพิมพ์ รูปภาพ ภาพโฆษณา เครื่องหมาย รูปถ่าย ภาพยนตร์ แถบบันทึกเสียง แถบบันทึกภาพหรือสิ่งอื่นใดอันลามก
(๒) ประกอบการค้า หรือมีส่วนหรือเข้าเกี่ยวข้องในการค้าเกี่ยวกับวัตถุหรือสิ่งของลามกดังกล่าวแล้ว จ่ายแจกหรือแสดงอวดแก่ประชาชน หรือให้เช่าวัตถุหรือสิ่งของเช่นว่านั้น
(๓) เพื่อจะช่วยการทำให้แพร่หลาย หรือการค้าวัตถุหรือสิ่งของลามกดังกล่าวแล้ว โฆษณาหรือไขข่าวโดยประการใด ๆ ว่ามีบุคคลกระทำการอันเป็นความผิดตามมาตรานี้ หรือโฆษณาหรือไขข่าวว่าวัตถุ หรือสิ่งของลามกดังกล่าวแล้วจะหาได้จากบุคคลใด หรือโดยวิธีใด
ต้องระวางโทษ จำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๒๘๗/๑ ผู้ใดครอบครองสื่อลามกอนาจารเด็กเพื่อแสวงหาประโยชน์ในทางเพศสำหรับตนเองหรือผู้อื่น ต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
ถ้าผู้กระทำความผิดตามวรรคหนึ่งส่งต่อซึ่งสื่อลามกอนาจารเด็กแก่ผู้อื่น ต้องระวางโทษจำคุกไม่เกินเจ็ดปี หรือปรับไม่เกินหนึ่งแสนสี่หมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๒๘๗/๒ ผู้ใด
(๑) เพื่อความประสงค์แห่งการค้า หรือโดยการค้า เพื่อการแจกจ่ายหรือเพื่อการแสดงอวดแก่ประชาชน ทำ ผลิต มีไว้ นำเข้าหรือยังให้นำเข้าในราชอาณาจักร ส่งออกหรือยังให้ส่งออกไปนอกราชอาณาจักร พาไปหรือยังให้พาไปหรือทำให้แพร่หลายโดยประการใด ๆ ซึ่งสื่อลามกอนาจารเด็ก
(๒) ประกอบการค้า หรือมีส่วนหรือเข้าเกี่ยวข้องในการค้าเกี่ยวกับสื่อลามกอนาจารเด็ก จ่ายแจกหรือแสดงอวดแก่ประชาชนหรือให้เช่าสื่อลามกอนาจารเด็ก
(๓) เพื่อจะช่วยการทำให้แพร่หลาย หรือการค้าสื่อลามกอนาจารเด็กแล้ว โฆษณาหรือไขข่าวโดยประการใด ๆ ว่ามีบุคคลกระทำการอันเป็นความผิดตามมาตรานี้ หรือโฆษณาหรือไขข่าวว่าสื่อลามกอนาจารเด็กดังกล่าวแล้วจะหาได้จากบุคคลใด หรือโดยวิธีใด
ต้องระวางโทษจำคุกตั้งแต่สามปีถึงสิบปี และปรับตั้งแต่หกหมื่นบาทถึงสองแสนบาท
ลักษณะ ๑๐
ความผิดเกี่ยวกับชีวิตและร่างกาย
หมวด ๑
ความผิดต่อชีวิต
มาตรา ๒๘๘ ผู้ใดฆ่าผู้อื่น ต้องระวางโทษประหารชีวิต จำคุกตลอดชีวิต หรือจำคุกตั้งแต่สิบห้าปีถึงยี่สิบปี

มาตรา ๒๘๙ ผู้ใด
(๑) ฆ่าบุพการี	
(๒) ฆ่าเจ้าพนักงาน ซึ่งกระทำการตามหน้าที่ หรือเพราะเหตุที่จะกระทำ หรือได้กระทำการตามหน้าที่
(๓) ฆ่าผู้ช่วยเหลือเจ้าพนักงาน ในการที่เจ้าพนักงานนั้นกระทำตามหน้าที่ หรือเพราะเหตุที่บุคคลนั้นจะช่วยหรือได้ช่วยเจ้าพนักงานดังกล่าวแล้ว
(๔) ฆ่าผู้อื่นโดยไตร่ตรองไว้ก่อน
(๕) ฆ่าผู้อื่นโดยทรมานหรือโดยกระทำทารุณโหดร้าย
 (๖) ฆ่าผู้อื่นเพื่อตระเตรียมการ หรือเพื่อความสะดวกในการที่จะกระทำความผิดอย่างอื่น หรือ
(๗) ฆ่าผู้อื่นเพื่อจะเอาหรือเอาไว้ซึ่งผลประโยชน์อันเกิดแต่การที่ตนได้กระทำความผิดอื่น เพื่อปกปิดความผิดอื่นของตนหรือเพื่อหลีกเลี่ยงให้พ้นอาญา ในความผิดอื่นที่ตนได้กระทำไว้
ต้องระวางโทษประหารชีวิต
มาตรา ๒๙๐ ผู้ใดมิได้มีเจตนาฆ่า แต่ทำร้ายผู้อื่นจนเป็นเหตุให้ผู้นั้นถึงแก่ความตาย ต้องระวางโทษจำคุกตั้งแต่สามปีถึงสิบห้าปี
ถ้าความผิดนั้นมีลักษณะประการหนึ่งประการใดดังที่บัญญัติไว้ในมาตรา ๒๘๙ ผู้กระทำต้องระวางโทษจำคุกตั้งแต่สามปีถึงยี่สิบปี
มาตรา ๒๙๑ ผู้ใดกระทำโดยประมาท และการกระทำนั้นเป็นเหตุให้ผู้อื่นถึงแก่ความตาย ต้องระวางโทษจำคุกไม่เกินสิบปี และปรับไม่เกินสองแสนบาท
มาตรา ๒๙๒ ผู้ใดกระทำด้วยการปฏิบัติอันทารุณ หรือด้วยปัจจัยคล้ายคลึงกันแก่บุคคลซึ่งต้องพึ่งตน ในการดำรงชีพหรือในการอื่นใด เพื่อให้บุคคลนั้นฆ่าตนเอง ถ้าการฆ่าตนเองนั้นได้เกิดขึ้นหรือได้มีการพยายามฆ่าตนเอง ต้องระวางโทษจำคุกไม่เกินเจ็ดปี และปรับไม่เกินหนึ่งแสนสี่หมื่นบาท
มาตรา ๒๙๓ ผู้ใดช่วยหรือยุยงเด็กอายุยังไม่เกินสิบหกปี หรือผู้ซึ่งไม่สามารถเข้าใจว่าการกระทำของตนมีสภาพหรือสาระสำคัญอย่างไรหรือไม่สามารถบังคับการกระทำของตนได้ ให้ฆ่าตนเอง ถ้าการฆ่าตนเองนั้นได้เกิดขึ้นหรือได้มีการพยายามฆ่าตนเอง ต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
มาตรา ๒๙๔ ผู้ใดเข้าร่วมในการชุลมุนต่อสู้ระหว่างบุคคลตั้งแต่สามคนขึ้นไป และบุคคลหนึ่งบุคคลใดไม่ว่าจะเป็นผู้ที่เข้าร่วมในการนั้นหรือไม่ ถึงแก่ความตายโดยการกระทำในการชุลมุนต่อสู้นั้น ต้องระวางโทษจำคุกไม่เกินสองปี หรือปรับไม่เกินสี่หมื่นบาท หรือทั้งจำทั้งปรับ
ถ้าผู้ที่เข้าร่วมในการชุลมุนต่อสู้นั้นแสดงได้ว่า ได้กระทำไป เพื่อห้ามการชุลมุนต่อสู้นั้น หรือเพื่อป้องกันโดยชอบด้วยกฎหมาย ผู้นั้นไม่ต้องรับโทษ
หมวด ๒
ความผิดต่อร่างกาย
มาตรา ๒๙๕ ผู้ใดทำร้ายผู้อื่นจนเป็นเหตุให้เกิดอันตรายแก่กาย หรือจิตใจของผู้อื่นนั้น ผู้นั้นกระทำความผิดฐานทำร้ายร่างกาย ต้องระวางโทษจำคุกไม่เกินสองปี หรือปรับไม่เกินสี่หมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๒๙๖ ผู้ใดกระทำความผิดฐานทำร้ายร่างกาย ถ้าความผิดนั้น มีลักษณะประการหนึ่งประการใดดังที่บัญญัติไว้ในมาตรา ๒๘๙ ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๒๙๗ ผู้ใดกระทำความผิดฐานทำร้ายร่างกายจนเป็นเหตุให้ผู้ถูกกระทำร้ายรับอันตรายสาหัส ต้องระวางโทษจำคุกตั้งแต่หกเดือนถึงสิบปี และปรับตั้งแต่หนึ่งหมื่นบาทถึงสองแสนบาท
อันตรายสาหัสนั้น คือ
(๑) ตาบอด หูหนวก ลิ้นขาด หรือเสียฆานประสาท
(๒) เสียอวัยวะสืบพันธุ์หรือความสามารถสืบพันธุ์
(๓) เสียแขน ขา มือ เท้า นิ้วหรืออวัยวะอื่นใด
(๔) หน้าเสียโฉมอย่างติดตัว
(๕) แท้งลูก
(๖) จิตพิการอย่างติดตัว
(๗) ทุพพลภาพ หรือป่วยเจ็บเรื้อรังซึ่งอาจถึงตลอดชีวิต
(๘) ทุพพลภาพหรือป่วยเจ็บด้วยอาการทุกขเวทนาเกินกว่ายี่สิบวัน หรือจนประกอบกรณียกิจตามปกติไม่ได้เกินกว่ายี่สิบวัน
มาตรา ๒๙๘ ผู้ใดกระทำความผิดตามมาตรา ๒๙๗ ถ้าความผิดนั้นมีลักษณะประการหนึ่งประการใดดังที่บัญญัติไว้ในมาตรา ๒๘๙ ต้องระวางโทษจำคุกตั้งแต่สองปีถึงสิบปี และปรับตั้งแต่สี่หมื่นบาทถึงสองแสนบาท
มาตรา ๒๙๙ ผู้ใดเข้าร่วมในการชุลมุนต่อสู้ระหว่างบุคคลแต่สามคนขึ้นไป และบุคคลหนึ่งบุคคลใดไม่ว่าจะเป็นผู้ที่เข้าร่วมในการนั้นหรือไม่รับอันตรายสาหัส โดยการกระทำในการชุลมุนต่อสู้นั้น ต้องระวางโทษจำคุกไม่เกินหนึ่งปี หรือปรับไม่เกินสองหมื่นบาท หรือทั้งจำทั้งปรับ
ถ้าผู้ที่เข้าร่วมในการชุลมุนต่อสู้นั้นแสดงได้ว่า ได้กระทำไปเพื่อห้ามการชุลมุนต่อสู้นั้น หรือเพื่อป้องกันโดยชอบด้วยกฎหมาย ผู้นั้นไม่ต้องรับโทษ
มาตรา ๓๐๐ ผู้ใดกระทำโดยประมาท และการกระทำนั้นเป็นเหตุให้ผู้อื่นรับอันตรายสาหัส ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
หมวด ๓
ความผิดฐานทำให้แท้งลูก
มาตรา ๓๐๑ หญิงใดทำให้ตนเองแท้งลูกหรือยอมให้ผู้อื่นทำให้ตนแท้งลูกขณะมีอายุครรภ์เกินสิบสองสัปดาห์ ต้องระวางโทษจำคุกไม่เกินหกเดือน หรือปรับไม่เกินหนึ่งหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๐๒ ผู้ใดทำให้หญิงแท้งลูกโดยหญิงนั้นยินยอม ต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
ถ้าการกระทำนั้นเป็นเหตุให้หญิงรับอันตรายสาหัสอย่างอื่นด้วย ผู้กระทำต้องระวางโทษจำคุกไม่เกินเจ็ดปี หรือปรับไม่เกินหนึ่งแสนสี่หมื่นบาท หรือทั้งจำทั้งปรับ
ถ้าการกระทำนั้นเป็นเหตุให้หญิงถึงแก่ความตาย ผู้กระทำต้องระวางโทษจำคุกไม่เกินสิบปี และปรับไม่เกินสองแสนบาท
มาตรา ๓๐๓ ผู้ใดทำให้หญิงแท้งลูกโดยหญิงนั้นไม่ยินยอม ต้องระวางโทษจำคุกไม่เกินเจ็ดปี หรือปรับไม่เกินหนึ่งแสนสี่หมื่นบาท หรือทั้งจำทั้งปรับ
ถ้าการกระทำนั้นเป็นเหตุให้หญิงรับอันตรายสาหัสอย่างอื่นด้วย ผู้กระทำต้องระวางโทษจำคุกตั้งแต่หนึ่งปีถึงสิบปี และปรับตั้งแต่สองหมื่นบาทถึงสองแสนบาท
ถ้าการกระทำนั้นเป็นเหตุให้หญิงถึงแก่ความตาย ผู้กระทำต้องระวางโทษจำคุกตั้งแต่ห้าปีถึงยี่สิบปี และปรับตั้งแต่หนึ่งแสนบาทถึงสี่แสนบาท
มาตรา ๓๐๔ ผู้ใดเพียงแต่พยายามกระทำความผิดตามมาตรา ๓๐๑ หรือมาตรา ๓๐๒ วรรคแรก ผู้นั้นไม่ต้องรับโทษ
มาตรา ๓๐๕ ถ้าการกระทำความผิดตามมาตรา ๓๐๑ หรือมาตรา ๓๐๒ เป็นการกระทำของผู้ประกอบวิชาชีพเวชกรรมและตามหลักเกณฑ์ของแพทยสภาในกรณีดังต่อไปนี้ ผู้กระทำไม่มีความผิด
(๑) จำเป็นต้องกระทำเนื่องจากหากหญิงตั้งครรภ์ต่อไปจะเสี่ยงต่อการได้รับอันตรายต่อสุขภาพทางกายหรือจิตใจของหญิงนั้น 
(๒) จำเป็นต้องกระทำเนื่องจากมีความเสี่ยงอย่างมากหรือมีเหตุผลทางการแพทย์อันควรเชื่อได้ว่าหากทารกคลอดออกมาจะมีความผิดปกติถึงขนาดทุพพลภาพอย่างร้ายแรง 
(๓) หญิงยืนยันต่อผู้ประกอบวิชาชีพเวชกรรมว่าตนมีครรภ์เนื่องจากมีการกระทำความผิดเกี่ยวกับเพศ 
(๔) หญิงซึ่งมีอายุครรภ์ไม่เกินสิบสองสัปดาห์ยืนยันที่จะยุติการตั้งครรภ์ 
(๕) หญิงซึ่งมีอายุครรภ์เกินสิบสองสัปดาห์ แต่ไม่เกินยี่สิบสัปดาห์ ยืนยันที่จะยุติการตั้งครรภ์ภายหลังการตรวจและรับคำปรึกษาทางเลือกจากผู้ประกอบวิชาชีพเวชกรรมและผู้ประกอบวิชาชีพอื่นตามหลักเกณฑ์และวิธีการที่รัฐมนตรีว่าการกระทรวงสาธารณสุขประกาศกำหนดโดยคำแนะนำของแพทยสภาและหน่วยงานที่เกี่ยวข้องตามกฎหมายว่าด้วยการป้องกันและแก้ไขปัญหาการตั้งครรภ์ในวัยรุ่น 
หมวด ๔
ความผิดฐานทอดทิ้งเด็ก คนป่วยเจ็บหรือคนชรา
มาตรา ๓๐๖ ผู้ใดทอดทิ้งเด็กอายุยังไม่เกินเก้าปีไว้ ณ ที่ใด เพื่อให้เด็กนั้นพ้นไปเสียจากตน โดยประการที่ทำให้เด็กนั้นปราศจากผู้ดูแล ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๐๗ ผู้ใดมีหน้าที่ตามกฎหมายหรือตามสัญญาต้องดูแลผู้ซึ่งพึ่งตนเองมิได้ เพราะอายุ ความป่วยเจ็บ กายพิการหรือจิตพิการ ทอดทิ้งผู้ซึ่งพึ่งตนเองมิได้นั้นเสียโดยประการที่น่าจะเป็นเหตุให้เกิดอันตรายแก่ชีวิต ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๐๘ ถ้าการกระทำความผิดตามมาตรา ๓๐๖ หรือมาตรา ๓๐๗ เป็นเหตุให้ผู้ถูกทอดทิ้งถึงแก่ความตายหรือรับอันตรายสาหัส ผู้กระทำต้องระวางโทษดังที่บัญญัติไว้ในมาตรา ๒๙๐ มาตรา ๒๙๗ หรือมาตรา ๒๙๘ นั้น
ลักษณะ ๑๑
ความผิดเกี่ยวกับเสรีภาพและชื่อเสียง
หมวด ๑
ความผิดต่อเสรีภาพ
มาตรา ๓๐๙ ผู้ใดข่มขืนใจผู้อื่นให้กระทำการใด ไม่กระทำการใด หรือจำยอมต่อสิ่งใด โดยทำให้กลัวว่าจะเกิดอันตรายต่อชีวิต ร่างกาย เสรีภาพ ชื่อเสียงหรือทรัพย์สินของผู้ถูกข่มขืนใจนั้นเองหรือของผู้อื่น หรือโดยใช้กำลังประทุษร้ายจนผู้ถูกข่มขืนใจต้องกระทำการนั้น ไม่กระทำการนั้นหรือจำยอมต่อสิ่งนั้น ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาทหรือทั้งจำทั้งปรับ
ถ้าความผิดตามวรรคแรกได้กระทำโดยมีอาวุธ หรือโดยร่วมกระทำความผิดด้วยกันตั้งแต่ห้าคนขึ้นไป หรือได้กระทำเพื่อให้ผู้ถูกข่มขืนใจทำ ถอน ทำให้เสียหาย หรือทำลายเอกสารสิทธิอย่างใด ผู้กระทำต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
ถ้ากระทำโดยอ้างอำนาจอั้งยี่หรือซ่องโจร ไม่ว่าอั้งยี่หรือซ่องโจรนั้นจะมีอยู่หรือไม่ ผู้กระทำต้องระวางโทษจำคุกตั้งแต่หนึ่งปีถึงเจ็ดปี และปรับตั้งแต่สองหมื่นบาทถึงหนึ่งแสนสี่หมื่นบาท
มาตรา ๓๑๐ ผู้ใดหน่วงเหนี่ยวหรือกักขังผู้อื่น หรือกระทำด้วยประการใดให้ผู้อื่นปราศจากเสรีภาพในร่างกาย ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาทหรือทั้งจำทั้งปรับ
ถ้าการกระทำความผิดตามวรรคแรก เป็นเหตุให้ผู้ถูกหน่วงเหนี่ยวถูกกักขังหรือต้องปราศจากเสรีภาพในร่างกายนั้นถึงแก่ความตาย หรือรับอันตรายสาหัส ผู้กระทำต้องระวางโทษดังที่บัญญัติไว้ในมาตรา ๒๙๐ มาตรา ๒๙๗ หรือมาตรา ๒๙๘ นั้น
มาตรา ๓๑๐ ทวิ  ผู้ใดหน่วงเหนี่ยวหรือกักขังผู้อื่น หรือกระทำด้วยประการใดให้ผู้อื่นปราศจากเสรีภาพในร่างกาย และให้ผู้อื่นนั้นกระทำการใดให้แก่ผู้กระทำหรือบุคคลอื่น ต้องระวางโทษ จำคุกไม่เกินห้าปี และปรับไม่เกินหนึ่งแสนบาท
มาตรา ๓๑๑ ผู้ใดกระทำโดยประมาท และการกระทำนั้นเป็นเหตุให้ผู้อื่นถูกหน่วงเหนี่ยว ถูกกักขังหรือต้องปราศจากเสรีภาพในร่างกาย ต้องระวางโทษจำคุกไม่เกินหนึ่งปี หรือปรับไม่เกินสองหมื่นบาท หรือทั้งจำทั้งปรับ
ถ้าการกระทำความผิดตามวรรคแรก เป็นเหตุให้ผู้ถูกหน่วงเหนี่ยวถูกกักขัง หรือต้องปราศจากเสรีภาพในร่างกายนั้นถึงแก่ความตายหรือรับอันตรายสาหัส ผู้กระทำต้องระวางโทษดังที่บัญญัติไว้ในมาตรา ๒๙๑ หรือมาตรา ๓๐๐
มาตรา ๓๑๒ ผู้ใดเพื่อจะเอาคนลงเป็นทาส หรือให้มีฐานะคล้ายทาส นำเข้าในหรือส่งออกไปนอกราชอาณาจักร พามาจากที่ใด ซื้อ ขาย จำหน่าย รับหรือหน่วงเหนี่ยวซึ่งบุคคลหนึ่งบุคคลใด ต้องระวางโทษจำคุกไม่เกินเจ็ดปี และปรับไม่เกินหนึ่งแสนสี่หมื่นบาท
มาตรา ๓๑๒ ทวิ ถ้าการกระทำความผิดตามมาตรา ๓๑๐ ทวิ หรือมาตรา ๓๑๒ เป็นการกระทำต่อเด็กอายุไม่เกินสิบห้าปี ผู้กระทำต้องระวางโทษ จำคุกตั้งแต่สามปีถึงสิบปี และปรับไม่เกินสองแสนบาท
ถ้าการกระทำความผิดตามวรรคแรก หรือมาตรา ๓๑๐ ทวิ หรือมาตรา ๓๑๒ เป็นเหตุให้ผู้ถูกกระทำ
(๑) รับอันตรายแก่กายหรือจิตใจ ผู้กระทำต้องระวางโทษจำคุกตั้งแต่ห้าปีถึงสิบห้าปี และปรับไม่เกินสามแสนบาท
(๒) รับอันตรายสาหัส ผู้กระทำต้องระวางโทษจำคุกตลอดชีวิต หรือจำคุกตั้งแต่เจ็ดปีถึงยี่สิบปี
(๓) ถึงแก่ความตาย ผู้กระทำต้องระวางโทษประหารชีวิต จำคุกตลอดชีวิตหรือจำคุกตั้งแต่สิบห้าปีถึงยี่สิบปี
มาตรา ๓๑๒ ตรี  ผู้ใดโดยทุจริตรับไว้ จำหน่าย เป็นธุระจัดหา ล่อไป หรือพาไปซึ่งบุคคลอายุเกินสิบห้าปีแต่ยังไม่เกินสิบแปดปี แม้ผู้นั้นจะยินยอมก็ตาม ต้องระวางโทษ จำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
ถ้าการกระทำความผิดตามวรรคแรกเป็นการกระทำแก่เด็กอายุยังไม่เกินสิบห้าปี ผู้กระทำต้องระวางโทษจำคุกไม่เกินเจ็ดปี หรือปรับไม่เกินหนึ่งแสนสี่หมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๑๓ ผู้ใดเพื่อให้ได้มาซึ่งค่าไถ่
(๑) เอาตัวเด็กอายุไม่เกินสิบห้าปีไป
(๒) เอาตัวบุคคลอายุกว่าสิบห้าปีไป โดยใช้อุบายหลอกลวง ขู่เข็ญ ใช้กำลังประทุษร้าย ใช้อำนาจครอบงำผิดคลองธรรม หรือใช้วิธีข่มขืนใจด้วยประการอื่นใด หรือ
(๓) หน่วงเหนี่ยวหรือกักขังบุคคลใด
ต้องระวางโทษ จำคุกตั้งแต่สิบห้าปีถึงยี่สิบปี และปรับตั้งแต่สามแสนบาทถึงสี่แสนบาท หรือจำคุกตลอดชีวิต หรือประหารชีวิต
ถ้าการกระทำความผิดตามวรรคแรกเป็นเหตุให้ผู้ถูกเอาตัวไป ผู้ถูกหน่วงเหนี่ยว หรือผู้ถูกกักขังนั้นรับอันตรายสาหัส หรือเป็นการกระทำโดยทรมาน หรือโดยทารุณโหดร้าย จนเป็นเหตุให้ผู้ถูกกระทำนั้นรับอันตรายแก่กาย หรือจิตใจ ผู้กระทำต้องระวางโทษประหารชีวิตหรือจำคุกตลอดชีวิต
ถ้าการกระทำความผิดนั้นเป็นเหตุให้ผู้ถูกเอาตัวไป ผู้ถูกหน่วงเหนี่ยว หรือผู้ถูกกักขังนั้นถึงแก่ความตาย ผู้กระทำต้องระวางโทษประหารชีวิต
มาตรา ๓๑๔ ผู้ใดเป็นผู้สนับสนุนในการกระทำความผิดตามมาตรา ๓๑๓ ต้องระวางโทษเช่นเดียวกับตัวการในความผิดนั้น
มาตรา ๓๑๕ ผู้ใดกระทำการเป็นคนกลาง โดยเรียก รับหรือยอมจะรับทรัพย์สินหรือประโยชน์อย่างใดที่มิควรได้จากผู้กระทำความผิดตามมาตรา ๓๑๓ หรือจากผู้ที่จะให้ค่าไถ่ ต้องระวางโทษ จำคุกตั้งแต่สิบห้าปีถึงยี่สิบปี และปรับตั้งแต่สามแสนบาทถึงสี่แสนบาท หรือจำคุกตลอดชีวิต
มาตรา ๓๑๖ ถ้าผู้กระทำความผิดตามมาตรา ๓๑๓ มาตรา ๓๑๔ หรือมาตรา ๓๑๕ จัดให้ผู้ถูกเอาตัวไป ผู้ถูกหน่วงเหนี่ยวหรือผู้ถูกกักขังได้รับเสรีภาพก่อนศาลชั้นต้นพิพากษา โดยผู้นั้นมิได้รับอันตรายสาหัสหรือตกอยู่ในภาวะอันใกล้จะเป็นอันตรายต่อชีวิต ให้ลงโทษน้อยกว่าที่กฎหมายกำหนดไว้ แต่ไม่น้อยกว่ากึ่งหนึ่ง
มาตรา ๓๑๗ ผู้ใดโดยปราศจากเหตุอันสมควร พรากเด็กอายุยังไม่เกินสิบห้าปีไปเสียจากบิดามารดา ผู้ปกครอง หรือผู้ดูแล ต้องระวางโทษ จำคุกตั้งแต่สามปีถึงสิบห้าปี และปรับตั้งแต่หกหมื่นบาทถึงสามแสนบาท
ผู้ใดโดยทุจริต ซื้อ จำหน่าย หรือรับตัวเด็กซึ่งถูกพรากตามวรรคแรก ต้องระวางโทษเช่นเดียวกับผู้พรากนั้น
ถ้าความผิดตามมาตรานี้ได้กระทำเพื่อหากำไร หรือเพื่อการอนาจาร ผู้กระทำต้องระวางโทษจำคุกตั้งแต่ห้าปีถึงยี่สิบปี และปรับตั้งแต่หนึ่งแสนบาทถึงสี่แสนบาท
มาตรา ๓๑๘ ผู้ใดพรากผู้เยาว์อายุกว่าสิบห้าปี แต่ยังไม่เกินสิบแปดปีไปเสียจากบิดามารดา ผู้ปกครอง หรือผู้ดูแล โดยผู้เยาว์นั้นไม่เต็มใจไปด้วย ต้องระวางโทษจำคุกตั้งแต่สองปีถึงสิบปี และปรับตั้งแต่สี่หมื่นบาทถึงสองแสนบาท
ผู้ใดโดยทุจริต ซื้อ จำหน่าย หรือรับตัวผู้เยาว์ซึ่งถูกพรากตามวรรคแรก ต้องระวางโทษเช่นเดียวกับผู้พรากนั้น
ถ้าความผิดตามมาตรานี้ได้กระทำเพื่อหากำไร หรือเพื่อการอนาจาร ผู้กระทำต้องระวางโทษ จำคุกตั้งแต่สามปีถึงสิบห้าปี และปรับตั้งแต่หกหมื่นบาทถึงสามแสนบาท
มาตรา ๓๑๙ ผู้ใดพรากผู้เยาว์อายุกว่าสิบห้าปี แต่ยังไม่เกินสิบแปดปีไปเสียจากบิดามารดา ผู้ปกครอง หรือผู้ดูแล เพื่อหากำไรหรือเพื่อการอนาจาร โดยผู้เยาว์นั้นเต็มใจไปด้วย ต้องระวางโทษ จำคุกตั้งแต่สองปีถึงสิบปี และปรับตั้งแต่สี่หมื่นบาทถึงสองแสนบาท
ผู้ใดโดยทุจริต ซื้อ จำหน่าย หรือรับตัวผู้เยาว์ซึ่งถูกพรากตามวรรคแรก ต้องระวางโทษเช่นเดียวกับผู้พรากนั้น
มาตรา ๓๒๐ ผู้ใดใช้อุบายหลอกลวง ขู่เข็ญ ใช้กำลังประทุษร้าย ใช้อำนาจครอบงำผิดคลองธรรม หรือใช้วิธีข่มขืนใจด้วยประการอื่นใด พาหรือส่งคนออกไปนอกราชอาณาจักร ต้องระวางโทษ จำคุกตั้งแต่สองปีถึงสิบปี หรือปรับตั้งแต่สี่หมื่นบาทถึงสองแสนบาท หรือทั้งจำทั้งปรับ
ถ้าการกระทำความผิดตามวรรคแรกได้กระทำเพื่อให้ผู้ถูกพาหรือส่งไปนั้นตกอยู่ในอำนาจของผู้อื่นโดยมิชอบด้วยกฎหมาย หรือเพื่อละทิ้งให้เป็นคนอนาถา ผู้กระทำต้องระวางโทษจำคุกตั้งแต่สามปีถึงสิบห้าปี และปรับตั้งแต่หกหมื่นบาทถึงสามแสนบาท
มาตรา ๓๒๑ ความผิดตามมาตรา ๓๐๙ วรรคแรก มาตรา ๓๑๐ วรรคแรก และมาตรา ๓๑๑ วรรคแรก เป็นความผิดอันยอมความได้
มาตรา ๓๒๑/๑ การกระทำความผิดตามมาตรา ๓๑๒ ตรี วรรคสอง และมาตรา ๓๑๗ หากเป็นการกระทำต่อเด็กอายุไม่เกินสิบสามปี ห้ามอ้างความไม่รู้อายุของเด็กเพื่อให้พ้นจากความผิดนั้น
หมวด ๒
ความผิดฐานเปิดเผยความลับ
มาตรา ๓๒๒ ผู้ใดเปิดผนึกหรือเอาจดหมาย โทรเลขหรือเอกสารใด ๆ ซึ่งปิดผนึกของผู้อื่นไป เพื่อล่วงรู้ข้อความก็ดี เพื่อนำข้อความในจดหมายโทรเลขหรือเอกสารเช่นว่านั้นออกเปิดเผยก็ดี ถ้าการกระทำนั้นน่าจะเกิดความเสียหายแก่ผู้หนึ่งผู้ใด ต้องระวางโทษจำคุกไม่เกินหกเดือน หรือปรับไม่เกินหนึ่งหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๒๓ ผู้ใดล่วงรู้หรือได้มาซึ่งความลับของผู้อื่นโดยเหตุที่เป็นเจ้าพนักงานผู้มีหน้าที่ โดยเหตุที่ประกอบอาชีพเป็นแพทย์ เภสัชกร คนจำหน่ายยา นางผดุงครรภ์ ผู้พยาบาล นักบวช หมอความ ทนายความหรือผู้สอบบัญชี หรือโดยเหตุที่เป็นผู้ช่วยในการประกอบอาชีพนั้น แล้วเปิดเผยความลับนั้นในประการที่น่าจะเกิดความเสียหายแก่ผู้หนึ่งผู้ใด ต้องระวางโทษจำคุกไม่เกินหกเดือน หรือปรับไม่เกินหนึ่งหมื่นบาท หรือทั้งจำทั้งปรับ
ผู้รับการศึกษาอบรมในอาชีพดังกล่าวในวรรคแรก เปิดเผยความลับของผู้อื่น อันตนได้ล่วงรู้หรือได้มาในการศึกษาอบรมนั้น ในประการที่น่าจะเกิดความเสียหายแก่ผู้หนึ่งผู้ใด ต้องระวางโทษเช่นเดียวกัน
มาตรา ๓๒๔ ผู้ใดโดยเหตุที่ตนมีตำแหน่งหน้าที่ วิชาชีพหรืออาชีพอันเป็นที่ไว้วางใจ ล่วงรู้หรือได้มาซึ่งความลับของผู้อื่นเกี่ยวกับอุตสาหกรรม การค้นพบ หรือการนิมิตในวิทยาศาสตร์ เปิดเผยหรือใช้ความลับนั้นเพื่อประโยชน์ตนเองหรือผู้อื่น ต้องระวางโทษจำคุกไม่เกินหกเดือน หรือปรับไม่เกินหนึ่งหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๒๕ ความผิดในหมวดนี้เป็นความผิดอันยอมความได้
หมวด ๓
ความผิดฐานหมิ่นประมาท
มาตรา ๓๒๖ ผู้ใดใส่ความผู้อื่นต่อบุคคลที่สาม โดยประการที่น่าจะทำให้ผู้อื่นนั้นเสียชื่อเสียง ถูกดูหมิ่น หรือถูกเกลียดชัง ผู้นั้นกระทำความผิดฐานหมิ่นประมาท ต้องระวางโทษจำคุกไม่เกินหนึ่งปี หรือปรับไม่เกินสองหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๒๗ ผู้ใดใส่ความผู้ตายต่อบุคคลที่สามและการใส่ความนั้นน่าจะเป็นเหตุให้ บิดา มารดา คู่สมรสหรือบุตรของผู้ตายเสียชื่อเสียง ถูกดูหมิ่นหรือถูกเกลียดชัง ผู้นั้นกระทำความผิดฐานหมิ่นประมาท ต้องระวางโทษดังบัญญัติไว้ในมาตรา ๓๒๖ นั้น
มาตรา ๓๒๘ ถ้าความผิดฐานหมิ่นประมาทได้กระทำโดยการโฆษณาด้วยเอกสาร ภาพวาด ภาพระบายสี ภาพยนตร์ ภาพหรือตัวอักษรที่ทำให้ปรากฏไม่ว่าด้วยวิธีใด ๆ แผ่นเสียง หรือสิ่งบันทึกเสียง บันทึกภาพ หรือบันทึกอักษร กระทำโดยการกระจายเสียง หรือการกระจายภาพ หรือโดยกระทำการป่าวประกาศด้วยวิธีอื่น ผู้กระทำต้องระวางโทษจำคุกไม่เกินสองปี และปรับไม่เกินสองแสนบาท
  ผู้ใดแสดงความคิดเห็นหรือข้อความใดโดยสุจริต
(๑) เพื่อความชอบธรรม ป้องกันตนหรือป้องกันส่วนได้เสียเกี่ยวกับตนตามคลองธรรม
(๒) ในฐานะเป็นเจ้าพนักงานปฏิบัติการตามหน้าที่
     (๓) ติชมด้วยความเป็นธรรม ซึ่งบุคคลหรือสิ่งใดอันเป็นวิสัยของประชาชนย่อมกระทำ หรือ
(๔) ในการแจ้งข่าวด้วยความเป็นธรรมเรื่องการดำเนินการอันเปิดเผยในศาลหรือในการประชุมผู้นั้นไม่มีความผิดฐานหมิ่นประมาท
มาตรา ๓๓๐ ในกรณีหมิ่นประมาท ถ้าผู้ถูกหาว่ากระทำความผิด พิสูจน์ได้ว่าข้อที่หาว่าเป็นหมิ่นประมาทนั้นเป็นความจริง ผู้นั้นไม่ต้องรับโทษ
แต่ห้ามไม่ให้พิสูจน์ ถ้าข้อที่หาว่าเป็นหมิ่นประมาทนั้นเป็นการใส่ความในเรื่องส่วนตัว และการพิสูจน์จะไม่เป็นประโยชน์แก่ประชาชน
มาตรา ๓๓๑ คู่ความ หรือทนายความของคู่ความ ซึ่งแสดงความคิดเห็น หรือข้อความในกระบวนพิจารณาคดีในศาล เพื่อประโยชน์แก่คดีของตน ไม่มีความผิดฐานหมิ่นประมาท
มาตรา ๓๓๒ ในคดีหมิ่นประมาทซึ่งมีคำพิพากษาว่าจำเลยมีความผิด ศาลอาจสั่ง
(๑) ให้ยึด และทำลายวัตถุหรือส่วนของวัตถุที่มีข้อความหมิ่นประมาท
(๒) ให้โฆษณาคำพิพากษาทั้งหมด หรือแต่บางส่วนในหนังสือพิมพ์หนึ่งฉบับหรือหลายฉบับ ครั้งเดียวหรือหลายครั้ง โดยให้จำเลยเป็นผู้ชำระค่าโฆษณา
มาตรา ๓๓๓ ความผิดในหมวดนี้เป็นความผิดอันยอมความได้
ถ้าผู้เสียหายในความผิดฐานหมิ่นประมาทตายเสียก่อนร้องทุกข์ ให้บิดา มารดา คู่สมรสหรือบุตรของผู้เสียหายร้องทุกข์ได้ และให้ถือว่าเป็นผู้เสียหาย
ลักษณะ ๑
ความผิดเกี่ยวกับทรัพย์
หมวด ๑
ความผิดฐานลักทรัพย์และวิ่งราวทรัพย์
มาตรา ๓๓๔ ผู้ใดเอาทรัพย์ของผู้อื่น หรือที่ผู้อื่นเป็นเจ้าของรวมอยู่ด้วยไปโดยทุจริต ผู้นั้นกระทำความผิดฐานลักทรัพย์ ต้องระวางโทษจำคุกไม่เกินสามปี และปรับไม่เกินหกหมื่นบาท
มาตรา ๓๓๕ ผู้ใดลักทรัพย์
(๑) ในเวลากลางคืน
(๒) ในที่หรือบริเวณที่มีเหตุเพลิงไหม้ การระเบิด อุทกภัย หรือในที่หรือบริเวณที่มีอุบัติเหตุ เหตุทุกขภัยแก่รถไฟ หรือยานพาหนะอื่นที่ประชาชนโดยสาร หรือภัยพิบัติอื่นทำนองเดียวกันหรืออาศัยโอกาสที่มีเหตุเช่นว่านั้น หรืออาศัยโอกาสที่ประชาชนกำลังตื่นกลัวภยันอันตรายใด ๆ
(๓) โดยทำอันตรายสิ่งกีดกั้นสำหรับคุ้มครองบุคคลหรือทรัพย์ หรือโดยผ่านสิ่งเช่นว่านั้นเข้าไปด้วยประการใด ๆ
(๔) โดยเข้าทางช่องทางซึ่งได้ทำขึ้นโดยไม่ได้จำนงให้เป็นทางคนเข้า หรือเข้าทางช่องทางซึ่งผู้เป็นใจเปิดไว้ให้
(๕) โดยแปลงตัวหรือปลอมตัวเป็นผู้อื่น มอมหน้าหรือทำด้วยประการอื่นเพื่อไม่ให้เห็นหรือจำหน้าได้
(๖) โดยลวงว่าเป็นเจ้าพนักงาน
(๗) โดยมีอาวุธ หรือโดยร่วมกระทำความผิดด้วยกันตั้งแต่สองคนขึ้นไป
(๘) ในเคหสถาน สถานที่ราชการหรือสถานที่ที่จัดไว้เพื่อให้บริการสาธารณที่ตนได้เข้าไปโดยไม่ได้รับอนุญาต หรือซ่อนตัวอยู่ในสถานที่นั้น ๆ
(๙) ในสถานที่บูชาสาธารณ สถานีรถไฟ ท่าอากาศยานที่จอดรถหรือเรือสาธารณะ สาธารณสถานสำหรับขนถ่ายสินค้า หรือในยวดยานสาธารณะ
(๑๐) ที่ใช้หรือมีไว้เพื่อสาธารณประโยชน์
(๑๑) ที่เป็นของนายจ้างหรือที่อยู่ในความครอบครองของนายจ้าง
(๑๒) ที่เป็นของผู้มีอาชีพกสิกรรม บรรดาที่เป็นผลิตภัณฑ์ พืชพันธุ์ สัตว์หรือเครื่องมืออันมีไว้สำหรับประกอบกสิกรรมหรือได้มาจากการกสิกรรมนั้น
ต้องระวางโทษ จำคุกตั้งแต่หนึ่งปีถึงห้าปี และปรับตั้งแต่สองหมื่นบาทถึงหนึ่งแสนบาท
ถ้าความผิดตามวรรคแรกเป็นการกระทำที่ประกอบด้วยลักษณะดังที่บัญญัติไว้ในอนุมาตราดังกล่าวแล้วตั้งแต่สองอนุมาตราขึ้นไป ผู้กระทำต้องระวางโทษจำคุกตั้งแต่หนึ่งปีถึงเจ็ดปี และปรับตั้งแต่สองหมื่นบาทถึงหนึ่งแสนสี่หมื่นบาท
ถ้าความผิดตามวรรคแรกเป็นการกระทำต่อทรัพย์ที่เป็นโค กระบือ เครื่องกลหรือเครื่องจักรที่ผู้มีอาชีพกสิกรรมมีไว้สำหรับประกอบกสิกรรม ผู้กระทำต้องระวางโทษจำคุกตั้งแต่สามปีถึงสิบปี และปรับตั้งแต่หกหมื่นบาทถึงสองแสนบาท 	
ถ้าการกระทำความผิดดังกล่าวในมาตรานี้ เป็นการกระทำโดยความจำใจหรือความยากจนเหลือทนทาน และทรัพย์นั้นมีราคาเล็กน้อย ศาลจะลงโทษผู้กระทำความผิดดังที่บัญญัติไว้ในมาตรา ๓๓๔ ก็ได้
มาตรา ๓๓๕ ทวิ ผู้ใดลักทรัพย์ที่เป็นพระพุทธรูปหรือวัตถุในทางศาสนา ถ้าทรัพย์นั้นเป็นที่สักการะบูชาของประชาชน หรือเก็บรักษาไว้เป็นสมบัติของชาติ หรือส่วนหนึ่งส่วนใดของพระพุทธรูป หรือวัตถุดังกล่าว ต้องระวางโทษ จำคุกตั้งแต่สามปีถึงสิบปี และปรับตั้งแต่หกหมื่นบาทถึงสองแสนบาท
ถ้าการกระทำความผิดตามวรรคแรก ได้กระทำในวัด สำนักสงฆ์ สถานอันเป็นที่เคารพในทางศาสนา โบราณสถานอันเป็นทรัพย์สินของแผ่นดิน สถานที่ราชการหรือพิพิธภัณฑสถานแห่งชาติ ผู้กระทำต้องระวางโทษจำคุกตั้งแต่ห้าปีถึงสิบห้าปี และปรับตั้งแต่หนึ่งแสนบาทถึงสามแสนบาท
มาตรา ๓๓๖ ผู้ใดลักทรัพย์โดยฉกฉวยเอาซึ่งหน้า ผู้นั้นกระทำความผิดฐานวิ่งราวทรัพย์ ต้องระวางโทษจำคุกไม่เกินห้าปี และปรับไม่เกินหนึ่งแสนบาท
ถ้าการวิ่งราวทรัพย์เป็นเหตุให้ผู้อื่นรับอันตรายแก่กายหรือจิตใจ ผู้กระทำต้องระวางโทษจำคุกตั้งแต่สองปีถึงเจ็ดปี และปรับตั้งแต่สี่หมื่นบาทถึงหนึ่งแสนสี่หมื่นบาท
ถ้าการวิ่งราวทรัพย์เป็นเหตุให้ผู้อื่นรับอันตรายสาหัส ผู้กระทำต้องระวางโทษจำคุกตั้งแต่สามปีถึงสิบปี และปรับตั้งแต่หกหมื่นบาทถึงสองแสนบาท
ถ้าการวิ่งราวทรัพย์เป็นเหตุให้ผู้อื่นถึงแก่ความตาย ผู้กระทำต้องระวางโทษจำคุกตั้งแต่ห้าปีถึงสิบห้าปี และปรับตั้งแต่หนึ่งแสนบาทถึงสามแสนบาท
มาตรา ๓๓๖ ทวิ ผู้ใดกระทำความผิดตามมาตรา ๓๓๔ มาตรา ๓๓๕ มาตรา ๓๓๕ ทวิ หรือ มาตรา ๓๓๖ โดยแต่งเครื่องแบบทหารหรือตำรวจหรือแต่งกายให้เข้าใจว่าเป็นทหารหรือตำรวจหรือโดยมีหรือใช้อาวุธปืนหรือวัตถุระเบิด หรือโดยใช้ยานพาหนะเพื่อสะดวกแก่การกระทำผิดหรือการพาทรัพย์นั้นไป หรือเพื่อให้พ้นการจับกุม ต้องระวางโทษหนักกว่าที่บัญญัติไว้ในมาตรานั้น ๆ กึ่งหนึ่ง
หมวด ๒
ความผิดฐานกรรโชก รีดเอาทรัพย์ ชิงทรัพย์และปล้นทรัพย์
มาตรา ๓๓๗ ผู้ใดข่มขืนใจผู้อื่นให้ยอมให้หรือยอมจะให้ตนหรือผู้อื่นได้ประโยชน์ในลักษณะที่เป็นทรัพย์สินโดยใช้กำลังประทุษร้ายหรือโดยขู่เข็ญว่าจะทำอันตรายต่อชีวิต ร่างกาย เสรีภาพ ชื่อเสียงหรือทรัพย์สินของผู้ถูกขู่เข็ญหรือของบุคคลที่สาม จนผู้ถูกข่มขืนใจยอมเช่นว่านั้น ผู้นั้นกระทำความผิดฐานกรรโชก ต้องระวางโทษจำคุกไม่เกินห้าปี และปรับไม่เกินหนึ่งแสนบาท
ถ้าความผิดฐานกรรโชกได้กระทำโดย
(๑) ขู่ว่าจะฆ่า ขู่ว่าจะทำร้ายร่างกายให้ผู้ถูกข่มขืนใจหรือผู้อื่นให้ได้รับอันตรายสาหัส หรือขู่ว่าจะทำให้เกิดเพลิงไหม้แก่ทรัพย์ของผู้ถูกข่มขืนใจหรือผู้อื่น หรือ
(๒) มีอาวุธติดตัวมาขู่เข็ญ
ผู้กระทำต้องระวางโทษจำคุกตั้งแต่หกเดือนถึงเจ็ดปี และปรับตั้งแต่หนึ่งหมื่นบาทถึงหนึ่งแสนสี่หมื่นบาท
มาตรา ๓๓๘ ผู้ใดข่มขืนใจผู้อื่นให้ยอมให้หรือยอมจะให้ตนหรือผู้อื่นได้ประโยชน์ในลักษณะที่เป็นทรัพย์สินโดยขู่เข็ญว่าจะเปิดเผยความลับ ซึ่งการเปิดเผยนั้นจะทำให้ผู้ถูกขู่เข็ญหรือบุคคลที่สามเสียหาย จนผู้ถูกข่มขืนใจยอมเช่นว่านั้น ผู้นั้นกระทำความผิดฐานรีดเอาทรัพย์ ต้องระวางโทษจำคุกตั้งแต่หนึ่งปีถึงสิบปี และปรับตั้งแต่สองหมื่นบาทถึงสองแสนบาท
มาตรา ๓๓๙ ผู้ใดลักทรัพย์โดยใช้กำลังประทุษร้าย หรือขู่เข็ญว่าในทันใดนั้นจะใช้กำลังประทุษร้าย เพื่อ
(๑) ให้ความสะดวกแก่การลักทรัพย์หรือการพาทรัพย์นั้นไป
(๒) ให้ยื่นให้ซึ่งทรัพย์นั้น
(๓) ยึดถือเอาทรัพย์นั้นไว้
(๔) ปกปิดการกระทำความผิดนั้น หรือ
(๕) ให้พ้นจากการจับกุม
ผู้นั้นกระทำความผิดฐานชิงทรัพย์ ต้องระวางโทษ จำคุกตั้งแต่ห้าปีถึงสิบปี และปรับตั้งแต่หนึ่งแสนบาทถึงสองแสนบาท
ถ้าความผิดนั้นเป็นการกระทำที่ประกอบด้วยลักษณะดังที่บัญญัติไว้ในอนุมาตราหนึ่งอนุมาตราใดแห่งมาตรา ๓๓๕ หรือเป็นการกระทำต่อทรัพย์ที่เป็นโค กระบือ เครื่องกลหรือเครื่องจักรที่ผู้มีอาชีพกสิกรรมมีไว้สำหรับประกอบกสิกรรม ผู้กระทำต้องระวางโทษจำคุกตั้งแต่สิบปีถึงสิบห้าปี และปรับตั้งแต่สองแสนบาทถึงสามแสนบาท
ถ้าการชิงทรัพย์เป็นเหตุให้ผู้อื่นรับอันตรายแก่กายหรือจิตใจ ผู้กระทำต้องระวางโทษจำคุกตั้งแต่สิบปีถึงยี่สิบปี และปรับตั้งแต่สองแสนบาทถึงสี่แสนบาท
ถ้าการชิงทรัพย์เป็นเหตุให้ผู้อื่นรับอันตรายสาหัส ผู้กระทำต้องระวางโทษจำคุกตั้งแต่สิบห้าปีถึงยี่สิบปี และปรับตั้งแต่สามแสนบาทถึงสี่แสนบาท
ถ้าการชิงทรัพย์เป็นเหตุให้ผู้อื่นถึงแก่ความตาย ผู้กระทำต้องระวางโทษประหารชีวิตหรือจำคุกตลอดชีวิต
มาตรา ๓๓๙ ทวิ ถ้าการชิงทรัพย์ได้กระทำต่อทรัพย์ตามมาตรา ๓๓๕ ทวิ วรรคแรก ผู้กระทำต้องระวางโทษจำคุกตั้งแต่สิบปีถึงสิบห้าปี และปรับตั้งแต่สองแสนบาทถึงสามแสนบาท
ถ้าการชิงทรัพย์นั้นเป็นการกระทำในสถานที่ดังที่บัญญัติไว้ในมาตรา ๓๓๕ ทวิ วรรคสองด้วย ผู้กระทำต้องระวางโทษจำคุกตั้งแต่สิบปีถึงยี่สิบปี และปรับตั้งแต่สองแสนบาทถึงสี่แสนบาท
ถ้าการชิงทรัพย์ตามวรรคแรกหรือวรรคสองเป็นเหตุให้ผู้อื่นรับอันตรายแก่กายหรือจิตใจ ผู้กระทำต้องระวางโทษจำคุกตั้งแต่สิบห้าปีถึงยี่สิบปี และปรับตั้งแต่สามแสนบาทถึงสี่แสนบาท
ถ้าการชิงทรัพย์ตามวรรคแรกหรือวรรคสองเป็นเหตุให้ผู้อื่นรับอันตรายสาหัส ผู้กระทำต้องระวางโทษจำคุกตลอดชีวิต หรือจำคุกตั้งแต่สิบห้าปีถึงยี่สิบปี
ถ้าการชิงทรัพย์ตามวรรคแรกหรือวรรคสองเป็นเหตุให้ผู้อื่นถึงแก่ความตาย ผู้กระทำต้องระวางโทษประหารชีวิต
มาตรา ๓๔๐ ผู้ใดชิงทรัพย์โดยร่วมกันกระทำความผิดด้วยกันตั้งแต่สามคนขึ้นไป ผู้นั้นกระทำความผิดฐานปล้นทรัพย์ ต้องระวางโทษ จำคุกตั้งแต่สิบปีถึงสิบห้าปี และปรับตั้งแต่สองแสนบาทถึงสามแสนบาท
ถ้าในการปล้นทรัพย์ ผู้กระทำแม้แต่คนหนึ่งคนใดมีอาวุธติดตัวไปด้วย ผู้กระทำต้องระวางโทษจำคุกตั้งแต่สิบสองปีถึงยี่สิบปี และปรับตั้งแต่สองแสนสี่หมื่นบาทถึงสี่แสนบาท
ถ้าการปล้นทรัพย์เป็นเหตุให้ผู้อื่นรับอันตรายสาหัส ผู้กระทำต้องระวางโทษจำคุกตลอดชีวิต หรือจำคุกตั้งแต่สิบห้าปีถึงยี่สิบปี
ถ้าการปล้นทรัพย์ได้กระทำโดยแสดงความทารุณจนเป็นเหตุให้ผู้อื่นรับอันตรายแก่กายหรือจิตใจ ใช้ปืนยิง ใช้วัตถุระเบิด หรือกระทำทรมาน ผู้กระทำต้องระวางโทษจำคุกตลอดชีวิต หรือจำคุกตั้งแต่สิบห้าปีถึงยี่สิบปี
ถ้าการปล้นทรัพย์เป็นเหตุให้ผู้อื่นถึงแก่ความตาย ผู้กระทำต้องระวางโทษประหารชีวิต
มาตรา ๓๔๐ ทวิ ถ้าการปล้นทรัพย์ได้กระทำต่อทรัพย์ตามมาตรา ๓๓๕ ทวิ วรรคแรก ผู้กระทำต้องระวางโทษ จำคุกตั้งแต่สิบปีถึงยี่สิบปี และปรับตั้งแต่สองแสนบาทถึงสี่แสนบาท
ถ้าการปล้นทรัพย์นั้นเป็นการกระทำในสถานที่ดังที่บัญญัติไว้ในมาตรา ๓๓๕ ทวิ วรรคสองด้วย ผู้กระทำต้องระวางโทษจำคุกตั้งแต่สิบห้าปีถึงยี่สิบปี และปรับตั้งแต่สามแสนบาทถึงสี่แสนบาท
ถ้าการปล้นทรัพย์ตามวรรคแรกหรือวรรคสอง ผู้กระทำแม้แต่คนหนึ่งคนใดมีอาวุธติดตัวไปด้วย ผู้กระทำต้องระวางโทษจำคุกตลอดชีวิต หรือจำคุกตั้งแต่สิบห้าปีถึงยี่สิบปี
ถ้าการปล้นทรัพย์ตามวรรคแรกหรือวรรคสองเป็นเหตุให้ผู้อื่นรับอันตรายสาหัส ผู้กระทำต้องระวางโทษจำคุกตลอดชีวิต
ถ้าการปล้นทรัพย์ตามวรรคแรกหรือวรรคสองได้กระทำโดยแสดงความทารุณจนเป็นเหตุให้ผู้อื่นรับอันตรายแก่กายหรือจิตใจ ใช้ปืนยิง ใช้วัตถุระเบิดหรือกระทำทรมาน ผู้กระทำต้องระวางโทษประหารชีวิต หรือจำคุกตลอดชีวิต
ถ้าการปล้นทรัพย์ตามวรรคแรกหรือวรรคสองเป็นเหตุให้ผู้อื่นถึงแก่ความตาย ผู้กระทำต้องระวางโทษประหารชีวิต
มาตรา ๓๔๐ ตรี ผู้ใดกระทำความผิดตามมาตรา ๓๓๙ มาตรา ๓๓๙ ทวิมาตรา ๓๔๐ หรือมาตรา ๓๔๐ ทวิ โดยแต่งเครื่องแบบทหารหรือตำรวจหรือแต่งกายให้เข้าใจว่าเป็นทหารหรือตำรวจหรือโดยมีหรือใช้อาวุธปืนหรือวัตถุระเบิด หรือโดยใช้ยานพาหนะเพื่อกระทำผิด หรือพาทรัพย์นั้นไป หรือเพื่อให้พ้นการจับกุม ต้องระวางโทษหนักกว่าที่บัญญัติไว้ในมาตรานั้น ๆ กึ่งหนึ่ง
หมวด ๓
ความผิดฐานฉ้อโกง
มาตรา ๓๔๑ ผู้ใดโดยทุจริต หลอกลวงผู้อื่นด้วยการแสดงข้อความอันเป็นเท็จ หรือปกปิดข้อความจริงซึ่งควรบอกให้แจ้ง และโดยการหลอกลวงดังว่านั้นได้ไปซึ่งทรัพย์สินจากผู้ถูกหลอกลวงหรือบุคคลที่สาม หรือทำให้ผู้ถูกหลอกลวงหรือบุคคลที่สามทำ ถอนหรือทำลายเอกสารสิทธิ ผู้นั้นกระทำความผิดฐานฉ้อโกง ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๔๒ ถ้าในการกระทำความผิดฐานฉ้อโกง ผู้กระทำ
(๑) แสดงตนเป็นคนอื่น หรือ
(๒) อาศัยความเบาปัญญาของผู้ถูกหลอกลวงซึ่งเป็นเด็ก หรืออาศัยความอ่อนแอแห่งจิตของผู้ถูกหลอกลวง
ผู้กระทำต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๔๓ ถ้าการกระทำความผิดตามมาตรา ๓๔๑ ได้กระทำด้วยการแสดงข้อความอันเป็นเท็จต่อประชาชน หรือด้วยการปกปิดความจริง ซึ่งควรบอกให้แจ้งแก่ประชาชน ผู้กระทำต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
ถ้าการกระทำความผิดดังกล่าวในวรรคแรก ต้องด้วยลักษณะดังกล่าวในมาตรา ๓๔๒ อนุมาตราหนึ่งอนุมาตราใดด้วย ผู้กระทำต้องระวางโทษจำคุกตั้งแต่หกเดือนถึงเจ็ดปี และปรับตั้งแต่หนึ่งหมื่นบาทถึงหนึ่งแสนสี่หมื่นบาท
มาตรา ๓๔๔ ผู้ใดโดยทุจริต หลอกลวงบุคคลตั้งแต่สิบคนขึ้นไปให้ประกอบการงานอย่างใด ๆ ให้แก่ตนหรือให้แก่บุคคลที่สาม โดยจะไม่ใช้ค่าแรงงานหรือค่าจ้างแก่บุคคลเหล่านั้น หรือโดยจะใช้ค่าแรงงานหรือค่าจ้างแก่บุคคลเหล่านั้นต่ำกว่าที่ตกลงกัน ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๔๕ ผู้ใดสั่งซื้อและบริโภคอาหารหรือเครื่องดื่ม หรือเข้าอยู่ในโรงแรม โดยรู้ว่าตนไม่สามารถชำระเงินค่าอาหาร ค่าเครื่องดื่ม หรือค่าอยู่ในโรงแรมนั้น ต้องระวางโทษจำคุกไม่เกินสามเดือน หรือปรับไม่เกินห้าพันบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๔๖ ผู้ใดเพื่อเอาทรัพย์สินของผู้อื่นเป็นของตนหรือของบุคคลที่สาม ชักจูงผู้หนึ่งผู้ใดให้จำหน่ายโดยเสียเปรียบซึ่งทรัพย์สิน โดยอาศัยเหตุที่ผู้ถูกชักจูงมีจิตอ่อนแอหรือเป็นเด็กเบาปัญญา และไม่สามารถเข้าใจตามควรซึ่งสาระสำคัญแห่งการกระทำของตน จนผู้ถูกชักจูงจำหน่ายซึ่งทรัพย์สินนั้น ต้องระวางโทษจำคุกไม่เกินสองปี หรือปรับไม่เกินสี่หมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๔๗ ผู้ใดเพื่อให้ตนเองหรือผู้อื่นได้รับประโยชน์จากการประกันวินาศภัย แกล้งทำให้เกิดเสียหายแก่ทรัพย์สินอันเป็นวัตถุที่เอาประกันภัย ต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๔๘ ความผิดในหมวดนี้ นอกจากความผิดตามมาตรา ๓๔๓ เป็นความผิดอันยอมความได้
หมวด ๔
ความผิดฐานโกงเจ้าหนี้
มาตรา ๓๔๙ ผู้ใดเอาไปเสีย ทำให้เสียหาย ทำลาย ทำให้เสื่อมค่า หรือทำให้ไร้ประโยชน์ซึ่งทรัพย์อันตนจำนำไว้แก่ผู้อื่น ถ้าได้กระทำเพื่อให้เกิดความเสียหายแก่ผู้รับจำนำ ต้องระวางโทษจำคุกไม่เกินสองปี หรือปรับไม่เกินสี่หมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๕๐ ผู้ใดเพื่อมิให้เจ้าหนี้ของตนหรือของผู้อื่นได้รับชำระหนี้ทั้งหมดหรือแต่บางส่วน ซึ่งได้ใช้หรือจะใช้สิทธิเรียกร้องทางศาลให้ชำระหนี้ ย้ายไปเสีย ซ่อนเร้นหรือโอนไปให้แก่ผู้อื่นซึ่งทรัพย์ใดก็ดี แกล้งให้ตนเองเป็นหนี้จำนวนใดอันไม่เป็นความจริงก็ดี ต้องระวางโทษจำคุกไม่เกินสองปี หรือปรับไม่เกินสี่หมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๕๑ ความผิดในหมวดนี้เป็นความผิดอันยอมความได้
หมวด ๕
ความผิดฐานยักยอก
มาตรา ๓๕๒ ผู้ใดครอบครองทรัพย์ซึ่งเป็นของผู้อื่นหรือซึ่งผู้อื่นเป็นเจ้าของรวมอยู่ด้วย เบียดบังเอาทรัพย์นั้นเป็นของตนหรือบุคคลที่สามโดยทุจริต ผู้นั้นกระทำความผิดฐานยักยอก ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
ถ้าทรัพย์นั้นได้ตกมาอยู่ในความครอบครองของผู้กระทำความผิด เพราะผู้อื่นส่งมอบให้โดยสำคัญผิดไปด้วยประการใด หรือเป็นทรัพย์สินหายซึ่งผู้กระทำความผิดเก็บได้ ผู้กระทำต้องระวางโทษแต่เพียงกึ่งหนึ่ง
มาตรา ๓๕๓ ผู้ใดได้รับมอบหมายให้จัดการทรัพย์สินของผู้อื่น หรือทรัพย์สินซึ่งผู้อื่นเป็นเจ้าของรวมอยู่ด้วย กระทำผิดหน้าที่ของตนด้วยประการใด ๆ โดยทุจริต จนเป็นเหตุให้เกิดความเสียหายแก่ประโยชน์ในลักษณะที่เป็นทรัพย์สินของผู้นั้น ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๕๔ ถ้าการกระทำความผิดตามมาตรา ๓๕๒ หรือมาตรา ๓๕๓ ได้กระทำในฐานที่ผู้กระทำความผิดเป็นผู้จัดการทรัพย์สินของผู้อื่นตามคำสั่งของศาล หรือตามพินัยกรรม หรือในฐานเป็นผู้มีอาชีพหรือธุรกิจ อันย่อมเป็นที่ไว้วางใจของประชาชน ผู้กระทำต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๕๕ ผู้ใดเก็บได้ซึ่งสังหาริมทรัพย์อันมีค่า อันซ่อนหรือฝังไว้โดยพฤติการณ์ซึ่งไม่มีผู้ใดอ้างว่าเป็นเจ้าของได้แล้วเบียดบังเอาทรัพย์นั้นเป็นของตนหรือของผู้อื่น ต้องระวางโทษจำคุกไม่เกินหนึ่งปี หรือปรับไม่เกินสองหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๕๖ ความผิดในหมวดนี้เป็นความผิดอันยอมความได้
หมวด ๖
ความผิดฐานรับของโจร
มาตรา ๓๕๗ ผู้ใดช่วยซ่อนเร้น ช่วยจำหน่าย ช่วยพาเอาไปเสีย ซื้อ รับจำนำหรือรับไว้โดยประการใดซึ่งทรัพย์อันได้มาโดยการกระทำความผิด ถ้าความผิดนั้นเข้าลักษณะลักทรัพย์ วิ่งราวทรัพย์ กรรโชก รีดเอาทรัพย์ ชิงทรัพย์ ปล้นทรัพย์ ฉ้อโกง ยักยอกหรือเจ้าพนักงานยักยอกทรัพย์ ผู้นั้นกระทำความผิดฐานรับของโจร ต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
ถ้าการกระทำความผิดฐานรับของโจรนั้น ได้กระทำเพื่อค้ากำไรหรือได้กระทำต่อทรัพย์อันได้มาโดยการลักทรัพย์ตามมาตรา ๓๓๕ (๑๐) ชิงทรัพย์ หรือปล้นทรัพย์ ผู้กระทำต้องระวางโทษจำคุกตั้งแต่หกเดือนถึงสิบปี และปรับตั้งแต่หนึ่งหมื่นบาทถึงสองแสนบาท
ถ้าการกระทำความผิดฐานรับของโจรนั้น ได้กระทำต่อทรัพย์อันได้มาโดยการลักทรัพย์ตามมาตรา ๓๓๕ ทวิ การชิงทรัพย์ตามมาตรา ๓๓๙ ทวิ หรือการปล้นทรัพย์ตามมาตรา ๓๔๐ ทวิ ผู้กระทำต้องระวางโทษจำคุกตั้งแต่ห้าปีถึงสิบห้าปี และปรับตั้งแต่หนึ่งแสนบาทถึงสามแสนบาท
หมวด ๗
ความผิดฐานทำให้เสียทรัพย์
มาตรา ๓๕๘ ผู้ใดทำให้เสียหาย ทำลาย ทำให้เสื่อมค่าหรือทำให้ไร้ประโยชน์ ซึ่งทรัพย์ของผู้อื่นหรือผู้อื่นเป็นเจ้าของรวมอยู่ด้วย ผู้นั้นกระทำความผิดฐานทำให้เสียทรัพย์ ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๕๙ ถ้าการกระทำความผิดตามมาตรา ๓๕๘ ได้กระทำต่อ
(๑) เครื่องกลหรือเครื่องจักรที่ใช้ในการประกอบกสิกรรมหรืออุตสาหกรรม
(๒) ปศุสัตว์
(๓) ยวดยานหรือสัตว์พาหนะที่ใช้ในการขนส่งสาธารณะหรือในการประกอบกสิกรรมหรืออุตสาหกรรม หรือ
(๔) พืชหรือพืชผลของกสิกร
ผู้กระทำต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๖๐ ผู้ใดทำให้เสียหาย ทำลาย ทำให้เสื่อมค่าหรือทำให้ไร้ประโยชน์ซึ่งทรัพย์ที่ใช้หรือมีไว้เพื่อสาธารณประโยชน์ ต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๖๐ ทวิ ผู้ใดทำให้เสียหาย ทำลาย ทำให้เสื่อมค่า หรือทำให้ไร้ประโยชน์ ซึ่งทรัพย์ตามมาตรา ๓๓๕ ทวิ วรรคหนึ่ง ที่ประดิษฐานอยู่ในสถานที่ตามมาตรา ๓๓๕ ทวิ วรรคสอง ต้องระวางโทษ จำคุกไม่เกินสิบปี หรือปรับไม่เกินสองแสนบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๖๑ ความผิดตามมาตรา ๓๕๘ และมาตรา ๓๕๙ เป็นความผิดอันยอมความได้
หมวด ๘
ความผิดฐานบุกรุก
มาตรา ๓๖๒ ผู้ใดเข้าไปในอสังหาริมทรัพย์ของผู้อื่นเพื่อถือการครอบครองอสังหาริมทรัพย์นั้นทั้งหมดหรือแต่บางส่วน หรือเข้าไปกระทำการใด ๆ อันเป็นการรบกวนการครอบครองอสังหาริมทรัพย์ของเขาโดยปกติสุข ต้องระวางโทษจำคุกไม่เกินหนึ่งปี หรือปรับไม่เกินสองหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๖๓ ผู้ใดเพื่อถือเอาอสังหาริมทรัพย์ของผู้อื่นเป็นของตนหรือของบุคคลที่สาม ยักย้ายหรือทำลายเครื่องหมายเขตแห่งอสังหาริมทรัพย์นั้นทั้งหมดหรือแต่บางส่วน ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๖๔ ผู้ใดโดยไม่มีเหตุอันสมควร เข้าไปหรือซ่อนตัวอยู่ในเคหสถาน อาคารเก็บรักษาทรัพย์หรือสำนักงานในความครอบครองของผู้อื่น หรือไม่ยอมออกไปจากสถานที่เช่นว่านั้นเมื่อผู้มีสิทธิที่จะห้ามมิให้เข้าไปได้ไล่ให้ออก ต้องระวางโทษจำคุกไม่เกินหนึ่งปี หรือปรับไม่เกินสองหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๖๕ ถ้าการกระทำความผิดตามมาตรา ๓๖๒ มาตรา ๓๖๓ หรือมาตรา ๓๖๔ ได้กระทำ
(๑) โดยใช้กำลังประทุษร้าย หรือขู่เข็ญว่าจะใช้กำลังประทุษร้าย
(๒) โดยมีอาวุธหรือโดยร่วมกระทำความผิดด้วยกันตั้งแต่สองคนขึ้นไป หรือ
(๓) ในเวลากลางคืน
ผู้กระทำต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๖๖ ความผิดในหมวดนี้ นอกจากความผิดตามมาตรา ๓๖๕ เป็นความผิดอันยอมความได้
ลักษณะ ๑๓
ความผิดเกี่ยวกับศพ
มาตรา ๓๖๖/๑ ผู้ใดกระทำเพื่อสนองความใคร่ของตน โดยการใช้อวัยวะเพศของตนล่วงล้ำอวัยวะเพศ ทวารหนัก หรือช่องปากของศพ ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๖๖/๒ ผู้ใดกระทำอนาจารแก่ศพ ต้องระวางโทษจำคุกไม่เกินสองปี หรือปรับไม่เกินสี่หมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๖๖/๓ ผู้ใดโดยไม่มีเหตุอันสมควร ทำให้เสียหาย เคลื่อนย้าย ทำลาย ทำให้เสื่อมค่าหรือทำให้ไร้ประโยชน์ ซึ่งศพ ส่วนของศพ อัฐิ หรือเถ้าของศพ ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๖๖/๔ ผู้ใดกระทำด้วยประการใด ๆ อันเป็นการดูหมิ่นเหยียดหยามศพ ต้องระวางโทษจำคุกไม่เกินสามเดือน หรือปรับไม่เกินห้าพันบาท หรือทั้งจำทั้งปรับ
ภาค ๓
ลหุโทษ
มาตรา ๓๖๗ ผู้ใดเมื่อเจ้าพนักงานถามชื่อหรือที่อยู่เพื่อปฏิบัติการตามกฎหมาย ไม่ยอมบอกหรือแกล้งบอกชื่อหรือที่อยู่อันเป็นเท็จ ต้องระวางโทษปรับไม่เกินหนึ่งพันบาท
มาตรา ๓๖๘ ผู้ใดทราบคำสั่งของเจ้าพนักงานซึ่งสั่งการตามอำนาจที่มีกฎหมายให้ไว้ ไม่ปฏิบัติตามคำสั่งนั้นโดยไม่มีเหตุหรือข้อแก้ตัวอันสมควร ต้องระวางโทษจำคุกไม่เกินสิบวัน หรือปรับไม่เกินห้าพันบาท หรือทั้งจำทั้งปรับ 
ถ้าการสั่งเช่นว่านั้น เป็นคำสั่งให้ช่วยทำกิจการในหน้าที่ของเจ้าพนักงานซึ่งกฎหมายกำหนดให้สั่งให้ช่วยได้ ต้องระวางโทษจำคุกไม่เกินหนึ่งเดือน หรือปรับไม่เกินหนึ่งหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๖๙ ผู้ใดกระทำด้วยประการใด ๆ ให้ประกาศภาพโฆษณา หรือเอกสารใดที่เจ้าพนักงานผู้กระทำการตามหน้าที่ปิดหรือแสดงไว้ หรือสั่งให้ปิด หรือแสดงไว้ หลุดฉีกหรือไร้ประโยชน์ ต้องระวางโทษปรับไม่เกินห้าพันบาท
มาตรา ๓๗๐ ผู้ใดส่งเสียง ทำให้เกิดเสียงหรือกระทำความอื้ออึงโดยไม่มีเหตุอันสมควร จนทำให้ประชาชนตกใจหรือเดือดร้อน ต้องระวางโทษปรับไม่เกินหนึ่งพันบาท
มาตรา ๓๗๑ ผู้ใดพาอาวุธไปในเมือง หมู่บ้านหรือทางสาธารณะโดยเปิดเผยหรือโดยไม่มีเหตุสมควร หรือพาไปในชุมนุมชนที่ได้จัดให้มีขึ้นเพื่อนมัสการ การรื่นเริงหรือการอื่นใด ต้องระวางโทษปรับไม่เกินหนึ่งพันบาท และให้ศาลมีอำนาจสั่งให้ริบอาวุธนั้น
มาตรา ๓๗๒ ผู้ใดทะเลาะกันอย่างอื้ออึงในทางสาธารณะหรือสาธารณสถาน หรือกระทำโดยประการอื่นใดให้เสียความสงบเรียบร้อยในทางสาธารณะหรือสาธารณสถาน ต้องระวางโทษปรับไม่เกินห้าพันบาท
มาตรา ๓๗๓ ผู้ใดควบคุมดูแลบุคคลวิกลจริต ปล่อยปละละเลยให้บุคคลวิกลจริตนั้นออกเที่ยวไปโดยลำพัง ต้องระวางโทษปรับไม่เกินห้าพันบาท
มาตรา ๓๗๔ ผู้ใดเห็นผู้อื่นตกอยู่ในภยันตรายแห่งชีวิตซึ่งตนอาจช่วยได้โดยไม่ควรกลัวอันตรายแก่ตนเองหรือผู้อื่นแต่ไม่ช่วยตามความจำเป็น ต้องระวางโทษจำคุกไม่เกินหนึ่งเดือน หรือปรับไม่เกินหนึ่งหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๗๕ ผู้ใดทำให้รางระบายน้ำ ร่องน้ำหรือท่อระบายของโสโครก อันเป็นสิ่งสาธารณะเกิดขัดข้องหรือไม่สะดวก ต้องระวางโทษปรับไม่เกินห้าพันบาท
มาตรา ๓๗๖ ผู้ใดยิงปืนซึ่งใช้ดินระเบิดโดยใช่เหตุในเมือง หมู่บ้านหรือที่ชุมนุมชน ต้องระวางโทษจำคุกไม่เกินสิบวัน หรือปรับไม่เกินห้าพันบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๗๗ ผู้ใดควบคุมสัตว์ดุหรือสัตว์ร้าย ปล่อยปละละเลยให้สัตว์นั้นเที่ยวไปโดยลำพัง ในประการที่อาจทำอันตรายแก่บุคคลหรือทรัพย์ ต้องระวางโทษจำคุกไม่เกินหนึ่งเดือน หรือปรับไม่เกินหนึ่งหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๗๘ ผู้ใดเสพสุราหรือของเมาอย่างอื่น จนเป็นเหตุให้ตนเมา ประพฤติวุ่นวายหรือครองสติไม่ได้ขณะอยู่ในถนนสาธารณะ หรือสาธารณสถาน ต้องระวางโทษปรับไม่เกินห้าพันบาท
มาตรา ๓๗๙ ผู้ใดชักหรือแสดงอาวุธในการวิวาทต่อสู้ ต้องระวางโทษจำคุกไม่เกินสิบวัน หรือปรับไม่เกินห้าพันบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๘๐ ผู้ใดทำให้เกิดปฏิกูลแก่น้ำในบ่อ สระหรือที่ขังน้ำอันมีไว้สำหรับประชาชนใช้สอย ต้องระวางโทษจำคุกไม่เกินหนึ่งเดือน หรือปรับไม่เกินหนึ่งหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๘๑ ผู้ใดกระทำการทารุณต่อสัตว์ หรือฆ่าสัตว์โดยให้ได้รับทุกขเวทนาอันไม่จำเป็น ต้องระวางโทษจำคุกไม่เกินหนึ่งเดือน หรือปรับไม่เกินหนึ่งหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๘๒ ผู้ใดใช้ให้สัตว์ทำงานจนเกินสมควรหรือใช้ให้ทำงานอันไม่สมควร เพราะเหตุที่สัตว์นั้นป่วยเจ็บ ชราหรืออ่อนอายุ ต้องระวางโทษจำคุกไม่เกินหนึ่งเดือน หรือปรับไม่เกินหนึ่งหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๘๓ ผู้ใดเมื่อเกิดเพลิงไหม้หรือสาธารณภัยอื่น และเจ้าพนักงานเรียกให้ช่วยระงับ ถ้าผู้นั้นสามารถช่วยได้แต่ไม่ช่วย ต้องระวางโทษจำคุกไม่เกินหนึ่งเดือน หรือปรับไม่เกินหนึ่งหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๘๔ ผู้ใดแกล้งบอกเล่าความเท็จให้เลื่องลือจนเป็นเหตุให้ประชาชนตื่นตกใจ ต้องระวางโทษจำคุกไม่เกินหนึ่งเดือน หรือปรับไม่เกินหนึ่งหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๘๕ ผู้ใดโดยไม่ได้รับอนุญาตอันชอบด้วยกฎหมาย กีดขวางทางสาธารณะ จนอาจเป็นอุปสรรคต่อความปลอดภัยหรือความสะดวกในการจราจร โดยวาง หรือทอดทิ้งสิ่งของ หรือโดยกระทำด้วยประการอื่นใด ถ้าการกระทำนั้นเป็นการกระทำโดยไม่จำเป็น ต้องระวางโทษปรับไม่เกินห้าพันบาท
มาตรา ๓๘๖ ผู้ใดขุดหลุมหรือราง หรือปลูกปักหรือวางสิ่งของเกะกะไว้ในทางสาธารณะ โดยไม่ได้รับอนุญาตอันชอบด้วยกฎหมาย หรือทำได้โดยชอบด้วยกฎหมาย แต่ละเลยไม่แสดงสัญญาณตามสมควร เพื่อป้องกันอุปัทวเหตุ ต้องระวางโทษปรับไม่เกินห้าพันบาท
มาตรา ๓๘๗ ผู้ใดแขวน ติดตั้งหรือวางสิ่งใดไว้โดยประการที่น่าจะตกหรือพังลง ซึ่งจะเป็นเหตุอันตราย เปรอะเปื้อนหรือเดือดร้อนแก่ผู้สัญจรในทางสาธารณะ ต้องระวางโทษปรับไม่เกินห้าพันบาท
มาตรา ๓๘๘ ผู้ใดกระทำการอันควรขายหน้าต่อหน้าธารกำนัล โดยเปลือยหรือเปิดเผยร่างกาย หรือกระทำการลามกอย่างอื่น ต้องระวางโทษปรับไม่เกินห้าพันบาท
มาตรา ๓๘๙ ผู้ใดกระทำด้วยประการใด ๆ ให้ของแข็งตกลง ณ ที่ใด ๆ โดยประการที่น่าจะเป็นอันตรายหรือเดือดร้อนรำคาญแก่บุคคล หรือเป็นอันตรายแก่ทรัพย์ หรือกระทำด้วยประการใด ๆ ให้ของโสโครกเปรอะเปื้อนหรือน่าจะเปรอะเปื้อน ตัวบุคคล หรือทรัพย์ หรือแกล้งทำให้ของโสโครกเป็นที่เดือดร้อนรำคาญ ต้องระวางโทษจำคุกไม่เกินหนึ่งเดือน หรือปรับไม่เกินหนึ่งหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๙๐ ผู้ใดกระทำโดยประมาท และการกระทำนั้นเป็นเหตุให้ผู้อื่นรับอันตรายแก่กายหรือจิตใจ ต้องระวางโทษจำคุกไม่เกินหนึ่งเดือน หรือปรับไม่เกินหนึ่งหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๙๑ ผู้ใดใช้กำลังทำร้ายผู้อื่นโดยไม่ถึงกับเป็นเหตุให้เกิดอันตรายแก่กายหรือจิตใจ ต้องระวางโทษจำคุกไม่เกินหนึ่งเดือน หรือปรับไม่เกินหนึ่งหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๙๒ ผู้ใดทำให้ผู้อื่นเกิดความกลัวหรือความตกใจ โดยการขู่เข็ญ ต้องระวางโทษจำคุกไม่เกินหนึ่งเดือน หรือปรับไม่เกินหนึ่งหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๙๓ ผู้ใดดูหมิ่นผู้อื่นซึ่งหน้าหรือด้วยการโฆษณา ต้องระวางโทษ จำคุกไม่เกินหนึ่งเดือน หรือปรับไม่เกินหนึ่งหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๙๔ ผู้ใดไล่ ต้อนหรือทำให้สัตว์ใด ๆ เข้าในสวน ไร่หรือนาของผู้อื่นที่ได้แต่งดินไว้ เพาะพันธุ์ไว้ หรือมีพืชพันธุ์หรือผลิตผลอยู่ ต้องระวางโทษจำคุกไม่เกินหนึ่งเดือน หรือปรับไม่เกินหนึ่งหมื่นบาท หรือทั้งจำทั้งปรับ
มาตรา ๓๙๕ ผู้ใดควบคุมสัตว์ใด ๆ ปล่อยปละละเลยให้สัตว์นั้นเข้าในสวน ไร่หรือนาของผู้อื่นที่ได้แต่งดินไว้ เพาะพันธุ์ไว้ หรือมีพืชพันธุ์หรือผลิตผลอยู่ ต้องระวางโทษปรับไม่เกินห้าพันบาท
มาตรา ๓๙๖ ผู้ใดทิ้งซากสัตว์ซึ่งอาจเน่าเหม็น ในหรือริมทางสาธารณะ ต้องระวางโทษปรับไม่เกินห้าพันบาท
มาตรา ๓๙๗ ผู้ใดกระทำด้วยประการใด ๆ ต่อผู้อื่น อันเป็นการรังแก ข่มเหง คุกคาม หรือกระทำให้ได้รับความอับอายหรือเดือดร้อนรำคาญ ต้องระวางโทษปรับไม่เกินห้าพันบาท 
ถ้าการกระทำความผิดตามวรรคหนึ่งเป็นการกระทำในที่สาธารณสถานหรือต่อหน้าธารกำนัล หรือเป็นการกระทำอันมีลักษณะส่อไปในทางที่จะล่วงเกินทางเพศ ต้องระวางโทษจำคุกไม่เกินหนึ่งเดือน หรือปรับไม่เกินหนึ่งหมื่นบาท หรือทั้งจำทั้งปรับ 
ถ้าการกระทำความผิดตามวรรคสองเป็นการกระทำโดยอาศัยเหตุที่ผู้กระทำมีอำนาจเหนือผู้ถูกกระทำอันเนื่องจากความสัมพันธ์ในฐานะที่เป็นผู้บังคับบัญชา นายจ้าง หรือผู้มีอำนาจเหนือประการอื่น ต้องระวางโทษจำคุกไม่เกินหนึ่งเดือน และปรับไม่เกินหนึ่งหมื่นบาท
มาตรา ๓๙๘ ผู้ใดกระทำด้วยประการใด ๆ อันเป็นการทารุณต่อเด็กอายุยังไม่เกินสิบห้าปี คนป่วยเจ็บ หรือคนชรา ซึ่งต้องพึ่งผู้นั้นในการดำรงชีพหรือการอื่นใด ต้องระวางโทษ จำคุกไม่เกินหนึ่งเดือน หรือปรับไม่เกินหนึ่งหมื่นบาท หรือทั้งจำทั้งปรับ
`;
